[{"title": "In a Complex World, Simple Wins!", "date": "Apr 01, 2022", "year": 2022, "location": "Field", "excerpt": "By Scott GlasgowThe world is complex and connected in ways we don’t fully understand.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edcc5306e905fe847d9_623fc2776b70a71576ed507b_Screen%2520Shot%25202022-03-26%2520at%25209.47.16%2520PM.png", "body": "<p id=\"\">By Scott Glasgow</p><p id=\"\">The world is complex and connected in ways we don’t fully understand. Everything from products to personalities has a brand, a logo, an experience.</p><h4 id=\"\"><strong id=\"\">Most are instantly forgettable.</strong></h4><p id=\"\">They look and feel the same as everything else. They’re built on rational thinking and they follow trends instead of forging them. A great brand is the opposite.</p><p id=\"\">At <a href=\"https://finmango.org/\" id=\"\"><strong id=\"\">FinMango</strong></a>, simple wins in our brand and design philosophy. It is what guides what we do for the people we reach and how we act as an organization.</p><h4 id=\"\"><a href=\"https://finlit.finmango.org/the-feynman-technique/\" id=\"\">The Feynman Technique:</a></h4><p id=\"\">The Feynman Technique is a learning framework that forces you to strip away needless complexity. It was developed by Richard Feynman, a Noble Prize winning theoretical physicist from the United States.</p><p id=\"\">Interestingly, Feynman’s true genius was in his ability to convey complex ideas into simple, digestible ways. He observed that complexity and fluff are often used to mask a lack of deep understanding.</p><p id=\"\">The Feynman Technique incorporates four steps:</p><ol id=\"\"><li id=\"\"><strong id=\"\">Pick and study a topic</strong></li><li id=\"\"><strong id=\"\">Be able to explain it to a kid</strong></li><li id=\"\"><strong id=\"\">Identify any gaps in your understanding</strong></li><li id=\"\"><strong id=\"\">Review and simplify</strong></li></ol><p id=\"\">You can learn more about the Feynman technique <a href=\"https://finlit.finmango.org/the-feynman-technique/\" id=\"\"><strong id=\"\">here</strong></a>.</p><h4 id=\"\">Mathematical Illustration.</h4><p id=\"\">Let’s look at a mathematical problem that “looks” complex:</p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1459px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1459px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edcc5306e085de847e0_623fc2b1bfb79e48edfe8dc3_Screen%2520Shot%25202022-03-26%2520at%25209.45.20%2520PM.png\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">Do you know the answer? Interestingly, most don’t even attempt, few try, and everyone fails. It comes across as complex and intimidating.</p><h4 id=\"\">So, Let’s Break it Down!</h4><p id=\"\">Below is an example of how I teach kids…</p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1466px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1466px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edcc5306eaef4e847df_623fc2c7f7abaa40dcfce5c7_Screen%2520Shot%25202022-03-26%2520at%25209.46.05%2520PM.png\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h4 id=\"\">Steps.</h4><ol id=\"\"><li id=\"\">Separate. Mentally draw a line between the first and second numbers.</li><li id=\"\">On the left, take “x” and multiply it by “(x+1).”</li><li id=\"\">On the right, simply square the number: y(y).</li><li id=\"\">Merge. Combine both answers to get your final answer.</li></ol><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1444px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1444px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edcc5306e8317e847de_623fc2a4248561414d9c46dc_Screen%2520Shot%25202022-03-26%2520at%25209.46.34%2520PM.png\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\"><em id=\"\">*NOTE: this trick only works when the number ends in a “5.”</em></p><h3 id=\"\">Summary? Simple Wins!</h3><p id=\"\">It is easy to overcomplicate and intimidate. We all know the people and can admit to times we have done it as well. However, we cannot be fooled—complexity and fluff are often used to mask a lack of deep understanding.</p><ul id=\"\"><li id=\"\"><strong id=\"\">Simple is generous.</strong></li><li id=\"\">A simple idea is generous because it is understood by your customers, team, and community. It is easy to use and actively helps everyone.</li><li id=\"\"><strong id=\"\">Simple makes bold possible.</strong></li><li id=\"\">Once we have our simple idea down, we give ourselves the rare opportunity to do what the vast majority never do: to be bold and stand out in an ever-complex world.</li><li id=\"\"><strong id=\"\">Simple provides direction.</strong></li><li id=\"\">Thinking simple provides us not with a destination, but a direction. It gives us the “why” and how we can grow in that direction.</li></ul><h4 id=\"\">Conclusion.</h4><p id=\"\">It is easy to feel intimidated in such a complex world—both personally and professionally. However, we don’t have to accept this fate. Thinking “simple” can help us overcome challenges—no matter how small or large—by breaking it down with focus and clarity. Think simple, it’s how we operate at FinMango!</p><h6 id=\"\">*** This post is being reposted. It was originally written and posted in August of 2021.</h6><p id=\"\">‍</p>", "is_field": true}, {"title": "Strategic Planning Process Update", "date": "Jun 03, 2022", "year": 2022, "location": "Field", "excerpt": "The mango is one of the most popular fruits in the world.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/6390a730c0d0128e37589451_62bc8ddad82619c1e323311f_Untitled%2520design%2520(69).jpeg", "body": "<p id=\"\">The mango is one of the most popular fruits in the world. Simplistically, most would say it is oval and orange, but the mango can actually be found in a multitude of sizes, colors, and tastes. Hundreds of varieties exist. At first glance, the mango seems like a typical fruit. But further assessment reveals much more complexity. </p><p id=\"\">I couldn’t resist reminiscing on this assessment during a discussion on the Cynefin Framework – a model used in adaptive leadership to assess complex concepts and address real-world problems. The model depicts five contexts for problem-solving and action: simple, complicated, complex, chaotic, and finally, disorder. Learn more about it <a href=\"https://youtu.be/epXqgrm2hs4\" id=\"\">here</a>.</p><p id=\"\">At an organizational level, FinMango’s work aligns with the “complex,” or systems, context. Our approach will be experimentation with an emphasis on probing, sensing, and then responding.</p><p id=\"\">Though a complex system may appear predictable, hindsight does not lead to foresight because at the end of the day, external systems constantly change. This means that we cannot predict what will happen and that the system is dynamic. Solutions can’t be imposed; rather, they emerge from the circumstances and are often put into action through influence.</p><p id=\"\">Moving forward, it’s evident – thanks to the community survey – that our work should focus on the complex context of young adults around the world and their financial stability. More specifically, thanks to your input, we should focus on supporting that stability to young adults in times of transition. </p><p id=\"\">FinMango has come far — and these changes may not be easy. It’s going to require us to think and act much differently than we have in the past. Nevertheless, It is you, our “mango” family, that has energized us to reach this point. I have never been so excited about our future and feel even more committed to help young adults, and even more passionate about the cause of helping people in transition. I firmly believe now more than ever, FinMango is moving in the right direction with a clear focus. </p><p id=\"\">Do you have questions? Reach out to us!</p><ul id=\"\"><li id=\"\">For <strong id=\"\">questions about the strategic planning process itself</strong>–what we have done, what we have learned and where we are heading, reach out to <a href=\"mailto:katherine@finmango.org\" id=\"\">@Katherine Lordi</a>. </li><li id=\"\">If you want to <strong id=\"\">help us move our work forward</strong> during this time of transition, please &nbsp;reach out to <a href=\"mailto:jenkema@finmango.org\" id=\"\">@Jack Enkema</a> about supporting the vetting and rollout of the Company Benefits and Definitions Guide.</li><li id=\"\">If you’re as excited as we are about FinMango’s future and <strong id=\"\">want to help once we roll out our strategic plan</strong>, let <a href=\"mailto:Kaylei@finmango.org\" id=\"\">@Kaylei Ruffing</a> or <a href=\"mailto:oj@finmango.org\" id=\"\">@OJ Singh</a> know. Communication and branding work will be important in FinMango 2.0.</li><li id=\"\">If you’re curious about the <strong id=\"\">design and strategic theory</strong> behind our planning process, contact <a href=\"mailto:chrisashannon@gmail.com\" id=\"\">@Chris Shannon</a>.</li></ul><p id=\"\">Let's mango,</p>", "is_field": true}, {"title": "Strategic Planning Process Update", "date": "May 25, 2022", "year": 2022, "location": "Field", "excerpt": "Mango Family, As our strategic planning process continues to evolve, I’d like to share an update.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/6390a72fcc27e9d38c049cef_62bc8d8ef3c953460de68ed0_1653485083086%2520(2).jpeg", "body": "<p id=\"\">Mango Family, </p><p id=\"\">As our strategic planning process continues to evolve, I’d like to share an update.</p><p id=\"\">The strategic planning team consists of eight thoughtfully picked Mangos – <a href=\"https://www.linkedin.com/in/katherine-lordi/\" id=\"\"><strong id=\"\">Katherine Lordi</strong></a><strong id=\"\">, </strong><a href=\"https://www.linkedin.com/in/gauthamkannan95/\" id=\"\"><strong id=\"\">Gautham Kannan</strong></a><strong id=\"\">, </strong><a href=\"https://www.linkedin.com/in/ojasvinee-singh/\" id=\"\"><strong id=\"\">Ojasvinee Singh</strong></a><strong id=\"\">, </strong><a href=\"https://www.linkedin.com/in/bruna-ch%C3%ADxaro-37a98a105/\" id=\"\"><strong id=\"\">Bruna Chíxaro</strong></a><strong id=\"\">, </strong><a href=\"https://www.linkedin.com/in/tobias-abramenko-964b95196/\" id=\"\"><strong id=\"\">Tobias Abramenko</strong></a><strong id=\"\">, </strong><a href=\"https://www.linkedin.com/in/avneeshsawhney/\" id=\"\"><strong id=\"\">Avneesh Sawhney</strong></a><strong id=\"\">, </strong><a href=\"https://www.linkedin.com/in/dominic-julian-a47077169/\" id=\"\"><strong id=\"\">Dominic Julian</strong></a><strong id=\"\">, </strong><a href=\"https://www.linkedin.com/in/sglasgow/\" id=\"\"><strong id=\"\">Scott Glasgow</strong></a> – &nbsp;and one facilitator – <a href=\"https://www.linkedin.com/in/chrisshannon1/\" id=\"\"><strong id=\"\">Chris Shannon</strong></a>. Each member was carefully selected based on their availability and skill sets related to project management, communication, stakeholder voice, and membership voice.</p><p id=\"\">Starting today, we will begin updating the community on a weekly basis. </p><p id=\"\">To date, our time has been spent <strong id=\"\">surveying</strong>, <strong id=\"\">mapping the financial education ecosystem</strong>, <strong id=\"\">creating empathy maps</strong>, and <strong id=\"\">conducting supplemental research</strong>. Looking ahead, we will <strong id=\"\">identify a potential target population</strong> where we believe we will have a deep and unique impact, <strong id=\"\">define the problem we are trying to solve</strong> for that population through our collective efforts, and use this information to <strong id=\"\">revise our mission statement and draft a vision statement</strong> to guide our work in the coming years. Following those developments, we’ll jump into creating strategies to achieve that vision, including objectives and key results (OKRs) as well as our criteria for success. </p><h3 id=\"\">We will publicly present FinMango’s refined strategic direction on <strong id=\"\">July 22nd – National Mango Day!</strong></h3><p id=\"\">I look forward to learning as we go and sharing more frequently, all in service of fostering a collaborative and transparent approach to this process. </p><p id=\"\">For many of you, I know that this transition represents a long-awaited milestone and a positive sign that we can engage more fully-focused moving forward. For others, it may also be an unsettling change. <strong id=\"\">I want you to know that we are deeply honored by your commitment to FinMango and the work you are doing around the world to create positive change.</strong> We are committed to making sure that your personal and professional needs are still being met as we enter this next phase together – I know there is a lot of excitement, and with that can come questions! To make sure you are getting the information you need from the best source, please direct questions to the following Mangos:</p><ul id=\"\"><li id=\"\">For questions about the strategic planning process itself–what we have done, what we have learned and where we are heading, reach out to Katherine (katherine@finmango.org). </li><li id=\"\">If you want to help us move our work forward during this time of transition, please &nbsp;reach out to Jack (jenkema@finmango.org) about supporting the vetting and rollout of the Company Benefits and Definitions Guide. </li><li id=\"\">Communication is going to play a very important role in the next six months; consider supporting OJ (oj@finmango.org) with her communications and branding work.</li><li id=\"\">If you’re curious about the design of our strategic planning process, contact Chris (chrisashannon@gmail.com).</li></ul><p id=\"\">On July 7th, 2017, an organization was formed in Akron, Ohio to redefine the way we understand money and make people’s lives better in the process. Five years later – and many impactful projects together – we mark this occasion by redirecting ourselves to that vision. I can’t wait to see what we will accomplish together in our passionate desire to make the world a place where all people have the opportunity to live their best financial lives.</p><p id=\"\">Love &amp; fury,</p><p id=\"\">‍</p>", "is_field": true}, {"title": "Introducing Mango X", "date": "Apr 21, 2021", "year": 2021, "location": "Field", "excerpt": "The moonshot factory of FinMangoFinMango is launching a new squad, dedicated to building scalable technology to bring financial independence to teens across the United States and then around the world.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edd7932d7c76b09f4c5_624b30886e0cba870df64341_Untitled%2520design%2520(92).jpeg", "body": "<p id=\"\">The moonshot factory of FinMango</p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1920px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1920px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edd7932d7c76b09f4c5_624b30886e0cba870df64341_Untitled%2520design%2520(92).jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\"><a href=\"https://finmango.org/\" id=\"\">FinMango</a> is launching a new squad, dedicated to building scalable technology to bring financial independence to teens across the United States and then around the world. This elite and high-energy crew has tech and computer science talent at its core and finance people supporting the content.</p><p id=\"\"><a href=\"https://x.finmango.org/\" id=\"\"><strong id=\"\">Mango X</strong></a> isn’t here for incremental impact and linear progress - we’re here to take our biggest moonshots at building the most engaging and effective digital roadmaps to financial independence and then getting it into the lives of millions of people at the ages when they need it most.</p><p id=\"\">Our first project focuses on spreading the <strong id=\"\">FIRE</strong> (Financial Independence, Retire Early) movement to high schoolers. Our aim is twofold: first, make these among the most beneficial lessons of the school year and, second, build the best support structures possible for our community of teachers who are working hard to empower their high schoolers to take control of their lives.</p><p id=\"\">Over the years we have learned a thing or two from bringing financial literacy to tens of thousands of high school students through boots on the ground, and FinMango is never going to stop doing what we love. Now <strong id=\"\">Mango X</strong> will be partnering with some of our rockstar teachers to make big bets for bringing financial education into many more high school classrooms through technology.</p><p id=\"\">For more about us and what we’re up to, visit <a href=\"https://x.finmango.org/\" id=\"\"><strong id=\"\">https://x.finmango.org/</strong></a><strong id=\"\">.</strong></p>", "is_field": true}, {"title": "Introducing the World's Best Roth IRA Calculator", "date": "Apr 28, 2021", "year": 2021, "location": "Field", "excerpt": "io/mango-x-rothira/A project of Mango X.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edd8468247493e02181_624b30feb7be8932b2930583_Untitled%2520design%2520(93).jpeg", "body": "<h2 id=\"\"><a href=\"https://finmango.github.io/mango-x-rothira/\" id=\"\">https://finmango.github.io/mango-x-rothira/</a></h2><p id=\"\">A project of <a href=\"https://x.finmango.org/\" id=\"\">Mango X</a>. Our interactive modules explain foundational investing concepts and show students how to make money work for them. Built on FIRE (Financial Independence, Retire Early) concepts, these modules are a great way to supplement your in-class teachings. Check out more tools at <a href=\"https://ignite.finmango.org/#about\" id=\"\">mango IGNITE</a>.</p><p id=\"\">Email us at hello@finmango.org with feedback/suggestions 😃.</p><p id=\"\">‍</p>", "is_field": true}, {"title": "How 2021 Was Special", "date": "Dec 30, 2021", "year": 2021, "location": "Field", "excerpt": "Since FinMango was founded in 2016, we’ve been chasing one ambitious goal: ending the global financial exclusion crisis.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edc51fc3af5cf1ab26c_623c6284a23baf3cabee4453_Untitled%2520design%2520(13).jpeg", "body": "<p id=\"\">Since FinMango was founded in 2016, we’ve been chasing one ambitious goal: <strong id=\"\">ending the global financial exclusion crisis</strong>. And while the crisis is huge, we’re optimistic. We know how to solve the problem, and we make progress every day thanks to our impressive technical capabilities and a strong network of <strong id=\"\">supporters, teachers, partners, and volunteers</strong>. Currently impacting <strong id=\"\">1,000,000+</strong> lives annually. </p><p id=\"\">‍<br></p><h4 id=\"\"><strong id=\"\">Key recipe that worked in 2021:</strong></h4><ol id=\"\"><li id=\"\">Focus on the people</li><li id=\"\">Build, rebuild, and rebuild again</li><li id=\"\">Keep it simple</li></ol><p id=\"\">‍</p><h4 id=\"\"><strong id=\"\">What we didn’t do:</strong></h4><ol id=\"\"><li id=\"\">Spend a lot of money</li><li id=\"\">Build everything we envisioned</li></ol><p id=\"\">‍</p><h4 id=\"\"><strong id=\"\">A little history, first</strong>…</h4><p id=\"\">The FinMango story began with a 2014 class discussion at Kent State University. The name was inspired by my Financial Management class—nicknamed FinMan—and my favorite fruit—the mango. Originally, I launched FinMango as an energy bar company with a foundation arm focused on financial literacy. The business failed, but the foundation lives on.</p><p id=\"\">‍</p><h4 id=\"\">“FinMan” + “Mango” = FinMango! </h4><h6 id=\"\">You can read the full story <a href=\"https://timeline.finmango.org/\" id=\"\">here</a>.</h6><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:960px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"960px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edc51fc3aa1171ab291_623e05e83f682d0edd09f4de_1a324da0.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">Since a young age, I was always prompted to think about how I could make a positive difference in this world. This curiosity led me to the field of finance where I constantly asked myself questions like: How could we deepen financial literacy / inclusion across the planet, and more than that, how could we actively participate? How do we help people gain more control and understanding of their money? How do we inspire others?</p><p id=\"\">My answer to these questions ended up being <a href=\"https://finmango.org/\" id=\"\"><strong id=\"\">FinMango</strong></a>, a people first organization on a mission to make financial literacy and inclusion universally accessible and useful. Since inception in 2016, we have grown from teaching a unique financial literacy course in the rust belt to impacting 1,000,000+ lives around the world with work featured by Google Health, U.S. News &amp; World Report, Google.org, CNN, The New York Times, NBC, The Daily Beast, and TIME Magazine.</p><h4 id=\"\">Focus on the people</h4><p id=\"\">Building connections that really matter. It’s why we exist, and why we do what we do. Not many organizations have the power to connect people and help them find purpose in this sometimes crazy and complex world. We do. And that’s something we can all be proud of. Our people (aka the mangoes) come from across the world and can speak up to 20+ languages. 2021 consisted of giving back to these incredible people and we’re excited to do an even better job in 2022!</p><h4 id=\"\">Build, rebuild, and rebuild again</h4><p id=\"\">The biggest bet to pay off in 2021 was building Mango X—a group of volunteers who build and launch technologies that aim to improve the lives of millions, even billions, of people.</p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1447px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1447px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edc51fc3aacf21ab294_623e0643ef5bb2629d045a99_Screen%2520Shot%25202022-03-25%2520at%25202.12.47%2520PM.png\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">At mango X, the goal is to take <strong id=\"\">moonshots</strong>: far-out, crazy sounding ideas that could one day make the world a radically better place financially. There’s <strong id=\"\">no step-by-step manual</strong> for what they do, but there are some guidelines that help them improve their odds:</p><ul id=\"\"><li id=\"\">A <strong id=\"\">huge problem</strong> in the world that affects millions or billions of people.</li><li id=\"\">A radical, <strong id=\"\">crazy sounding solution</strong> that may seem impossible today</li><li id=\"\">A <strong id=\"\">technology breakthrough</strong> that gives us a glimmer of hope that the solution could be possible within the next decade.</li></ul><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1528px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1528px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edc51fc3a606d1ab290_623dff86d513e8a413089d2f_image02.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">Mango X has built all the new <a href=\"https://education.finmango.org/\" id=\"\">digital tools</a> and they plan to leverage strategic partnerships in 2022 to amplify their work.</p><p id=\"\">‍</p><h4 id=\"\">Keep it simple</h4><p id=\"\">The world is complex and connected in ways we don’t fully understand. Everything from products to personalities has a brand, a logo, an experience.</p><h5 id=\"\"><strong id=\"\">Most are instantly forgettable.</strong></h5><p id=\"\">They look and feel the same as everything else. They’re built on rational thinking and they follow trends instead of forging them. A great brand is the opposite.</p><p id=\"\">At <a href=\"https://finmango.org/\" id=\"\"><strong id=\"\">FinMango</strong></a>, simple wins in our brand and design philosophy. It is what guides what we do for the people we reach and how we act as an organization. For example, check out <a href=\"https://stories.finmango.org/\" id=\"\">stories.finmango.org</a> or our flagship “<a href=\"https://finvest.finmango.org/\" id=\"\">How To Become a Millionaire</a>” program.</p><p id=\"\">‍</p><h4 id=\"\"><strong id=\"\">Were there no challenges?</strong></h4><p id=\"\">The short answer: too many to list. The long one: entrepreneurship and organization is never easy. <strong id=\"\"><em id=\"\">Failing is never a full-stop. Rather, a semi-colon that motivates you to learn.</em></strong>Everyone faces failure and rejection and FinMango is no exception. A lot of ideas never got built and we also dealt with a lot of logistical problems on projects like the <a href=\"https://health.google.com/covid-19/open-data/\" id=\"\">Google Health Open Data Project</a>.</p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1920px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1920px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edc51fc3a00831ab292_623b37727e18ab0d06869e0e_Copy%2520of%2520World%2527s%2520most%2520comprehensive%2520COVID-19%2520dataset%2520(2020%2520-%25202022)%2520(1).png\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">‍</p><p id=\"\">Below are my takeaways from 2021:</p><ul id=\"\"><li id=\"\">Keep your ego behind</li><li id=\"\">Be humble and always give</li><li id=\"\">Listen carefully to understand vs. listening to respond</li><li id=\"\">The quality of your work = the sum of decision quality (bets) + luck.</li></ul><p id=\"\">Overall, the faster you realize it’s not about you, the better you are positioned to find the lesson in a failure. Once you find that lesson, you’ll see the magic start happening. Trust me, it literally feels like MAGIC and you can quickly iterate.</p><h2 id=\"\"><strong id=\"\">Conclusion</strong></h2><p id=\"\">FinMango is and has always been built by the people, for the people. As a result, we do our best to give back to the people that make us mango and make it a priority to even do more. Our culture has always allowed us to increase our execution and consequently, impact. Seeing mere statistics: that FinMango is just 5 years old, or that we have so many young people actively involved from across the world — you might cultivate the false belief that building something impactful is easy.</p><p id=\"\">Behind the scenes, we have fallen short countless times for countless reasons. But in a way, that’s the beauty of it… Entrepreneurship is the art of making the most out of available and often, limited resources. We have always done that financially and it’s exciting to do the same with passionate people. Initiatives like the <a href=\"https://covid.finmango.org/\" id=\"\">Open Data Project</a>is an excellent testament to our ability to make the most out of what we have.</p><p id=\"\">Oh, finally, as a result of our focus on people, we’re relaunching <a href=\"https://campaign.finmango.org/\" id=\"\"><strong id=\"\">FinMango’s Advocacy / Mentorship program</strong></a> in early 2022! Our community will have more opportunities than ever before to become active and create direct impact.</p><p id=\"\">FinMango has come far — and has a long journey ahead. It is you, our “mango” family, that has empowered us to reach this point. FinMango isn’t only built for you, it’s built by you. Let’s keep building a better financial future together.</p><p id=\"\">Feel free to check out our <a href=\"https://cooperative-ink-2d0.notion.site/c68a41bb2a084abeab2d50bde4674e4d?v=273aa8dbbe4b4065b5983ee688e7eecc\" id=\"\">Product Roadmap</a> and don’t hesitate to send me feedback directly at <a href=\"http://mailto:scott@finmango.org/\" id=\"\"><strong id=\"\">scott@finmango.org</strong></a>. Let’s rock! </p><p id=\"\">‍</p>", "is_field": true}, {"title": "12 Year Old FinLit Guru - Pranav", "date": "Feb 12, 2021", "year": 2021, "location": "Field", "excerpt": "By Erinn HeffesPranav is 12 years of age and lives in Los Gatos, California.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed741aa3521fe028ba6_624b0c6af182dc3c7fb97435_Untitled%2520design%2520(52).jpeg", "body": "<p id=\"\">By <a href=\"https://www.linkedin.com/in/erinn-heffes-88bb8415a/\" id=\"\">Erinn Heffes</a></p><p id=\"\">Pranav is 12 years of age and lives in Los Gatos, California. He is currently in 6th grade and is passionate about Math, English and Science. He believes he grew up extremely driven and focused and wants to get to a high place in life. To Pranav, getting to a high place means “...getting a really good rank in whatever he does.” Whether that be getting his PhD, becoming an astronaut who goes to Mars, or becoming a ‘top’ doctor. Pranav’s goal is to simply be the best and most successful version of himself he can be. When he isn’t doing school work or focused on being a financial wiz, Pranav enjoys reading, drawing comics, crafting and so much more. A few fun facts about Pranav include, his love for learning about how antibiotics work against different viruses and germs etc. and his fascination with moving from one planet to another. Pranav’s mind is always thinking big and focused on the impossible for many, that will one day become possible to him. </p><p id=\"\">Pranav’s interest in financial literacy and investment began when he overheard his parents talking about stocks and investing. He never understood what those words signified and when he realized it had to do with money he wanted to get involved and learn about stocks and investing, to see what he could do with his money. He spoke to his parents about it and ended up taking some financial education classes with another amazing FinMango advocate; Carolyn Cooper.</p><figure id=\"\" class=\"w-richtext-figure-type- w-richtext-align-fullwidth\" style=\"max-width:750px\" data-rt-type=\"\" data-rt-align=\"fullwidth\" data-rt-max-width=\"750px\"><div id=\"\"><img alt=\"IMG_2573.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed741aa354510028ba7_624b0c7bcc8aaaca36020392_IMG_2573.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">Not only did Pranav develop his financial education, but he took it a step further and is currently running his own business; <a href=\"https://bunnysitting101.business.site/\" id=\"\">Bun Bun Bunny Sitting</a>. Pranav has a pet bunny of his own and the thought crossed his mind as to what would be done with his rabbit if he was on a trip. It then escalated into thinking, “What do people in general do with their pets when they need to take a trip or vacation?” This thought snowballed even further and led to Pranav setting up a website using google my business and creating his own business where individuals can request his services, to have their rabbits cared for while they are away. </p><p id=\"\">As Pranav’s business was taking off and he was increasing his financial education with Carolyn’s help, he found about FinMango through her and ended up taking one of Mango Bob’s investment classes. Pranav believes that “Mango Bob’s class was extremely good. He went into detail about everything, he made it easy to understand and you could tell what he was doing from his teaching.” Pranav believes others should take this class (especially the younger generations) because of the impact it can have. Without being educated on these topics, it could harm one’s financial future and younger generations are in a lucky spot and should take advantage of their age and start learning how to prepare themselves for the future.</p><p id=\"\">Asides from being involved in FinMango’s classes, Pranav also had the opportunity to appear on a <a href=\"https://www.ngpf.org/blog/podcasts/ngpf-podcast-carolyn-cooper-and-her-student-pranav-discuss-the-importance-of-financial-education/\" id=\"\">podcast</a> with Tim Ranzetta at Next Gen Personal Finance, which focused on stocks and bonds; what they are and how they work.</p><p id=\"\">Pranav is immensely passionate about financial literacy and when asked what he wishes to see being done differently in schools to address financial literacy, his response was to have more exposure. He believes the biggest issue is that people simply do not know what investing is, how to do it or its importance and that needs to change. People tend to have their money sitting in a bank where no growth is being seen, when they could be investing and growing it.</p><p id=\"\">Three pieces of advice he wants to leave are:</p><ul id=\"\"><li id=\"\">Relating to stocks : Don’t put all your eggs in one basket. Diversification over different stocks is important. </li><li id=\"\">Start investing when you are young, as your money will grow over time. </li><li id=\"\">Don’t end up in debt as this will compound over time. </li></ul><p id=\"\">In the end helping people around the world is what makes Pranav happy. He strives to find ways to give and support others. Whether that be through his bunny sitting business, appearing on podcasts, advocating for development in financial literacy (especially in schools) or becoming a top doctor one day.</p><figure id=\"\" class=\"w-richtext-figure-type- w-richtext-align-fullwidth\" style=\"max-width:2500px\" data-rt-type=\"\" data-rt-align=\"fullwidth\" data-rt-max-width=\"2500px\"><div id=\"\"><img alt=\"IMG_3392.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed741aa354cb3028ba8_624b0c7caa918d0a8223a1fb_IMG_3392.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\"><br></p><p id=\"\">‍</p>", "is_field": true}, {"title": "Some Lessons From Grandma", "date": "Jan 15, 2021", "year": 2021, "location": "India", "excerpt": "By Ahana SamatGrowing up, my weekends and holidays were all spent the same way.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1fcb9dc3a44f8d874_624b0a92c2347b04ecb5015a_Untitled%2520design%2520(51).jpeg", "body": "<p id=\"\">By <a href=\"https://twitter.com/SamatAhana\" id=\"\">Ahana Samat</a></p><p id=\"\">Growing up, my weekends and holidays were all spent the same way. My parents, both of whom worked full time, even on Saturdays, would drop me off in the morning at my grandmother’s apartment and pick me up in the evening. This routine became such a way of life for me, that it continued on unquestioned even as a teenager. </p><p id=\"\">Every morning, I would be greeted the same way. “Hi <em id=\"\">Putta,</em>” she would say, evoking my nickname, her characteristic bindi in the middle of her forehead, and her sari so neatly pinned up, that I often joked that it looked like it had been pleated with a ruler.</p><p id=\"\">In the extensive time I have spent with my grandmother, or <em id=\"\">Bajju</em>, as everyone calls her, my appreciation for her fierce independence has only grown.</p><p id=\"\">In a small town in India in the 1970s, Bajju, a single mother, worked two jobs as a teacher and a tutor, for what must have been 10 hours a day, to single-handedly sustain her family. She independently financially supported my mother through school, university, and graduate school. All this at a time when most women were afforded little autonomy, and those who seized opportunities and broke glass ceilings were discriminated against systematically.</p><p id=\"\">Very little of my general perspective on life has remained untouched by Bajju. Through leading by example, she has taught me some of the most profound lessons in life, the most important of which helps me manage my finances as a college student.</p><p id=\"\">For starters, she showed me the importance of recording everything I spend. And I mean, EVERYTHING. For as long as I can remember, every time we came back from buying groceries, she would immediately write down the amount she spent in a little notebook. At the time, I didn’t think much of it, but as I began living on my own, I emulated that habit. While I use an excel sheet to record all my expenses instead of pen and paper, the importance of organization and discipline in having adequate information to make informed fiscal decisions is not lost on me. Sometimes, I am scared to know how much I spend for fear that I have made bad monetary decisions. However, knowing exactly where my money goes helps me cut down on subscriptions, takeout, or Amazon packages when I need to.</p><p id=\"\">But it’s not just about not wasting money, it’s also about not wasting things. A rule that Bajju enforced- and that I continue to hold onto- was to never waste food. I never throw away the food I cook, I never take more on my plate than I know I can eat, and I always store leftovers in the freezer for subsequent meals. &nbsp;Most of my friends and I often say we would save so much money if we stopped eating out. An<a href=\"https://www.moneyunder30.com/the-true-cost-of-eating-in-restaurants-and-how-to-save\" id=\"\"> article</a> by Money Under 30 on the true cost of eating out quantifies this opinion, - actually fact. So, every time I think of ordering in, I also think about whether there is food in my fridge and if I want to waste it. It sounds silly but it’s saved me so much money!</p><p id=\"\">Why stop at food? Bajju would always recycle glass containers (like those that hold pasta sauce, for example) to hold grains, lentils, or leftovers instead of throwing them away. I recycle all my pasta sauce jars to hold food, stationary, and even act as vases. On a more philosophical level, I have begun to appreciate the variety in utility of every material and how one’s creativity can add to it.</p><p id=\"\">The core of any endeavor, Bajju has taught me, is the drive to learn. Every afternoon when I visited, Bajju and I would sit beside each other: She would be reading (she is never without a book), and &nbsp;I would be working on homework. Whenever she comes across a word she does not know, she immediately consults the dictionary to learn what it means. If she is not satisfied with the explanation, she consults the thesaurus. </p><p id=\"\">I apply her example to personal finance. I choose a topic, research it online, and reference several sources before I am satisfied. Sometimes, it is investopedia; sometimes, it is an eBook from my university library: and sometimes, it is my favorite personal finance Instagram account, but I try to make sure I <em id=\"\">really </em>understand it. The process is never complete - it is comprehensive and exhaustive. But, it is an invaluable lesson in the determination to master a topic and the ambition to succeed.</p><p id=\"\">Admittedly, I may be biased. But, of all the books I have read, podcasts I have listened to, and the research I have done, I have yet to come across a better financial role model than Bajju. An 83 year old woman with a neatly pinned sari who taught me the most valuable lessons I have yet learned in managing my finances <em id=\"\">and </em>conducting my life. </p><p id=\"\"><br></p>", "is_field": true}, {"title": "Call for Volunteers - FinMango SMB Guide Translation Project", "date": "Jul 14, 2021", "year": 2021, "location": "Field", "excerpt": "Hey Mango community!Hope you're all doing well.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed81472383f6590c4ea_624b32f6281537d60dbebb35_6249d5a33460621da4031c03_51064545_1200770356758126_8848772222022582272_o%2520(1).jpeg", "body": "<p id=\"\">Hey Mango community!</p><p id=\"\">Hope you're all doing well.</p><p id=\"\">With the pandemic pushing hundreds of millions of people below the poverty line this year, FinMango has more incentive than ever to help people all around the world get financially literate. </p><p id=\"\">Our newest global initiative is the <a href=\"https://wahltinez.github.io/small-business-guide/\" id=\"\"><strong id=\"\">Small Business Guide</strong></a><strong id=\"\"> - </strong>It is to help small business owners effectively bring their business to the digital era. We have partnered with the <a href=\"https://wahltinez.org/\" id=\"\">Wahltinez Foundation</a> to create a free online resource which can help these business owners navigate the various barriers to setting up and managing their online businesses. </p><p id=\"\">We intend to make this guide globally available in 20 or more different languages and are looking for volunteers to help us. </p><p id=\"\"><strong id=\"\">Volunteer Requirements:</strong></p><p id=\"\">We are looking for volunteers to work with dedicated team members for FinMango in translating our SMB Guide-book. Volunteers need to be:</p><ol id=\"\"><li id=\"\">Fluent in any 1 of the following languages - French, Spanish, Portuguese, Any South Asian Language</li><li id=\"\">Able to perform basic market research wherever needed to contextualize the document for a given geography</li><li id=\"\">A great team player and communicator</li></ol><p id=\"\"><strong id=\"\">Volunteers Responsibilities:</strong></p><ol id=\"\"><li id=\"\">One time volunteering stint of 5-6 hours on translation and research related tasks</li><li id=\"\">Provide share updates with dedicated FinMango team members on your progress</li><li id=\"\">Work well with various team members and adhere to timelines for given goals</li></ol><h2 id=\"\">If you are interested - Sign-up with your details on this <a href=\"https://finmango.typeform.com/to/ZE9w83WS\" id=\"\"><strong id=\"\">FORM</strong></a>. </h2><p id=\"\">A few hours of your efforts could help someone redeem years in their life :)</p><p id=\"\">Best,</p><p id=\"\"><a href=\"https://www.linkedin.com/in/harish-sharma9/\" id=\"\">Harish Sharma</a> &amp; <a href=\"https://www.linkedin.com/in/gauthamkannan95/\" id=\"\">Gautham Kannan</a></p><p id=\"\">‍</p>", "is_field": true}, {"title": "Financial Literacy and Awareness Advances in Ghana", "date": "Jun 14, 2021", "year": 2021, "location": "Field", "excerpt": "Peter is the founder and Executive Director of The Center for Financial Literacy Education – Africa (CFLE Africa); a non-profit in Ghana that is significantly advocating for financial literacy in Africa.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9819da28e4bbf1b86_624b31efb169a957272dd904_Untitled%2520design%2520(96).jpeg", "body": "<p id=\"\">Peter is the founder and Executive Director of The <a href=\"http://www.cfleafrica.org/\" id=\"\">Center for Financial Literacy Education</a> – Africa (CFLE Africa); a non-profit in Ghana that is significantly advocating for financial literacy in Africa. His goal is to help mitigate the financial illiteracy pandemic through partnerships and collaborations with other organizations, educational institutions, municipalities, employers and news media. Recently established campaigns in Ghana include:</p><ul id=\"\"><li id=\"\">Financial Literacy Month in April</li><li id=\"\">Estate &amp; Gift Planning Awareness Month in October</li></ul><p id=\"\">Peter is on a mission to positively impact lives with advocacy and accessibility to useful resources so people can make educated decisions on their financial future.</p><figure id=\"\" class=\"w-richtext-figure-type- w-richtext-align-fullwidth\" style=\"max-width:1000px\" data-rt-type=\"\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1000px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9819da2b648bf1b87_624b3202da4b0deaea48b02b_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252F467fc613-d003-45eb-b9d4-3a1af63f5a9c_1000x666.jpeg\" alt=\"\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">On the 31st of March, The Improving Financial Awareness &amp; Financial Literacy Movement in Ghana was launched at a media press conference held at University of Ghana and hosted by CFLE Africa. The University of Ghana Business School, The FA Association, and The Financial Awareness Foundation (TFAF), and its partners including Axis Pension Trust, PALI Global, Pro Patria Ltd, High School Gh, and others strategic partners and stakeholders including reps from Bank of Ghana, Ministry of Finance, Ghana Association of Bankers, EDC Investments Limited, KPMG Ghana, the 13 Thought Leading News Media Organization, declaring April to be known as Financial Literacy Month in Ghana.</p><p id=\"\">The Month was dedicated for financial awareness and financial literacy activities. The month was celebrated with various virtual seminars, media campaigns and community outreaches. There were social media campaigns such as daily quotes by strategic partners, interviews and speaking engagements to address issues of finances and money management.</p><figure id=\"\" class=\"w-richtext-figure-type- w-richtext-align-fullwidth\" style=\"max-width:1000px\" data-rt-type=\"\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1000px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9819da22ce3bf1b88_624b3202f6d63d5d3c168e5c_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252Ffb1f6034-6437-456c-a873-5ca40fba878e_1000x666.jpeg\" alt=\"\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">On April 30th, Peter collaborated with the National Commission for Civic Education (NCCE - La- Nkwantanang, Madina) to implement a community outreach program at the Madina Market Center. &nbsp;A team of about 40 volunteers engaged over 300 market women and men on financial awareness and financial education to help them get and keep their financial house in order.</p><p id=\"\">Most women in the community shared that they have lost confidence in financial institutions and the banking sector due to the closure of most banks by the government, and this has led to no savings, or if they do, they save in their homes. </p><p id=\"\">The Movement addressed most of their concerns and advised them to keep their financial house in order.</p><p id=\"\">While speaking on a popular television station with Award Winning Journalist Bela Mundi, Bela stated: “most young people think creating wealth happens overnight, that’s not true. There are processes you have to go through. All the wealthy people we see around went through the process. I think we are not telling young people what they need to hear. We have to do something about it and get young people to start thinking.” </p><p id=\"\">Peter concurs with this statement and believes financial literacy is the foundational skill needed to create a brighter future for all—especially the youth.</p><p id=\"\">The first edition of Financial Literacy Month in Ghana has created momentum and Peter is looking forward to pushing the movement even further by continuing his work and by helping to form the first <a href=\"https://x.finmango.org/\" id=\"\">Mango X</a> chapter in Africa.</p><p id=\"\">Peter Kwadwo Asare Nyarko, Executive Director CFLE Africa, </p><p id=\"\">Email: <a href=\"mailto:peternyarko403@gmail.com\" id=\"\">peternyarko403@gmail.com</a></p><p id=\"\">‍</p>", "is_field": true}, {"title": "Advocate Spotlight: Saloni Tandon", "date": "Jun 30, 2021", "year": 2021, "location": "India", "excerpt": "Name: Saloni TandonLocation: IndiaOccupation: Manager at MicroSave Consulting (MSC)What achievement makes you most proud?At MSC, we have been able to ensure that the Government of India and the banking infrastructure work together in an efficient and...", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed88d03791e23900164_624b32509b8bec0cf08ec078_Untitled%2520design%2520(97).jpeg", "body": "<p id=\"\"><strong id=\"\">Name</strong>: Saloni Tandon</p><p id=\"\"><strong id=\"\">Location</strong>: India</p><p id=\"\"><strong id=\"\">Occupation</strong>: Manager at MicroSave Consulting (MSC)</p><h4 id=\"\"><strong id=\"\">What achievement makes you most proud?</strong></h4><p id=\"\">At MSC, we have been able to ensure that the Government of India and the banking infrastructure work together in an efficient and effective manner to rapidly onboard beneficiaries on to the formal financial system and enroll them in affordable social protection schemes. Over the last two years, we have helped establish new protocols, and enhance the efficiency of the existing ones across 27 districts. This has helped ensure that over 20 million new beneficiaries have access to basic bank accounts. Our project has been deemed successful and has allowed the Government of India to expand it across all 112 backward 'aspirational' districts in the form of a dedicated government led mission. This has been a major achievement for us. It allows us to share critical policy level recommendations with the government, with the aim of ensuring that all people in the country have access to basic bank accounts, and social protection.</p><h4 id=\"\"><strong id=\"\">Why do you advocate for financial literacy &amp; inclusion?</strong></h4><p id=\"\">At every stage of life, access to affordable and timely financial resources makes all the difference. For a poor, vulnerable individual, lack of access to affordable financial resources pushes him/her further in the vicious cycle of poverty. The recent COVID crisis has proved the importance of savings, and credit for the ultra poor, and the low and middle income segment. Women across the globe, and more particularly in India, face negative gender norms. The lack of - access to a safe place to save their money or avenues to borrow credit often restricts their empowerment or even worse, traps them in toxic, abusive environments. I hope to be able to bridge these gaps through my work. I believe access to finance, especially to individuals that intent to repay the money, should never be a barrier in their access to a better standard of living, quality education or quality healthcare.</p><h4 id=\"\"><strong id=\"\">What would you say is the best advice for the next generation of youth (inspiring them to become financially literate)?</strong></h4><p id=\"\">Unfortunately, the world runs on money. There will be a time when you'll need money for a loved one, or to fulfill your own ambitions. Every single penny spent unwisely in the past will come to haunt you at that moment. For the sake of you and your family's future, please be wise today. Please take care of your finances today.</p><h4 id=\"\"><strong id=\"\">Favorite (inspirational) quote</strong>:</h4><p id=\"\">It is not the critic who counts; not the man who points out how the strong man stumbles, or where the doer of deeds could have done them better. The credit belongs to the man who is actually in the arena, whose face is marred by dust and sweat and blood; who strives valiantly; who errs, who comes short again and again, because there is no effort without error and shortcoming; but who does actually strive to do the deeds; who knows great enthusiasms, the great devotions; who spends himself in a worthy cause; who at the best knows in the end the triumph of high achievement, and who at the worst, if he fails, at least fails while daring greatly, so that his place shall never be with those cold and timid souls who neither know victory nor defeat. - Theodore Roosevelt (1910)</p><p id=\"\">‍</p>", "is_field": true}, {"title": "Battle of the IRAs Calculator", "date": "May 03, 2021", "year": 2021, "location": "Field", "excerpt": "Let's see how much your savings can grow and which IRA wins in the end!Introducing the “Battle of the IRAs” calculator, a sequel to the world’s BEST Roth IRA calculator we introduced last week.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed75acfc4503863e9b5_624b31834a7725b8af70c899_Untitled%2520design%2520(94).jpeg", "body": "<p id=\"\">Let's see how much your savings can grow and which IRA wins in the end!</p><p id=\"\">Introducing the “Battle of the IRAs” calculator, a sequel to the world’s BEST Roth IRA calculator we introduced last week. Our interactive modules explain foundational investing concepts and show students how to make money work for them. Built on FIRE (Financial Independence, Retire Early) concepts, these modules are a great way to supplement your in-class teachings or learn on your own. Check out more tools at <a href=\"https://ignite.finmango.org/#about\" id=\"\">mango IGNITE</a>.</p><p id=\"\">Drop a comment below or email us at hello@finmango.org with feedback/suggestions 😃.</p><p id=\"\">‍</p>", "is_field": true}, {"title": "Introducing the FIRE Calculator", "date": "May 12, 2021", "year": 2021, "location": "Field", "excerpt": "Introducing the “FIRE” calculator.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eddfcb9dc76cbf8d82d_624b31bf801099356ecc7cd9_Untitled%2520design%2520(95).jpeg", "body": "<p id=\"\">Introducing the “FIRE” calculator. FIRE stands for Financial Independence, Retire Early. It is a movement in the space of personal finance that encourages people to live well within their means, and aggressively save money towards early retirement.</p><p id=\"\">For more tools, visit <a href=\"https://modules.finmango.org/\" id=\"\">Power Modules</a>. Our interactive modules explain foundational investing concepts and show students how to make money work for them. Built on FIRE (Financial Independence, Retire Early) concepts, these modules are a great way to supplement your in-class teachings or learn on your own.</p><p id=\"\">As always, drop a comment below or email us at hello@finmango.org with feedback/suggestions 😃.</p><p id=\"\">‍</p>", "is_field": true}, {"title": "#PaintTheFuture: 0% Interest Micro-Loans for Creative Entrepreneurs in Uganda.", "date": "Nov 05, 2021", "year": 2021, "location": "Uganda", "excerpt": "HEY FINMANGO FAMILY!THIS NEWSLETTER IS TO SHARE WITH YOU ALL ABOUT AN AMAZING NEW PROJECT FINMANGO IS WORKING ON.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edeafdabfa87f7565b4_624b34a5dccb6200a78e612d_Untitled%2520design%2520-%25202022-04-04T141042.967.jpeg", "body": "<p id=\"\">HEY FINMANGO FAMILY!</p><p id=\"\"><strong id=\"\">THIS NEWSLETTER IS TO SHARE WITH YOU ALL ABOUT AN AMAZING NEW PROJECT FINMANGO IS WORKING ON.<br><br>READ ON FOR MORE INFORMATION, TO DONATE OR TO GET INVOLVED!</strong></p><p id=\"\"><strong id=\"\">A CREATIVE REVOLUTION</strong></p><p id=\"\"><strong id=\"\">FinMango has been working alongside communities in Uganda for some time now and is joining forces with Ugandan based organization, Artisan Global, to bring about a creative revolution.</strong></p><p id=\"\"><strong id=\"\">“As a country, we are convinced that the Cultural and Creative Industries are a pillar in the Country’s socio-economic development. The Government of Uganda, therefore, pledges to invest in the Cultural and Creative Industries until their contribution to the National Economy is visible and indisputable.” &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</strong></p><p id=\"\"><strong id=\"\">Source: UNESCO - National Action Plan On Culture And Creative Industries Of Uganda</strong></p><figure id=\"\" class=\"w-richtext-figure-type- \" data-rt-type=\"\" data-rt-align=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfafdabf5d2d7565b5_624b34913eed1ab005eed9cf_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252F1623b883-04cf-424b-84c6-94b3186ac430_600x202.png\" alt=\"\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\"><em id=\"\">Who is Artisan Global?</em></p><p id=\"\">Artisan Global is a 501(c)(3) non-profit that develops sustainable jobs, strategies, and vocational workspaces in Uganda. Accelerating the creative &amp; cultural industries through education, collaboration, and innovation.<br><br>Click the button below to visit their website and learn more about Artisan Global!</p><p id=\"\"><a href=\"https://www.artisanglobal.org/\" id=\"\">Read More</a></p><h1 id=\"\"><em id=\"\">ABOUT THE PROGRAM</em></h1><figure id=\"\" class=\"w-richtext-figure-type- \" data-rt-type=\"\" data-rt-align=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfafdabf84197565b7_624b3492d0c62b85bf7c3755_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252Ffc75494a-3ba5-49a1-b1c0-00f98b186c6e_1880x1576.png\" alt=\"\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h4 id=\"\"><em id=\"\">#PaintTheFuture gives 0% interest micro-loans for creative entrepreneurs in Uganda to increase sustainable income opportunities and provide immediate relief for local businesses severely impacted by the pandemic. These creative entrepreneurs are highly skilled in film/photography, basketry, tailoring/fashion design, jewelry design, visual arts and more. </em></h4><p id=\"\">CLICK BELOW TO READ MORE ON THE PROGRAM AND TO DONATE!</p><p id=\"\"><a href=\"https://paintthefuture.org/\" id=\"\">Read More</a></p><p id=\"\"><a href=\"https://www.every.org/finmango/f/help-fund-artisan-businesses-in-uganda\" id=\"\">Donate Here</a></p><figure id=\"\" class=\"w-richtext-figure-type- \" data-rt-type=\"\" data-rt-align=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfafdabf9fe17565b8_624b3491d181e68ab9256f63_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252F6c8f64bb-22b9-49bd-b047-e2b668033958_1920x1080.png\" alt=\"\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\"><strong id=\"\">By providing these artisans and young entrepreneurs with micro-loans, we will be able to jumpstart their businesses and make sure that the creative industries are prioritized in Northern Uganda during and post-pandemic.</strong></p><h3 id=\"\"><strong id=\"\">Ending Extreme Poverty with Artisans</strong></h3><figure id=\"\" class=\"w-richtext-figure-type- \" data-rt-type=\"\" data-rt-align=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfafdabf7b7f7565b6_624b34910fca2b5f2a6eb7ce_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252F2fd2b5bb-e81f-4453-8a10-00d1b0955746_806x1206.png\" alt=\"\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">The artisan sector has massive potential to contribute to the end of extreme poverty as it is the second-largest employer around the globe in low-income communities after agriculture, worth over $32 billion every year (World Bank). <br><br>We are committed to supporting the beneficiaries of this new program through business management, marketing workshops, financial literacy education, and other entrepreneurial skills training. </p><p id=\"\">Through specialized industry training, we will ensure the micro-loans have the biggest impact possible for these entrepreneurs and their communities. </p><h3 id=\"\"><strong id=\"\">YOUR IMPACT WILL LAST GENERATIONS</strong></h3><figure id=\"\" class=\"w-richtext-figure-type- \" data-rt-type=\"\" data-rt-align=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfafdabf2b9c7565ba_624b34911dcbf287395ce7bc_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252F66d1efc0-cda4-4fe1-83f7-ed7cbcb4eb88_1920x1080.png\" alt=\"\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">By donating towards financial resources for global entrepreneurs, your impact will last for generations to come as we address barriers for small businesses to thrive in economically disadvantaged communities.</p><p id=\"\"><strong id=\"\">HOW TO MAKE A DONATION!</strong></p><p id=\"\">This is an amazing way for you to get involved and grow as part of the FinMango family and help pursue our mission and create some change in the world. Click<a href=\"https://www.every.org/finmango/f/help-fund-artisan-businesses-in-uganda\" id=\"\"> HERE</a> to make a donation and stay tuned for other amazing aspects of this project.<br>(including merchandise and wining personalized art!)</p><h1 id=\"\"><strong id=\"\">GET INVOLVED!</strong></h1><figure id=\"\" class=\"w-richtext-figure-type- \" data-rt-type=\"\" data-rt-align=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfafdabf32ac7565bc_624b3492d81f9b83ff7fb0b5_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252Fec64bf4d-cfc8-4948-a075-cea3bf03d615_2050x1364.png\" alt=\"\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><ul id=\"\"><li id=\"\">Want to get involved with the program and help with planning!?</li><li id=\"\">Have social media / graphic skills?</li><li id=\"\">Email <a href=\"mailto:erinn@finmango.org?subject=Joining%20the%20Uganda%20Microfinance%20Program%20Team%20\" id=\"\">erinn@finmango.org</a> or <a href=\"mailto:karla@finmango.org?subject=Joining%20the%20Uganda%20Microfinance%20Program%20Team%20\" id=\"\">karla@finmango.org</a>.</li></ul><h1 id=\"\"><strong id=\"\">THANK YOU TO EVERYONE WHO HAS DONATED SO FAR!</strong></h1><figure id=\"\" class=\"w-richtext-figure-type- \" data-rt-type=\"\" data-rt-align=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfafdabf1ad97565b9_624b3491e592df6463f8d389_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252F222b5530-fdc1-4f39-bf3f-ff811681eff6_1080x1080.png\" alt=\"\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">WE HAVE RAISED OVER $6,000 IN UNDER 8 HOURS AND WE ARE EXTREMELY GRATEFUL FOR ALL THE SUPPORT. CLICK THE BUTTON BELOW TO DONATE AND HELP US REACH OUR GOAL!</p><p id=\"\">‍</p>", "is_field": true}, {"title": "Peying Attention to Peyton ✈️", "date": "Oct 01, 2021", "year": 2021, "location": "Togo", "excerpt": "Peyton ZachrichSmall Business Digital Guide Spotlight Series.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfab106c847fdb173e_624b34076b21e66cf6e7f69b_Untitled%2520design%2520-%25202022-04-04T140802.878.jpeg", "body": "<h3 id=\"\"><a href=\"https://www.linkedin.com/in/peytonzachrich/\" id=\"\"><strong id=\"\">Peyton Zachrich</strong></a></h3><p id=\"\"><a href=\"http://small%20business%20digital%20guide%20spotlight%20series/\" id=\"\">Small Business Digital Guide</a> Spotlight Series.</p><figure id=\"\" class=\"w-richtext-figure-type- \" data-rt-type=\"\" data-rt-align=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfab106c7c1bdb1742_624b33e46174600bcdeb9f03_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252F27c03e56-a019-49cf-9345-2b706f09c728_3024x3780.jpeg\" alt=\"\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\"><strong id=\"\">Q: Where did you start out in the business world and where are you now?</strong></p><p id=\"\"><strong id=\"\">Peyton</strong>: it depends on what you count as starting out. I’ve been doing entrepreneurial-type things since I was like 4, honestly. My first ever journey into it was when my grandpa gave me some seedcorn. My Dad had a garden at the time so I decided to plant them. For whatever reason, my Dad’s own plants died, so I offered mine to him for a price.</p><p id=\"\">After that, I did tons of different stuff as a kid. I started a pawn shop during recess in 3rd or 4th grade, different little mowing and raking companies when I was growing up, and in college, I started an E-Commerce business with my little brother. It didn’t end up gaining traction, but it actually taught me a lot and helped improve my mental models about how to run a successful business. </p><p id=\"\">In my last semester before graduating with a degree in Finance from Akron, a friend of mine told me about real estate investing. I think about things in terms of numbers, so I never quite understood it but he was the one who showed me how the concept really plays out. Once I understood it, I became extremely interested in it. Right before I graduated, I decided to buy a really distressed real estate company. I was able to turn it around relatively smoothly and then I started my career in the corporate path. The same week, I decided to take on another distressed real estate project. The second one was a much harder turnaround. It was very much an extreme emergency of business, as things go. It took a long time to turn around and was extremely challenging to take on while pursuing a corporate career simultaneously. I couldn’t even tell my coworkers what I had going on outside of work. During lunch, I’d lock myself in this little room eating and making real estate calls. I’d be on call at the gym, in bed, basically at all times. I was sweating for a while. Fortunately, we went from exploding, to eventually stable, and then finally we reached the point where we had this thing where we wanted it. We could finally grow and take on new projects.</p><p id=\"\">That’s pretty much where I’m at with that now. I left my corporate job about 8 months ago to go all-in as an entrepreneur We just bought a second self-storage facility in August and hope to buy another one soon. I really like self-storage. People have a lot of stuff and always will. I’m currently very close to buying another small business here in Cleveland that makes and installs glass-box windows.</p><figure id=\"\" class=\"w-richtext-figure-type- \" data-rt-type=\"\" data-rt-align=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfab106c68fadb1740_624b33e47ce989a7cc2bde07_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252Fc6541c8c-cfe2-4a68-a4f1-7d12467e3026_1240x1612.jpeg\" alt=\"\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h6 id=\"\">Peyton purchasing the glass-box windows business in Cleveland, Ohio.</h6><p id=\"\"><strong id=\"\">Q: What motivated you to become self-sufficient and leave the corporate path you were on?</strong></p><p id=\"\"><strong id=\"\">Peyton</strong>: I think that I had always predetermined that I was going to do it. I have such an extreme personality in the sense of really caring about freedom a lot. Ever since I was young, autonomy has been my highest value. The ability to just be me, be authentic, and live the life that aligns with that and brings the maximum amount of growth to myself.</p><p id=\"\">Originally I had a 10-year plan of working my way up the corporate ladder and then making the jump on my own when I was “ready”. Due to some of the opportunities I got early on, though, the plan definitely got sped up. I was only in corporate for about a year and a half before I made the jump. I remember trying to do both and thinking “man, if only I could just focus on one”. Once I made it through though, I realized that I was so glad that I did both. That foundation really gave me the experience and comfort that I needed to make the jump on my own.</p><figure id=\"\" class=\"w-richtext-figure-type- \" data-rt-type=\"\" data-rt-align=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfab106c36a7db173f_624b33e4d0c62b9ca57c3584_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252F8b6a86db-c689-4c2a-b1db-f94bf19bbd68_1080x1141.jpeg\" alt=\"\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\"><strong id=\"\">Q: Starting a successful small business is no small feat. We’ve all heard the stats: about 20% fail within the first year, yet, this sector of the economy is so integral. If someone who was interested in becoming a small business owner came to you for advice -- or perhaps you got a chance to talk to yourself at the beginning of your journey -- what’s one story or piece of advice that you would give that person?</strong></p><p id=\"\"><strong id=\"\">Peyton</strong>: Before you get into it, you have to know what you’re getting into. You have all the skin in the game. When you have a bad day, you won’t just have an unpleasant couple of hours. You’ll have the full consequences reach you, so things will be more emotional. You no longer have a boss, you no longer have mentors unless you’re specifically seeking them out, so you have to understand that the most important thing to manage is yourself. You have no idea what problem is actually going to sink you vs what problem is actually going to be easy to solve. The mental game-</p><p id=\"\"><strong id=\"\">Q: Kinda like being a golfer or a tennis player, huh?</strong></p><p id=\"\"><strong id=\"\">Peyton</strong>: Exactly. Managing yourself is the most challenging part so you have to go about it the right way for yourself.</p><p id=\"\"><strong id=\"\">Q: If you could put it into just one single quality or word, what does the prospective small business owner need?</strong></p><p id=\"\"><strong id=\"\">Peyton</strong>: Mindfulness. The ability to be self-aware and be able to admit when you get stuff wrong. Be able to bring yourself out of your own neurosis back into the present moment to be able to accomplish what needs to be done.</p><figure id=\"\" class=\"w-richtext-figure-type- \" data-rt-type=\"\" data-rt-align=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfab106c3ea8db1741_624b33e4aaf11ac2fdb7bf59_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252Fbadbb1f5-1e1b-4506-8468-dda95e429f8c_1080x1350.jpeg\" alt=\"\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\"><strong id=\"\">Q: Lastly, at what point during your journey did you find FinMango, and what attracted you to the organization</strong></p><p id=\"\"><strong id=\"\">Peyton</strong>: I believe that it was during the spring of 2018 while I was in college at Akron. Hector, a friend of mine, introduced me to FinMango and encouraged me to join. He introduced me to Scott (Glasgow) and we immediately hit it off and realized that I needed to get involved with this. I’ve always been super interested in financial literacy as a means of taking control over your own life and I thought FinMango was an effective way to do that. The curriculum is effective, the energy is great, and it’s more about getting things done than bureaucracy. In the first project that I worked on, we made French video curriculum for our partnership with the organization in Togo. It’s been an unforgettable experience for me.</p><figure id=\"\" class=\"w-richtext-figure-type-video w-richtext-align-center\" style=\"padding-bottom:33.75%\" data-rt-type=\"video\" data-rt-align=\"center\" data-rt-max-width=\"\" data-rt-max-height=\"33.75%\" data-rt-dimensions=\"0:0\" data-page-url=\"\"><div id=\"\"><iframe src=\"https://www.youtube-nocookie.com/embed/6_LgNpd4LUw?rel=0&autoplay=0&showinfo=0&enablejsapi=0\" frameborder=\"0\" allowfullscreen=\"true\"></iframe></div></figure><p id=\"\">Interested in small business resources? Check out our <a href=\"https://wahltinez.github.io/small-business-guide/\" id=\"\"><strong id=\"\">Small Business Digital Guide</strong></a><strong id=\"\">! - </strong>In partnership with the <a href=\"https://wahltinez.org/\" id=\"\">Wahltinez Foundation</a>, our goal is to help small business owners effectively bring their business to the digital era.</p><p id=\"\">‍</p>", "is_field": true}, {"title": "Introducing the FinMango Product Roadmap 🚀", "date": "Oct 06, 2021", "year": 2021, "location": "Field", "excerpt": "We're always building new avenues for our community that drive us towards achieving our mission of making financial literacy & inclusion universally accessible and useful around the world.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edd4cca9b2e4f19b11c_624b344929144e44e8854bab_Untitled%2520design%2520-%25202022-04-04T140909.953.jpeg", "body": "<p id=\"\">We're always building new avenues for our community that drive us towards achieving our mission of making financial literacy &amp; inclusion universally accessible and useful around the world.</p><h4 id=\"\">Built by the people, for the people.</h4><p id=\"\">As many of you know, we recently doubled down on <a href=\"https://about.finmango.org/\" id=\"\">our mission</a> starting with the launch of <a href=\"https://x.finmango.org/\" id=\"\">Mango X</a> and a suite of new <a href=\"https://products.finmango.org/\" id=\"\">products</a>.</p><p id=\"\">Demand for <a href=\"https://finmango.org/\" id=\"\">FinMango</a> has been high and we’re trying to scale responsibly. So far we have built an incredible community of supporters, teachers, partners, and volunteers from around the world who have enabled us to build our organization.</p><h4 id=\"\">Today, we are super excited to unveil our <a href=\"https://cooperative-ink-2d0.notion.site/c68a41bb2a084abeab2d50bde4674e4d?v=273aa8dbbe4b4065b5983ee688e7eecc\" id=\"\">product roadmap</a> to the public:</h4><figure id=\"\" class=\"w-richtext-figure-type- \" data-rt-type=\"\" data-rt-align=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edd4cca9b576419b121_624b3458b45fb4456845b652_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252F477f6246-6175-4dcd-b6ff-b913a7a034d0_1920x1080.jpeg\" alt=\"\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">FinMango’s <a href=\"https://cooperative-ink-2d0.notion.site/c68a41bb2a084abeab2d50bde4674e4d?v=273aa8dbbe4b4065b5983ee688e7eecc\" id=\"\">product roadmap is a freely accessible board</a> where our community can see what we have released, what we are currently working on, and what is potentially coming next.</p><p id=\"\">More importantly, our community <a href=\"https://finmango.typeform.com/to/XXz0ulmC\" id=\"\">can suggest things they would like us to work on</a>.</p><h2 id=\"\"><strong id=\"\">Why are we publishing the FinMango Product Roadmap to the public? 👀</strong></h2><h4 id=\"\">The mango community comes first!</h4><p id=\"\">For us, building connections that really matter is what we stand for. It’s why we exist, and why we do what we do. <strong id=\"\">Not many non-profits have the power to connect people and help them find meaning and purpose in this sometimes crazy and, complex world. We do</strong>. And that’s something we can all be proud of. Because at FinMango, we have the power to change lives for the better.</p><p id=\"\">Our organization is <strong id=\"\">built by the people, for the people</strong>. We’re inclusive, straight up, insatiably curious, delightfully surprising, and value the power of simplicity.</p><p id=\"\">One of the ways to keep our people, products and partners on the right path to achieve our purpose is to openly share our roadmap publicly.</p><h4 id=\"\"><strong id=\"\">Keeping ourselves accountable and transparent 🔍</strong></h4><p id=\"\">Publishing our roadmap to the public creates an ongoing commitment to solving problems that matter to our community most. It holds us accountable and encourages us to be more focused about what we build, hence building the <a href=\"https://finmango.github.io/mango-x-ira-battle/\" id=\"\">world’s BEST ROTH IRA calculator</a> that our community loves to use.</p><h4 id=\"\"><strong id=\"\">What has been included in the roadmap?</strong></h4><p id=\"\">Not everything is shown on the roadmap. For example, Mango X is semi-secret and we also work on a multitude of smaller items and larger projects (i.e. busy work) behind the scenes.</p><p id=\"\">Some might worry that we’re putting ourselves at a disadvantage for releasing all this information for our competitors to see; however, we don’t see this as a problem. At the end of the day, ideas don’t matter, execution is everything.</p><p id=\"\">The purpose of the roadmap is to be transparent and ensure we’re delivering products people actually <strong id=\"\">WANT</strong>.</p><h2 id=\"\"><strong id=\"\">What’s next? 🚀</strong></h2><p id=\"\">Help us decide by checking out our roadmap and suggesting ideas on this <a href=\"https://finmango.typeform.com/to/XXz0ulmC\" id=\"\">form</a>.</p><p id=\"\">Our mission has and always will be to revolutionize financial literacy by making it universally accessible and useful. We’ve always drawn strength from our diversity, welcomed people from every walk of life to our organization around the world, and strived to build a culture that is inclusive of everyone. It's in our DNA.</p><p id=\"\">You inspire us daily and make our work possible. It’s an honor to hold hands as we create a better, more just world for everyone.</p><p id=\"\">Learn more about <a href=\"https://finmango.org/\" id=\"\">our work and ways to get involved here</a>.</p><p id=\"\">‍</p>", "is_field": true}, {"title": "Carolyn Cooper: from Silicon Valley to the Classroom", "date": "Dec 01, 2020", "year": 2020, "location": "Field", "excerpt": "by Erinn HeffesCarolyn Cooper is a Certified Public Accountant, a Financial Educator and a Coach with professional experience and a passion for creating productive lives that inspire growth and independence in young people.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed8a7f8b7682a10a430_624b08ed3596ceb0b2b961fd_Untitled%2520design%2520(49).jpeg", "body": "<p id=\"\">by <a href=\"https://www.linkedin.com/in/erinn-heffes-88bb8415a/\" id=\"\">Erinn Heffes</a></p><p id=\"\">Carolyn Cooper is a Certified Public Accountant, a Financial Educator and a Coach with professional experience and a passion for creating productive lives that inspire growth and independence in young people.She immigrated to San Jose, California from Kuwait when she was 13 years old. A major reason for this move was to afford her the opportunity of an education because opportunities for women were limited in Kuwait at that time. Despite taking an accounting class in high school and thoroughly enjoying it, she realized that she was not taught personal finance. While attending UC Santa Barbara, Cooper studied Business Economics with an emphasis in Accounting. She took part in a class that introduced a sliver of consumer economics; living on your own, creating a budget, renting an apartment, buying a car etc. Asides from this class, most of Cooper’s finance knowledge was self-taught. She came across a radio station that discussed personal finance and investing and through simply listening to this station while driving back and forth from school, Cooper educated herself on personal finance. Cooper eventually ended up pursuing a career in Public Accounting and as soon as she got her first job, she invested in a 401k plan and opened up her IRA account at the same time.</p><p id=\"\">When her daughters were growing up, she observed that they were not being taught anything on finance and Cooper says she observed that many of the classes she took on personal finance no longer existed. Cooper believed that this was a necessary class her daughters should be taking and a topic they needed to be educated on. Cooper shared an entry with me from 2013 from her journal, while attending a “back to school night” for her daughters where parents were being informed on specific content and aspects. In her journal Cooper wrote about an ‘aha’ moment she had on personal finance and wondered why they were not educating young individuals on personal finance from high school. Cooper, realizing that most of her financial knowledge was self-taught and that not only her daughters but her friends, employees and peers did not have the necessary financial knowledge they actually needed and was available, Cooper realized there was a serious need that had to be fulfilled. &nbsp;Cooper had a successful career in Silicon Valley and was able to save and invest with her husband for years. This allowed her the ability to stop working and rekindle her passion for teaching and educating others, specifically on financial literacy. </p><figure id=\"\" class=\"w-richtext-figure-type- \" data-rt-type=\"\" data-rt-align=\"\"><div id=\"\"><img alt=\"Teaching on Zoom.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed8a7f8b7359110a431_624b08ef2379f3694dbe133f_Teaching%252Bon%252BZoom.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">Throughout her research, Cooper came across <a href=\"https://www.ngpf.org/\" id=\"\">Next Gen Personal Finance</a> and began taking classes with them. She began teaching before the COVID-19 pandemic and like many she did now allow her plan and passion to be derailed and she has continued teaching via Zoom classes. Cooper says that, “It isn’t a job… it’s a dream. THE dream job” If there was one thing that Cooper wishes someone told her when she was younger, it is the importance of honing your soft skills; being more open, volunteering, public speaking and simply putting yourself out there. Cooper incorporates these skills from early in her classes so that students are prepared for when their professional careers develop. Asides from public speaking and networking, Cooper believes that one major skill that is necessary in this area is behavioral finance and practicing living within your means. Cooper says, “It is not just the actual skills of literally here is a spreadsheet and you start filling it out…there is a lot of behavioral finance that goes into it.” There is more to finance than dollars and cents and Cooper wants to help people to understand this. While behavioral finance is a major skill Cooper believes needs to be pushed, she also believes this is the major issue in terms of financial literacy. The notion of not really understanding what it is and not having these foundational skills. </p><p id=\"\">Cooper says that we would never give a 16 year old the keys to a car without the proper driving certifications, so why would we give them the keys to everything as soon as they turn 18, with no training. At the age of 18, one can open a bank account, sign up for credit cards etc. all on their own, yet they frequently lack the education to support these processes properly. She says that COVID has created great awareness and there is now a momentum and everyone simply has to do their share. Cooper is extremely passionate about this issue and providing access to this knowledge to all. As a result, Cooper’s classes are not necessarily non-profit nor are they ‘for business.’ She does charge for some classes, but believes this helps to build accountability and attendance. Cooper does offer some classes for free and waives fees. She really wants to teach and for it to be affordable. She wants everyone to have that access and believes the earlier they have this access the better.</p><p id=\"\">Carolyn is an incredible advocate (<a href=\"https://finmango.org/carolyn-cooper\" id=\"\">Advocate Profile</a>) and all of us at FinMango would like to thank you for what you are doing. Click this link if you want to become a FinMango advocate: <a href=\"https://finmango.org/campaign\" id=\"\">https://finmango.org/campaign</a>.</p><p id=\"\">‍</p>", "is_field": true}, {"title": "\"Teach them how to fish\"​: how will that help their finances?", "date": "Dec 08, 2020", "year": 2020, "location": "Field", "excerpt": "By Michael GilmoreWe all know the oldest cliché in development, aid or whatever subject the speaker wants this to be about: \"give someone a fish, and they'll eat for a day.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1fe7221494fe4cf44_624b098e50a5e4fda5696daf_Untitled%2520design%2520(50).jpeg", "body": "<p id=\"\">By <a href=\"https://www.linkedin.com/in/1michaelgilmore/\" id=\"\">Michael Gilmore</a></p><p id=\"\">We all know the oldest cliché in development, aid or whatever subject the speaker wants this to be about: \"give someone a fish, and they'll eat for a day...\"</p><p id=\"\">I don't need to finish it, do I? You're already saying the second half in your head right now. It's so well known and so powerful, Mad Men-style advertising copywriters would give their Martini-holding right arms to come up with something half that resonant.</p><p id=\"\">And yet. With all that power and fame, where are all the fishing lessons?</p><p id=\"\">If we know that this epithet is true, and has been true ever since Lao Tzu was supposed to have originally said it, shouldn't we by now have learnt that we all need to be taught how to survive for the rest of our lives? Shouldn't we be making sure that every generation is equipped with the skills it will need?</p><p id=\"\">Back in Lao Tzu's day that was probably actually fishing, but today, right now, and probably for most of the last 100 to 200 years, that should have been finance. Not necessarily \"high finance\" or anything complicated, but enough to understand what money really is, and how to make it work for us more than we have to work for it.</p><p id=\"\">Some time back, an idle thought crossed my mind: I wonder if more people teach fishing than financial literacy, and obviously raced to google to check. Almost everywhere I searched, using different terms, different virtual locations and even different engines, the results showed that people actually do offer and search for fishing lessons more than they do financial literacy.</p><p id=\"\">Yes, more of us are either looking for or offering lessons on fishing, a thing that would have been the latest and greatest thing a couple of thousand years ago, than are looking or offering to help learn how to manage the money in our lives. Which would be the greatest if not latest thing today.</p><p id=\"\">The thing that makes us secure. The thing that might stop us dropping into poverty. The thing that might help us have a happy and healthy retirement. The thing that might, actually, help us \"eat forever\".</p><p id=\"\">I re-ran the test this week on google trends, inspired by Stephen Barnham (who I failed to link here - sorry Steve), and the results are roughly the same - this time run on a global database. On the chart at the top of this post, the blue line is fishing lessons, the red one is finance lessons.</p><p id=\"\">Globally, fishing lessons have been twice as popular on average as financial literacy for the last five years. Lessons for the thing that could actually dramatically change our lives have only been more popular than fishing in only a few weeks out of that period. This is insane.</p><p id=\"\">It's not just fishing. Pottery lessons score 10% more than finance on google trends, and knitting, yes knitting, is only 20% less popular in the last five years! Give it a try for yourself if you've got a hobby you would like to compare:<a href=\"https://trends.google.com/trends/explore?date=today%205-y&q=fishing%20lessons%2Cfinance%20lessons\" id=\"\"> https://trends.google.com/trends/explore?date=today%205-y&amp;q=fishing%20lessons,finance%20lessons</a></p><p id=\"\">Despite the fact that money - or particularly the lack of it - can drive the flow of our lives, classes for understanding it are barely as popular as skills that, while charming and potentially distracting, have stopped being a viable source of income and support for most of the world in the last 50 years. And they definitely shouldn't be a source of income for people searching them on google!</p><p id=\"\">If I go back to one of the things I said in my last article (https://www.linkedin.com/pulse/how-financial-literacy-could-matter-than-ever-michael-gilmore), that people don't want to be financially literate, they want to be financially stable, secure or even wealthy, then we can see the evidence for this on google too.</p><p id=\"\">\"Financial security\" as a search term is ten times more popular than fishing lessons and 20x times more popular than finance lessons. The yellow line in the chart below is \"financial security\" added to the one above for fishing and finance.</p><figure id=\"\" class=\"w-richtext-figure-type- w-richtext-align-fullwidth\" style=\"max-width:2232px\" data-rt-type=\"\" data-rt-align=\"fullwidth\" data-rt-max-width=\"2232px\"><div id=\"\"><img alt=\"1606968959144.png\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1fe7221a6dfe4cf45_624b099f3596ce3c1db9678b_1606968959144.png\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">People are desperate to learn how to eat forever, but because our education system doesn't tell them that understanding money is the way to achieve this, they are twice as likely to look for fishing lessons as finance ones! It's a 20-to-1 mismatch in terms of people looking for financial security and looking for financial literacy.</p><p id=\"\">That people are looking for financial security is a worry - but also a relief. It is obviously sad that so many people are concerned about their financial security than so many other subjects, but in some ways it is a positive that they are at least searching for the answer. If we can create and distribute tools, products, books, apps - and maybe even a journal (https://www.linkedin.com/pulse/how-were-trying-use-our-simple-little-journal-solve-two-gilmore) - that address this gap, we can meet this demand head on and help resolve this eminently fixable problem. We can perhaps be 20x more effective if we address the demand for financial security than that for financial literacy.</p><p id=\"\">The <a href=\"https://www.ft.com/content/e25ce66e-b639-408b-b7ef-f524d664a30d?shareType=nongift\" id=\"\">FT's new initiative</a> &nbsp;appears to me to be the most promising I have seen, and I hope to be as involved as I can be. </p><p id=\"\">It could help millions of people. It could make aid programmes more efficient and education systems more relevant. It also doesn't require any great break-throughs, as everything that needs to be taught is already well-known, it just needs re-shaping to fit its audience rather than its teachers.</p><p id=\"\">Let's do this! Let's take this opportunity to teach people how to really fish, how to manage their money so it helps their lives, so they can indeed eat forever.</p><p id=\"\">‍</p>", "is_field": true}, {"title": "Cultivating Potential to Cultivate Potential- How FinMango Changed my View of Finance", "date": "Nov 01, 2020", "year": 2020, "location": "Field", "excerpt": "by Ahana SamatFor a long time, I envisioned the financial services industry as an endless re-run of “The Wolf of Wall Street.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed87d30f925f3375b78_624affb8d6d44eb68d6e4c37_Untitled%2520design%2520(43).jpeg", "body": "<p id=\"\">by <a href=\"https://www.linkedin.com/in/ahanasamat/\" id=\"\">Ahana Samat</a></p><p id=\"\">For a long time, I envisioned the financial services industry as an endless re-run of “The Wolf of Wall Street.” Finance seemed so ruthless, competitive, and masculine. As a woman, I assumed that I could hold a very small place in it. This was despite the fact that I was raised by encouraging parents who owned a small scale business, and family dinners often included asking for my opinion about their work.</p><p id=\"\">Being fairly middle class, finance played a significant role in my life. It became even more important when I looked for scholarships to attend a university in the United States and calculated the expenses of studying abroad. My life revolved around finance yet I claimed I would have nothing to do with it. </p><p id=\"\">In college, I quickly changed my major to Economics. I had no particular rationale for doing this apart from the fact that I enjoyed the subject. But finance was a world apart. So, when I came across the FinMango page on my Instagram, I was surprised. I knew immediately that FinMango was doing important work in promoting personal and economic freedom via financial literacy. They were making people independent and self-sufficient- what could be better? This inspired me when I thought the world of finance had little humanity to offer.</p><p id=\"\">Soon after, I took a leap of faith. I messaged the founder and CEO of FinMango, Scott Glasgow, on Instagram asking if his organization had any volunteer opportunities available for a college student with no experience and an interest, that after months of denial, had revealed itself.</p><p id=\"\">FinMango took me on after we messaged<strong id=\"\">. </strong>After two weeks of being a “Mango”, I was already in charge of conducting a panel at our grand “EXTRAVAGANZA” event, a 24-hour free Zoom call, where people from all walks of life were united in one mission – to promote financial literacy. Specifically, I conducted a panel discussion on the importance of financial literacy for women in the world of business. As I prepared for the panel, I felt a bit like an imposter. I used to view finance as a very male-dominated field, but here I was, talking to women pioneers in venture capital, risk management, and corporate law. My belief that finance was a place that I didn't belong was shattered<strong id=\"\">. </strong>I wasn't disappointed to be wrong.</p><p id=\"\">A topic that came up in the panel was the low number of women represented in the financial services industry and the relative invisibility of those who were. We also talked a lot about confidence. This struck me on a very personal level. Despite successfully navigating a very quantitative- heavy major, I didn’t feel confident in my abilities to handle finance or numbers. In this panel<strong id=\"\">, </strong>as well as conversations I have had with my peers, there is agreement that women are socialized into being nice and modest, often at the expense of their confidence. The lack of this quality can infiltrate our careers and the way we view finance. </p><figure id=\"\" class=\"w-richtext-figure-type- w-richtext-align-fullwidth\" style=\"max-width:1164px\" data-rt-type=\"\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1164px\"><div id=\"\"><img alt=\"unnamed.png\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed87d30f9187c375b7a_624affc330ba02db13f76bc9_unnamed.png\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">Developing this innate confidence also depends on the community one is surrounded by. At FinMango, I have been given opportunities that strengthened my belief in my ability to make a change. One prominent example of this is the Google collaboration, an open source data project designed to collect information about the COVID-19 pandemic. I worked with a team that supported my outlook and encouraged my leadership in a world that often tells women otherwise. Additionally, the internal training opportunities for volunteers have led me to meet some of the most fascinating leaders in fields of marketing and corporate law, who have mentored me and shared their knowledge, skills, and external resources to help me succeed in the business world. To say I am one of the lucky few is an understatement. </p><p id=\"\">Women are underrepresented in the financial services industry, are <a href=\"https://www.annuity.org/financial-literacy/women/#:~:text=Women%20are%20three%20times%20as,lower%20rates%20of%20financial%20literacy.&text=Generally%20speaking%2C%20women%20earn%20less,same%20living%20expenses%20men%20pay\" id=\"\">less likely to be financially literate</a>, yet, according to an article by <a href=\"https://www.economist.com/graphic-detail/2018/03/08/womens-wealth-is-rising\" id=\"\">The Economist</a>, women were expected to control $72 trillion of the world’s wealth by 2020, as estimated in 2015. The number of women represented in the financial services industry is growing, as companies promise equal representation. But it shouldn’t stop there – the goal is to ensure equity through visibility. Women should not just have a seat at the table; their voice and professional opinions should be accorded equal legitimacy as their male peers. Workforces should encourage the confidence of women, rather than subscribing to archaic societal norms of meekness. </p><p id=\"\">The FinMango community, the resources it has provided me with, and my personal experiences convince me that I can help drive change. By building my confidence and providing me with endless opportunities, FinMango has changed the way I view finance, my place in it as a woman, and has shown me what I can do to help those who come after me. It has inspired me to follow my passion of increasing financial literacy among women and making the financial services industry more representative. But equality- true equality- can only exist when it is not limited to pockets and available to a “lucky few” but is an indisputable fact of life for all. I believe that financial literacy can aid in this goal. </p><p id=\"\">‍</p>", "is_field": true}, {"title": "Flight of the Purple Martins: FinMango’s Story", "date": "Nov 05, 2020", "year": 2020, "location": "Field", "excerpt": "As told by Jon LiA summer in Suburban Ohio.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb3857e49936f28d9a_624b00c4cc8aaa43ed0193a1_Untitled%2520design%2520(44).jpeg", "body": "<p id=\"\">As told by <a href=\"https://www.linkedin.com/in/jon-li-52a70bb8/\" id=\"\">Jon Li</a></p><p id=\"\">A summer in Suburban Ohio. What do you think of? If you’re not from these parts, I’m guessing you’re thinking of endless rows of corn basking in steady heat and backyard bonfires fueled by Budlight and Swenson’s. If you are from here… you’re probably thinking that my description is pretty accurate. And while Ohio does in fact offer an abundance of Midwest charm it also marks the beginning of my journey with FinMango. </p><p id=\"\">Looking past the dullness of where I come from, a pristine reservoir called Nimisila teeters on the border of Stark County and Summit County. To me, Nimisila served many purposes throughout the years. In high school, my friends and I would come here and &nbsp;be degenerates. The summer after I graduated, I’d run on the splatter of trails next to Nim to soothe myself and marinate &nbsp;in my thoughts. Then came summer 2016 - my first summer home from college. <a href=\"https://finmango.org/meet-the-founder\" id=\"\">Scott</a> started inviting me to kayak on the reservoir. At that time, I thought nothing more of it, he was a workout friend who I’d played tennis with since high school. &nbsp;</p><p id=\"\">As the summer progressed, our conversations while paddling around on the kayaks kept turning towards this idea he had for a nonprofit called FinMango - a foundation that would &nbsp;address the inequitable access to financial literacy throughout the world. Well, I figured, “Why the hell not?” I quickly jumped aboard this opportunity to give back to the community at large by starting something of my own. On a smaller but just as meaningful scale, &nbsp;I had started a STEAM nonprofit in high school that reached hundreds of students. That experience made the idea of helping thousands, if not hundreds of thousands or even millions of people a lot more fathomable.</p><p id=\"\">This simple burning desire to create and volunteer led to many sunburnt afternoons spent discussing the concept on Nim. Somehow, these kayaks turned out to be the first boardroom, and the beating sun was our Zoom background before Zoom was even mainstream. Early phone calls made by Scott and I often came while we were on the water. Somehow, we’d have to figure out how to make sense of the ideas that floated across the (nonexistent) waves. Like the sky above us during those times, there truly wasn’t a limit.</p><figure id=\"\" class=\"w-richtext-figure-type- w-richtext-align-fullwidth\" style=\"max-width:1000px\" data-rt-type=\"\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1000px\"><div id=\"\"><img alt=\"IMG-5039-Original.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb3857e4eec3f28d9b_624b00d15d2e2fadbc059f53_IMG-5039-Original.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">Fast forward to September, 2020. We’re in the middle of a pandemic and consequently, I had spent my first summer home since the one in &nbsp;2016. Scott and I are again kayaking on Nimisila. As we’re paddling into the middle of the reservoir, we wonder why so many people are in the water and what dozens of spectators had anxiously put up lawn chairs to witness. What Scott and I were about to witness is a perfect, but admittingly cheesy, analogy to where FinMango has progressed since its inception 4 years prior. </p><p id=\"\">The purple martins emerged from the horizon. They came in black streaks all while somehow creating a harmonious cacophony. Seemingly endless waves kept gliding past us in disjointed patterns until they would suddenly create a beautifully symmetric vortex. To us, their flight trajectories seemed to make no sense, until it did. Again and again, the smattering of birds across the sky would collect more of their brethren and then orchestrate symphonic tornados. The finale was the last vortex of birds, perfectly choreographed and synchronized. The great fall migration had begun. </p><p id=\"\">Much like the purple martins, FinMango came from a conglomeration of ideas. Waves of fresh inspiration came from journals, conferences, and long conversations. Thousands of hours of work had been put into a variety of different projects by hundreds of volunteers, forming these successful vortexes that validated the original concept. But, we’re now at an inflection point. I know we’re at the same stage as the last vortex of the purple martins, where everything is now coming together. We always had this grandiose vision, but as an organization, we now understand <em id=\"\">how</em> we’re going to fly onto the big stage and <em id=\"\">what</em> we need to get there. Through calculated miracles, we’ve managed to make sense of the beautiful cacophony (by separating our work into 3 pillars: Data, Tech, and Advocacy), and now we’re ready to migrate. </p><p id=\"\">‍</p>", "is_field": true}, {"title": "First Principles Thinking", "date": "Feb 25, 2022", "year": 2022, "location": "Field", "excerpt": "Aristotle defined a first principle as, “the first basis from which a thing is known.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edbf4dc55adc3997a07_623fc129f4290dbd43c64609_Untitled%2520design%2520(19).jpeg", "body": "<h5 id=\"\">Aristotle defined a first principle as, “the first basis from which a thing is known.”</h5><h3 id=\"\">First, a few definitions.</h3><p id=\"\">A “first principle” is a foundational assumption or proposition — it is foundational in that it cannot be deduced from other assumptions or propositions. Think of a first principle like an element. It cannot be broken down further. It is pure.</p><p id=\"\">“First Principles Thinking” is a problem-solving technique that requires you to break down a complex problem into its most basic, foundational elements.</p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1421px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1421px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edbf4dc558b5b997a08_623fc04b9ab39e54772dcd15_Screen%2520Shot%25202022-03-26%2520at%25209.38.35%2520PM.png\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h4 id=\"\">THE IDEA: To ground yourself in the foundational truths and build from there.</h4><p id=\"\">When we encounter difficult problems, our tendency is to rely on base level assumptions we have been told are true—or that we believe to be true. It’s quick and easy to do so. But it also leads to unimaginative, linear solutions that closely resemble all that has been done previously.</p><p id=\"\">This is called “reasoning by analogy” and this leads to solutions that are like something else. It can be useful heuristic when speed is required and novel solutions are not the goal. However, it falls short when dealing with complex problems in need of imaginative solutions.</p><p id=\"\">Imagine the solution to a problem as a house. The foundation is the assumptions upon which the solution rests. If the foundation is shady, the house will collapse. If the foundation is sturdy, the house will hold up. First principles form a STRONG FOUNDATION for the house.</p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1920px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1920px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edbf4dc55adc3997a07_623fc129f4290dbd43c64609_Untitled%2520design%2520(19).jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h4 id=\"\">Case Study: Elon Musk and his original SpaceX Rocket</h4><p id=\"\">The complex problem? Sending a rocket to Mars. The logical first step: to obtain a rocket.</p><p id=\"\">Musk discovered the cost of buying a rocket was insanely expensive—or can we say otherworldly 😅. Buying a rocket for ~$65 million was not only untenable, it was also grounded in assumptions of how rockets have always been built and what they should cost.</p><p id=\"\">He turned to first principles. He asked and answered basic, foundational questions. What is a rocket made of? Aerospace-grade aluminum alloys, titanium, copper, and carbon fiber.</p><p id=\"\">What is the value of those materials on the open market? Just ~2% of the typical rocket price. So Elon decided to build his own. Rather than accepting the “truths” he had been told about the cost of a rocket, Musk grounded his problem solving in first principles.</p><p id=\"\">Today, SpaceX rockets are safely delivering humans to space and the dreams of a Mars voyage are alive.</p><h3 id=\"\">Conclusion.</h3><p id=\"\">There is no such way to establish first principles. “Socratic questioning” —a technique where you use systematic questioning to drill-down to fundamental truths—is one method. The greatest thinkers and problem solvers agree: when solving a complex problem, think simple and ground yourself in first principles and build your solution up from there. This is what we do at FinMango.</p><p id=\"\">Check out out newest tool, the “<a href=\"http://mngo.org/portfolio\" id=\"\">Build Your Portfolio</a>” Simulator!</p>", "is_field": false}, {"title": "Hello World! Welcoming The New FinMango 🚀", "date": "Jul 22, 2022", "year": 2022, "location": "Field", "excerpt": "It’s time to officially introduce the world to the new FinMango 🥭, which launches today – on National Mango Day! FinMango’s new mission is to solve complex problems that endanger the financial health of young adults in transition.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/6390a83c9311824b82b02fbe_vYIJDv5J.jpeg", "body": "<p id=\"\">It’s time to officially introduce the world to the new FinMango 🥭, which launches today – on <strong id=\"\">National Mango Day! </strong></p><p id=\"\"><br></p><p id=\"\">FinMango’s new mission is to solve complex problems that endanger the financial health of young adults in transition. We believe in a world with financial equity for all and adhere to the following values:</p><p id=\"\"><br></p><p id=\"\">(1) Globally inclusive. We work to inspire coalitions and are, in turn, deeply inspired by those who share our passion. (2) Insatiably curious. We never stop learning. We deploy new knowledge to increase our capacity and to explore what might be possible. (3) Boldly joyful. We pursue a better life for all with boundless passion. (4) Fanatically focused: We choose our work and our partners intentionally based on research, data and capacity with an eye for measurable impact. (5) Honest and transparent: We are humble enough to recognize our own shortcomings, open enough to share our work and brave enough to shine a light on system failures.</p><p id=\"\"><br></p><p id=\"\">The term “<strong id=\"\">financial health</strong>” appeals to us for so many reasons. Learn more about why on our NEW WEBSITE (finmango.org)<strong id=\"\"> 🚀</strong>, which is still in the works but launches today. </p><p id=\"\"><br></p><p id=\"\">Looking back, I am so thankful to <a href=\"https://www.linkedin.com/feed/#\" id=\"\"><strong id=\"\">Chris Shannon</strong></a> for facilitating the strategic planning process and for all the thoughtfully picked mangoes that served on the team – <a href=\"https://www.linkedin.com/feed/#\" id=\"\"><strong id=\"\">Katherine</strong></a>, <a href=\"https://www.linkedin.com/feed/#\" id=\"\"><strong id=\"\">Tobias</strong></a>, <a href=\"https://www.linkedin.com/feed/#\" id=\"\"><strong id=\"\">Dominic</strong></a>, <a href=\"https://www.linkedin.com/feed/#\" id=\"\"><strong id=\"\">Ojasvinee</strong></a>, <a href=\"https://www.linkedin.com/feed/#\" id=\"\"><strong id=\"\">Bruna</strong></a>, <a href=\"https://www.linkedin.com/feed/#\" id=\"\"><strong id=\"\">Avneesh</strong></a> and <a href=\"https://www.linkedin.com/feed/#\" id=\"\"><strong id=\"\">Gautham</strong></a>! In just 15 weeks, they have drastically altered the direction of FinMango for the better and I am deeply grateful for their contribution. Please reach out to any of these members if you have questions.</p><p id=\"\"><br></p><p id=\"\">Looking ahead, it's now time to execute. In short, our master plan is:</p><p id=\"\"><br></p><p id=\"\">(1) Evolve into a learning organization. We’ll constantly create, acquire, and transfer knowledge to the public and be able to quickly adapt our behavior to reflect new insights.<br></p><p id=\"\">(2) Develop into a leading data aggregation organization. Financial health is a young area of study, and many important questions need to be investigated.<br></p><p id=\"\">(3) Leverage strategic partnerships to maximize the impact of our work.<br></p><p id=\"\">(4) Probe AI and tech innovations to improve the financial health of young adults globally. With AI and technology, we have more tools to explore and address hard, unanswered questions with the help of data.</p><p id=\"\"><br></p><p id=\"\">*NOTE: FinMango is no longer a player in the crowded financial education world.</p><p id=\"\"><br></p><p id=\"\">I’m so excited for the future of FinMango and can’t wait to support young adults during life transitions and financial shocks. FinMango has come far — and has a long journey ahead. It is you, our Mango Family, that empowered us to reach this point. FinMango isn’t only built for you, it’s built by you. </p><p id=\"\"><br></p><p id=\"\">Check out our new website and stay tuned for updates on how to support our work and get involved. </p><p id=\"\">‍</p>", "is_field": false}, {"title": "It's almost time to relaunch", "date": "Jun 28, 2022", "year": 2022, "location": "Field", "excerpt": "‍I am excited to share that FinMango is embarking on a new journey, with a new focus on something more.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/6390a7ef99e2d1bbe3d03a61_26mag-Migratiion-Images-12-superJumbo.jpg", "body": "<p id=\"\">‍</p><p id=\"\">I am excited to share that FinMango is embarking on a new journey, with a new focus on something more. Something bigger. </p><p id=\"\"><strong id=\"\">FinMango is on a mission to solve complex problems that endanger the financial health of young adults in transition. We believe in financial equity for all.</strong></p><p id=\"\">As an organization, <strong id=\"\">we will no longer be a player in the crowded financial education world</strong>. Instead, our work will focus on the complex context of young adults globally and their financial health. More specifically, it will target the stability of young adults during times of life transitions and financial shock.</p><h3 id=\"\">Why financial health?</h3><p id=\"\">Too many people struggle to manage their daily financial lives–especially young adults. Interestingly, this struggle does not just apply to low-income households or certain geographic areas. In fact, according to <a href=\"https://www.cnbc.com/2022/01/19/56percent-of-americans-cant-cover-a-1000-emergency-expense-with-savings.html\" id=\"\">CNBC</a>, 56% of Americans can’t cover a $1,000 emergency expense with savings.</p><p id=\"\">Good financial health can change everything. But what is financial health? “<strong id=\"\">Financial health or wellbeing is the extent to which a person or family can smoothly manage their current financial obligations and have confidence in their financial future</strong>. The elements that shape a person’s financial health include: </p><ul id=\"\"><li id=\"\"><strong id=\"\">Day to day</strong>: Smooth short-term finances to meet financial obligations and consumption needs.</li><li id=\"\"><strong id=\"\">Resilience</strong>: Capacity to absorb financial shocks.</li><li id=\"\"><strong id=\"\">Goals</strong>: On track to reach future goals. </li><li id=\"\"><strong id=\"\">Confidence</strong>: Feeling secure and in control of finances.” (<a href=\"https://www.unsgsa.org/sites/default/files/resources-files/2021-09/UNSGSA%20Financial-health-introduction-for-policymakers.pdf\" id=\"\">UNSGSA</a>)</li></ul><p id=\"\">We’re just at the beginning of this journey and we can’t wait to share our plans to achieve our new mission and vision. If you're like me, you are even more eager to get involved. Here's how:</p><ul id=\"\"><li id=\"\">For questions about the strategic planning process itself–what we have done, what we have learned and where we are heading, reach out to Katherine (katherine@finmango.org).</li><li id=\"\">If you’re as excited as we are about FinMango’s future and want to help once we roll out our strategic plan, let Bruna (bruna@finmango.org), Kaylei (kaylei@finmango.org) or any of us know.</li><li id=\"\">If you’re curious about the design and strategic theory behind our planning process, contact Chris (chrisashannon@gmail.com).</li></ul><p id=\"\">I’m so excited for the future of FinMango and can’t wait to support young adults during life transitions and financial shocks. </p><p id=\"\">Stay tuned for more news about our new launch date: July 22nd – National Mango Day. </p><p id=\"\">References: </p><p id=\"\"><a href=\"https://www.cnbc.com/2022/01/19/56percent-of-americans-cant-cover-a-1000-emergency-expense-with-savings.html\" id=\"\">https://www.cnbc.com/2022/01/19/56percent-of-americans-cant-cover-a-1000-emergency-expense-with-savings.html</a></p><p id=\"\"><a href=\"https://www.unsgsa.org/sites/default/files/resources-files/2021-09/UNSGSA%20Financial-health-introduction-for-policymakers.pdf\" id=\"\">https://www.unsgsa.org/sites/default/files/resources-files/2021-09/UNSGSA%20Financial-health-introduction-for-policymakers.pdf</a></p>", "is_field": false}, {"title": "Beta Launch: Snap-Style Lessons", "date": "Aug 18, 2021", "year": 2021, "location": "Field", "excerpt": "Beta Launch Alert 🚨‼️ We’re excited to softly launch Mango Stories: bite-sized lessons that look and feel like Instagram stories.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed8789b5e989e653c5e_624b3368b663cae9d77f1c11_Untitled%2520design%2520(99).jpeg", "body": "<p id=\"\">Beta Launch Alert 🚨‼️ We’re excited to softly launch <a href=\"https://stories.finmango.org/\" id=\"\">Mango Stories</a>: bite-sized lessons that look and feel like Instagram stories. Mango stories are a product of <a href=\"https://x.finmango.org/\" id=\"\">Mango X</a> and we would love to get your feedback before we fully release the product to the public. 🚀</p><p id=\"\">Check it out at <a href=\"https://stories.finmango.org/\" id=\"\">stories.finmango.org</a> and don’t hesitate to reach out with feedback via email (<a href=\"mailto:hello@finmango.org\" id=\"\">hello@finmango.org</a>), <a href=\"https://www.instagram.com/finmango/\" id=\"\">DM</a>, or in the comments section below. A few beta testers will receive a FinMango hoodie 🤗</p><p id=\"\"><a href=\"javascript:void(0)\" id=\"\">6</a><a href=\"https://blogs.finmango.org/p/beta-launch-mango-stories/comments\" id=\"\">Comment</a><a href=\"javascript:void(0)\" id=\"\">Share</a></p><p id=\"\">‍</p>", "is_field": false}, {"title": "FinMango Awarded $50,000 Grant from Google Health to Continue Collaboration on the COVID-19 Open Data Project.", "date": "Sep 09, 2021", "year": 2021, "location": "Field", "excerpt": "FinMango, a data-driven non-profit that promotes financial literacy, education, and advocacy around the world, has been awarded a $50,000 grant from Google Health to continue collaboration on Google’s COVID-19 Open Data Project.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9340daf261bd53fc5_624b33a96174609405eb99ec_Untitled%2520design%2520(100).jpeg", "body": "<p id=\"\"><a href=\"https://finmango.org/\" id=\"\">FinMango</a>, a data-driven non-profit that promotes financial literacy, education, and advocacy around the world, has been awarded a $50,000 grant from <a href=\"https://health.google/\" id=\"\">Google Health</a> to continue collaboration on Google’s <a href=\"https://github.com/GoogleCloudPlatform/covid-19-open-data\" id=\"\">COVID-19 Open Data Project</a>. </p><p id=\"\">The COVID-19 Open Data Project is the world's most comprehensive COVID-19 dataset; we track sub-national cases and vaccine deployment data for 20,000+ distinct locations in over 190 countries. Our data has influenced vaccine research, government public policy decisions, and travel safety measures, amongst other things. Additionally, our data has been used by numerous international organizations, including The <strong id=\"\">WHO (Covax)</strong>, <strong id=\"\">The World Bank</strong>, <strong id=\"\">IMF</strong>, <strong id=\"\">Harvard University Research</strong>, <strong id=\"\">USAID</strong>, and <strong id=\"\">Verily</strong>, to name a few.</p><p id=\"\">Since the inception of the project, the goals of the collaboration have remained the same:</p><ol id=\"\"><li id=\"\">Help decision-makers understand the unique impact of COVID-19 on different communities,</li><li id=\"\">Provide timely, transparent, and unbiased data about the pandemic, and</li><li id=\"\">Establish partnerships with data providers and users to collect facts and extract insights.</li></ol><p id=\"\">Over the years, we have learned a thing or two about uniting people from different communities, backgrounds, and countries to make a positive impact on the world together. FinMango will use this grant to thank our volunteers, who have dedicated countless hours from their personal lives, education, and careers, to plug the data gap and attempt to create information symmetry between organizations during this devastating pandemic. </p><p id=\"\">For more about the project and what we’re up to, visit <a href=\"http://covid.finmango.org/\" id=\"\">covid.finmango.org</a>.</p><p id=\"\">Current contributors [with length of time on the project] include: Pam Hoalt, PhD [14 months], James Glasgow PhD [14 months], James Glasgow Pharm.D. [14 months], Rebeca Lozano [14 months], Kishan Patel [14 months], Uday Patel [14 months], Enrico Buoro [14 months], Scott Glasgow [14 months], Ojasvinee Singh [12 months], Kevin D'Souza [12 months], Martin Noguera [12 months], and Nathan Immel [1 month].</p><p id=\"\">‍</p>", "is_field": false}, {"title": "How the Pandemic Inspires Me to Build Resilience Around the World", "date": "Oct 22, 2020", "year": 2020, "location": "Field", "excerpt": "By Scott Glasgow There’s something that happens when adversity strikes that changes the way you look at life.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edcfcb9dc8030f8d7d6_624afd39f821604e36836351_Untitled%2520design%2520(40).jpeg", "body": "<p id=\"\">By <a href=\"https://www.linkedin.com/in/sglasgow/\" target=\"_blank\" id=\"\">Scott Glasgow</a> </p><p id=\"\">There’s something that happens when adversity strikes that changes the way you look at life. This year, I was lucky enough to overcome that adversity with resilience—the ability to absorb, adapt, and transform. </p><p id=\"\">It’s crazy to think about how different things were just a few months ago. I was working 80+ hours a week, jumping on flights to speak around the world, and not understanding the concept of work-life balance. FinMango had little focus and I was struggling to keep it all together. </p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1361px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1361px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edcfcb9dcb7f3f8d7d7_624afd6ef2caaa72b0cefab0_IMG-7423.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">But today, I got to look back on a year of wins, losses and learning and take comfort in the fact that we didn’t ever run out of money, and we did manage to mostly keep it all together. And thanks to a few lucky breaks—like smashing a world record, launching a collaboration with Google, and gaining national media coverage—we’re now focused and jumping into an incredible future.</p><p id=\"\">With the year quickly coming to a close, I’m motivated to work harder than ever to solve the financial exclusion problem. FinMango can now be defined by three words: <a href=\"https://finmango.org/data\" id=\"\">Data</a>, <a href=\"https://finmango.org/tech\" id=\"\">Tech</a>, and <a href=\"https://finmango.org/campaign\" id=\"\">Advocacy</a>. You can read more about the pivot <a href=\"https://finmango.org/blogs/2020/10/14/master-plan-part-deux\" id=\"\">here</a>.</p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1500px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1500px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edcfcb9dc36aef8d7d9_624afd8dc31d277ecc92cedc_IMG_0396.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">While I’m grateful for how radically different my life has changed during the pandemic compared to the average person, recognizing this is a reminder of how important it is to use the privilege and opportunities we are given to help those around us.</p><p id=\"\">At FinMango, all we do is give. We give people the opportunity to influence the world, to work on projects that save lives, and be a part of something bigger. Much bigger. </p><p id=\"\">And in our lives, we’re only given so many opportunities to do things like that ... most never even get the chance.</p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:2048px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"2048px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edcfcb9dc3c62f8d7d8_624afda4773b0d3f02396133_IMG-3264.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">Overall, this year has taught me so much about resilience. All of the failures, successes, hopes, dreams, and disappointments that I have experienced have turned into important life lessons. I’ve learned about the importance of giving and of radical generosity. I’ve learned about integrity, respect, and kindness. I’ve tried to be generous with my time and I’ve tried to be of service to others. And as I look forward to the next few years, I can only hope that all these lessons I’ve learned can be used to help spur the potential of tens of millions more people around the world.</p><p id=\"\">We have a lot of work ahead and we need to raise a lot of money to make it happen, but I feel grateful for 2020. I’ve been given the opportunity of a lifetime and I’m running with it. I might be wrong, but I think the FinMango story has just begun… Let’s jump on the train! </p><p id=\"\">Stay tuned and learn how to support our work at <a href=\"https://finmango.org/\" id=\"\">finmango.org</a>.</p>", "is_field": false}, {"title": "COVID-19 Policy Brief", "date": "Oct 29, 2020", "year": 2020, "location": "Field", "excerpt": "By OJ SINGHDuring the COVID-19 pandemic, the Effective Reproduction Number – Re – has been the go-to metric for most government agencies and public health officials.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed8fcb9dc8895f8d73b_624aff56b54beb46eedbeca7_Untitled%2520design%2520(42).jpeg", "body": "<p id=\"\">By <a href=\"https://www.linkedin.com/in/ojasvinee-singh/\" id=\"\"><strong id=\"\">OJ SINGH</strong></a></p><p id=\"\">During the COVID-19 pandemic, the <a href=\"https://www.groundup.org.za/article/covid-19-making-sense-of-r/\" id=\"\">Effective Reproduction Number</a> – <em id=\"\">Re</em> – has been the go-to metric for most government agencies and public health officials.</p><p id=\"\"><em id=\"\">Re</em> is a metric used to gauge the <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7121794/\" id=\"\">transmissibility of a disease</a>; by calculating <em id=\"\">Re, </em>governments can implement various intervention strategies, applying them at the degree required, to mitigate the spread of that disease.</p><p id=\"\"><em id=\"\">Re</em> is determined by <a href=\"https://www.groundup.org.za/article/covid-19-making-sense-of-r/\" id=\"\">three factors</a>: how infectious the infected person is, how many susceptible people the average infector meets in a day, and how many days the infector remains infectious. </p><p id=\"\">The incubation period for the virus is between <a href=\"https://www.news-medical.net/health/Coronavirus-Incubation-Period.aspx\" id=\"\">5-6 days</a>, however, the recommended range is <a href=\"https://www.news-medical.net/health/Coronavirus-Incubation-Period.aspx\" id=\"\">1-14 days</a>; this is why many protocols require quarantining for 14 days after coming in contact with an infected person. The average infection period for COVID-19 is <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7147278/\" id=\"\">12 days</a>, often starting a few days after symptoms appear.</p><p id=\"\">So, what <em id=\"\">Re</em> should policymakers aim for in order to effectively manage the pandemic? </p><p id=\"\">When <em id=\"\">Re</em> is greater than 1, that means that each infected person infects more than one other person; the virus <a href=\"https://www.cebm.net/covid-19/exponential-growth-what-it-is-why-it-matters-and-how-to-spot-it/\" id=\"\">grows exponentially</a>, and <a href=\"https://www.groundup.org.za/article/covid-19-making-sense-of-r/\" id=\"\"><em id=\"\">Re</em> increases</a>. When <em id=\"\">Re</em> is less than 1, that means that not every infected person infects someone else. </p><p id=\"\">The <a href=\"https://hughmurrell.github.io/CoVmodel/Rt.pdf\" id=\"\">goal is to keep <em id=\"\">Re</em> below 1</a> – this doesn’t signal a rapid decline in new cases, it signals that with a constant <em id=\"\">Re</em> below 1, the number of cases per day will slowly decline to 0 over a period of time, as fewer and fewer people are infected. </p><p id=\"\">As mitigation strategies are implemented and uplifted, and individuals interact within unprecedented environments, <em id=\"\">Re</em> is constantly changing. Government agencies and public health officials should use their area’s <em id=\"\">Re</em> to create plans appropriate for their specific circumstances and objectives. </p><p id=\"\">Hugh Murrell and Daniel Murrell, two researchers from South Africa, relied on FinMango’s South Africa COVID-19 data to create a <a href=\"https://hughmurrell.github.io/CoVmodel/Rt.pdf\" id=\"\">simple algorithm to calculate <em id=\"\">Re</em></a>, so those without in-depth statistical knowledge can understand data and trends in layman’s terms. They uploaded their technique on GitHub, so that anyone can personalize models and tweak parameters for their specific circumstances. To conduct the industrial-scale algorithms at a fast pace, the researchers switched from using the University of Pretoria’s data to using FinMango’s data, as FinMango was accurately publishing granular data in a timely fashion from previously unreported districts. </p><p id=\"\">Using this <em id=\"\">Re</em> model, policymakers should implement lockdowns, face covering policies, social distancing regulations, curfews, contact tracing, widespread testing, and whatever else is necessary to contain COVID-19. </p><p id=\"\">Some governments, like those of <a href=\"https://ourworldindata.org/covid-exemplar-vietnam\" id=\"\">Vietnam</a> and <a href=\"https://www.nejm.org/doi/full/10.1056/NEJMc2025203\" id=\"\">New Zealand</a>, will choose to go into full lockdown and shut down all non-essential activity, conduct extensive contact tracing and widespread testing, and implement travel restrictions to contain the virus and keep it contained.</p><p id=\"\">Other governments, like those of <a href=\"https://www.bbc.com/news/world-europe-51892477\" id=\"\">France</a> and <a href=\"https://www.bbc.com/news/world-europe-51892477\" id=\"\">Spain</a>, will initially shut down to flatten the curve, and then <a href=\"https://in.reuters.com/article/us-health-coronavirus-spain/spain-hopes-to-keep-french-border-open-as-regions-tighten-health-measures-idUSKCN24N0S1\" id=\"\">open back up</a>, after assembling what they believe is necessary medical infrastructure and testing protocols. Recently, both Spain and France have gone back into lockdown. Spain imposed a <a href=\"https://www.bbc.com/news/world-europe-54682222\" id=\"\">national curfew</a> to combat its second wave of the virus three days ago. <a href=\"https://www.bbc.com/news/world-europe-54716993\" id=\"\">France</a> declared a second national lockdown, as cases soared, this morning. </p><p id=\"\">Whatever policymakers do, ethically, their goal must be to save as many lives as possible.</p><p id=\"\">‍</p>", "is_field": false}, {"title": "FinMango Supporters Meet in Cleveland", "date": "Apr 18, 2018", "year": 2018, "location": "Field", "excerpt": "FinMango supporters, volunteers, and board members gathered to discuss the future of FinMango.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda581fcebc4d5e8923_624b2ee829144e0d79852649_Untitled%2520design%2520(90).jpeg", "body": "<p id=\"\">FinMango supporters, volunteers, and board members gathered to discuss the future of FinMango.&nbsp;</p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:960px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"960px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda581fce1ea55e8925_624b2e4d9b8bec5b058e9999_29694759_974582789376885_8710401242171686110_n.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure>", "is_field": false}, {"title": "Mango Scott Spoke at the Paul & Carol David YMCA!", "date": "Feb 07, 2018", "year": 2018, "location": "Field", "excerpt": "Executive Mango told the story of FinMango at the Paul & Carol David YMCA.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edffe72212503e4cf32_624b2939923403e960f09c82_Untitled%2520design%2520(81).jpeg", "body": "<p id=\"\"><br></p><p id=\"\">Executive Mango told the story of FinMango at the Paul &amp; Carol David YMCA. Check out the full story:&nbsp;<a href=\"https://www.facebook.com/davidymcajackson/posts/10156168601044394\" target=\"_blank\" id=\"\">https://www.facebook.com/davidymcajackson/posts/10156168601044394</a></p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1500px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1500px\"><div id=\"\"><img alt=\"IMG_4687.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edffe7221374ee4cf3f_624b2950b7be89226a92b2df_IMG_4687.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1000px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1000px\"><div id=\"\"><img alt=\"IMG_4688.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edffe7221de19e4cf3d_624b294fd181e679f4250af2_IMG_4688.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1500px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1500px\"><div id=\"\"><img alt=\"IMG_4689.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edffe7221afafe4cf3e_624b2959da4b0d516b4864b2_IMG_4689.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1500px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1500px\"><div id=\"\"><img alt=\"IMG_4690.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edffe722136e6e4cf3b_624b2959f6d63d2a85162f25_IMG_4690.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1500px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1500px\"><div id=\"\"><img alt=\"IMG_4691.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edffe7221de0de4cf3c_624b295946e08c7ae8db7832_IMG_4691.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">‍</p><p id=\"\">‍</p>", "is_field": false}, {"title": "Mango Bob wins \"MAN OF THE YEAR\" by JOG!", "date": "Feb 09, 2018", "year": 2018, "location": "Field", "excerpt": "Congratulations on leading the way, Mango Bob (Robert Gillingham II).", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edd5df015e33c2a7fe1_624b29c1543c2831222c46c9_Untitled%2520design%2520(82).jpeg", "body": "<p id=\"\">Congratulations on leading the way, Mango Bob (<a href=\"https://www.facebook.com/robert.i.gillingham?fref=mentions\" id=\"\">Robert Gillingham II</a>). The “MAN OF THE YEAR” award winner by <a href=\"https://www.facebook.com/JobsforOhiosGraduates/?fref=mentions\" id=\"\">Jobs for Ohio's Graduates</a>.</p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:750px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"750px\"><div id=\"\"><img alt=\"IMG_6100.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edd5df01509192a7fe2_624b29c454ce0f8043f70dda_IMG_6100.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:750px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"750px\"><div id=\"\"><img alt=\"IMG_4769.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edd5df015a9d02a7fe3_624b29c4de14f9b6580cedad_IMG_4769.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:750px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"750px\"><div id=\"\"><img alt=\"IMG_3596.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edd5df015ff402a7fe4_624b29c4d81f9be8ba7f5799_IMG_3596.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:750px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"750px\"><div id=\"\"><img alt=\"IMG_5774.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edd5df01507332a7fe5_624b29c46231cd5c7b330592_IMG_5774.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">‍</p>", "is_field": false}, {"title": "Mango Brandyn Published a Book!", "date": "Feb 17, 2018", "year": 2018, "location": "Field", "excerpt": "Congratulations on the publication of your book Mango Brandyn! Order “Early Money: A Guide to Financial Independence For College Students” today on Amazon!https://www.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edd7465c83078ee0aa9_624b2a2a55e07d7e8b4e23e4_Untitled%2520design%2520(83).jpeg", "body": "<p id=\"\">Congratulations on the publication of your book Mango <a href=\"https://www.facebook.com/brandyn.neal?fref=mentions\" id=\"\">Brandyn</a>! Order “Early Money: A Guide to Financial Independence For College Students” today on Amazon!</p><p id=\"\"><a target=\"_blank\" href=\"https://www.amazon.com/dp/1979421838/ref=cm_sw_r_sms_c_api_MuNHAbK8FBNES\" id=\"\">https://www.amazon.com/dp/1979421838/ref=cm_sw_r_sms_c_api_MuNHAbK8FBNES</a></p><p id=\"\"><a href=\"https://images.squarespace-cdn.com/content/v1/56be4e4c356fb031229edcbb/1518905438079-OPVUJ5REZ2ARS9F94IPT/27867115_950985735069924_8575719352917600626_n.jpg\" id=\"\"><br></a></p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:500px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"500px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ede7465c8036eee0aae_624b2a23689b8904e2903026_27867115_950985735069924_8575719352917600626_n.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure>", "is_field": false}, {"title": "FinMango + Google!", "date": "Jan 05, 2018", "year": 2018, "location": "Field", "excerpt": "THANK YOU Oscar and Emilie from Google for the time and effort you took to share your thoughts and experiences with the AWESOME students at the Saint Ambrose Catholic School.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c35396e7f294166_624b281212788727a5c5e7cc_Untitled%2520design%2520(78).jpeg", "body": "<p id=\"\">THANK YOU Oscar and Emilie from <a href=\"https://www.facebook.com/Google/?fref=mentions\" id=\"\">Google</a> for the time and effort you took to share your thoughts and experiences with the AWESOME students at the <a href=\"https://www.facebook.com/SaintAmbroseSchoolBrunswick/?fref=mentions\" id=\"\">Saint Ambrose Catholic School</a>. You truly made a positive difference in the lives of young Mangos!</p><p id=\"\">‍</p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:960px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"960px\"><div id=\"\"><img alt=\"26231086_928313494003815_2893474025414205825_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c353946bf294168_624b27ea50add83855f83abd_26231086_928313494003815_2893474025414205825_n.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:960px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"960px\"><div id=\"\"><img alt=\"26219364_928313954003769_5554825783031955193_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c3539b1ed294167_624b27ea4a7725495f706ff1_26219364_928313954003769_5554825783031955193_n.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1460px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1460px\"><div id=\"\"><img alt=\"26232870_928314174003747_613642773526069803_o.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c35397aae29416b_624b27eadccb6259178e0df7_26232870_928314174003747_613642773526069803_o.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:960px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"960px\"><div id=\"\"><img alt=\"26230043_928314230670408_142755776441099661_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c3539fa7b294169_624b27eaba341f0be63408e1_26230043_928314230670408_142755776441099661_n.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:960px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"960px\"><div id=\"\"><img alt=\"26231481_928313674003797_1847422457922424787_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c353904b329416a_624b27eadf247152080da586_26231481_928313674003797_1847422457922424787_n.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\"><br></p>", "is_field": false}, {"title": "FinMango launches in Angola", "date": "Mar 03, 2018", "year": 2018, "location": "Field", "excerpt": "Our partners are local experts and professionals with years of exceptional work and proven progress.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda48bbc3681d997a15_624b2b07181eaa588800e9a3_Untitled%2520design%2520(85).jpeg", "body": "<p id=\"\">Our partners are local experts and professionals with years of exceptional work and proven progress. We’re excited to officially launch in Angola. Partner: Chamuanga International School</p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:750px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"750px\"><div id=\"\"><img alt=\"28276439_954806534687844_3597775531319614139_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda48bbc38e4b997a18_624b2afdb45fb4ffcb456c01_28276439_954806534687844_3597775531319614139_n.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:960px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"960px\"><div id=\"\"><img alt=\"28167178_954806508021180_438873454000683694_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda48bbc380f1997a19_624b2afde06e6126cb04b754_28167178_954806508021180_438873454000683694_n.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:960px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"960px\"><div id=\"\"><img alt=\"28058635_954806514687846_2816193520700284257_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda48bbc35358997a17_624b2afdd81f9bae527f6129_28058635_954806514687846_2816193520700284257_n.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:960px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"960px\"><div id=\"\"><img alt=\"28058453_954806538021177_2421190973368012799_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda48bbc33bec997a16_624b2afd6231cd1296331086_28058453_954806538021177_2421190973368012799_n.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">‍</p>", "is_field": false}, {"title": "JOG Presentation - FinMango", "date": "Mar 15, 2018", "year": 2018, "location": "Field", "excerpt": "Mango Scott had the opportunity to speak at a Career Development Conference held by JOG ( Jobs for Ohio's Graduates) where he taught 150 students!‍.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edda7d679c2b6aab3d9_624b2cd7b8d8d91b645f9e87_Untitled%2520design%2520(88).jpeg", "body": "<p id=\"\">Mango Scott had the opportunity to speak at a Career Development Conference held by JOG ( <a href=\"https://www.facebook.com/JobsforOhiosGraduates/?fref=mentions\" id=\"\">Jobs for Ohio's Graduates</a>) where he taught 150 students!</p><p id=\"\"><br></p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:960px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"960px\"><div id=\"\"><img alt=\"29472924_969470773221420_7640719092054885543_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edda7d67986e7aab3e8_624b2ca8d181e6092d252618_29472924_969470773221420_7640719092054885543_n.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:960px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"960px\"><div id=\"\"><img alt=\"29473005_969470783221419_6534637047751860382_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edda7d6798f9caab3e9_624b2ca81cfe0f55e4ed52e4_29473005_969470783221419_6534637047751860382_n.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">‍</p>", "is_field": false}, {"title": "Financial Literacy Class to 50 Realtors!", "date": "Mar 20, 2018", "year": 2018, "location": "Field", "excerpt": "We taught a financial literacy class to 50 realtors and their families at Weymouth Country Club in Medina, Ohio! Thanks for sponsoring this event, First Security Mortgage Corporation!‍.", "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c3539fc26294160_624b2dcc8010998b63cc5c74_2.jpeg", "body": "<p id=\"\">We taught a financial literacy class to 50 realtors and their families at Weymouth Country Club in Medina, Ohio! Thanks for sponsoring this event, First Security Mortgage Corporation!</p><p id=\"\"><a id=\"\"><br></a></p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:750px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"750px\"><div id=\"\"><img alt=\"1.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c35390634294162_624b2da8b169a964ae2da8cc_1.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:750px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"750px\"><div id=\"\"><img alt=\"2.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c3539fc26294160_624b2dcc8010998b63cc5c74_2.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:750px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"750px\"><div id=\"\"><img alt=\"3.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c3539b6dc294161_624b2da86b21e66d89e7c72e_3.jpeg\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">‍</p>", "is_field": false}]