[
  {
    "title": "In a Complex World, Simple Wins!",
    "date": "Apr 01, 2022",
    "year": 2022,
    "location": "Research Lab",
    "excerpt": "world is complex and connected in ways we don’t fully understand.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edcc5306e905fe847d9_623fc2776b70a71576ed507b_Screen%2520Shot%25202022-03-26%2520at%25209.47.16%2520PM.png",
    "body": "<p>By Scott Glasgow</p><p>The world is complex and connected in ways we don’t fully understand. Everything from products to personalities has a brand, a logo, an experience.</p><h4><strong>Most are instantly forgettable.</strong></h4><p>They look and feel the same as everything else. They’re built on rational thinking and they follow trends instead of forging them. A great brand is the opposite.</p><p>At <a href=\"https://finmango.org/\"><strong>FinMango</strong></a>, simple wins in our brand and design philosophy. It is what guides what we do for the people we reach and how we act as an organization.</p><h4><a href=\"https://finlit.finmango.org/the-feynman-technique/\">The Feynman Technique:</a></h4><p>The Feynman Technique is a learning framework that forces you to strip away needless complexity. It was developed by Richard Feynman, a Noble Prize winning theoretical physicist from the United States.</p><p>Interestingly, Feynman’s true genius was in his ability to convey complex ideas into simple, digestible ways. He observed that complexity and fluff are often used to mask a lack of deep understanding.</p><p>The Feynman Technique incorporates four steps:</p><ol><li><strong>Pick and study a topic</strong></li><li><strong>Be able to explain it to a kid</strong></li><li><strong>Identify any gaps in your understanding</strong></li><li><strong>Review and simplify</strong></li></ol><p>You can learn more about the Feynman technique <a href=\"https://finlit.finmango.org/the-feynman-technique/\"><strong>here</strong></a>.</p><h4>Mathematical Illustration.</h4><p>Let’s look at a mathematical problem that “looks” complex:</p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edcc5306e085de847e0_623fc2b1bfb79e48edfe8dc3_Screen%2520Shot%25202022-03-26%2520at%25209.45.20%2520PM.png\"><p>Do you know the answer? Interestingly, most don’t even attempt, few try, and everyone fails. It comes across as complex and intimidating.</p><h4>So, Let’s Break it Down!</h4><p>Below is an example of how I teach kids…</p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edcc5306eaef4e847df_623fc2c7f7abaa40dcfce5c7_Screen%2520Shot%25202022-03-26%2520at%25209.46.05%2520PM.png\"><h4>Steps.</h4><ol><li>Separate. Mentally draw a line between the first and second numbers.</li><li>On the left, take “x” and multiply it by “(x+1).”</li><li>On the right, simply square the number: y(y).</li><li>Merge. Combine both answers to get your final answer.</li></ol><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edcc5306e8317e847de_623fc2a4248561414d9c46dc_Screen%2520Shot%25202022-03-26%2520at%25209.46.34%2520PM.png\"><p><em>*NOTE: this trick only works when the number ends in a “5.”</em></p><h3>Summary? Simple Wins!</h3><p>It is easy to overcomplicate and intimidate. We all know the people and can admit to times we have done it as well. However, we cannot be fooled—complexity and fluff are often used to mask a lack of deep understanding.</p><ul><li><strong>Simple is generous.</strong></li><li>A simple idea is generous because it is understood by your customers, team, and community. It is easy to use and actively helps everyone.</li><li><strong>Simple makes bold possible.</strong></li><li>Once we have our simple idea down, we give ourselves the rare opportunity to do what the vast majority never do: to be bold and stand out in an ever-complex world.</li><li><strong>Simple provides direction.</strong></li><li>Thinking simple provides us not with a destination, but a direction. It gives us the “why” and how we can grow in that direction.</li></ul><h4>Conclusion.</h4><p>It is easy to feel intimidated in such a complex world—both personally and professionally. However, we don’t have to accept this fate. Thinking “simple” can help us overcome challenges—no matter how small or large—by breaking it down with focus and clarity. Think simple, it’s how we operate at FinMango!</p><h6>*** This post is being reposted. It was originally written and posted in August of 2021.</h6>"
  },
  {
    "title": "First Principles Thinking",
    "date": "Feb 25, 2022",
    "year": 2022,
    "location": "Research Lab",
    "excerpt": "Aristotle defined a first principle as, “the first basis from which a thing is known.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edbf4dc55adc3997a07_623fc129f4290dbd43c64609_Untitled%2520design%2520(19).jpeg",
    "body": "<h5>Aristotle defined a first principle as, “the first basis from which a thing is known.”</h5><h3>First, a few definitions.</h3><p>A “first principle” is a foundational assumption or proposition — it is foundational in that it cannot be deduced from other assumptions or propositions. Think of a first principle like an element. It cannot be broken down further. It is pure.</p><p>“First Principles Thinking” is a problem-solving technique that requires you to break down a complex problem into its most basic, foundational elements.</p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edbf4dc558b5b997a08_623fc04b9ab39e54772dcd15_Screen%2520Shot%25202022-03-26%2520at%25209.38.35%2520PM.png\"><h4>THE IDEA: To ground yourself in the foundational truths and build from there.</h4><p>When we encounter difficult problems, our tendency is to rely on base level assumptions we have been told are true—or that we believe to be true. It’s quick and easy to do so. But it also leads to unimaginative, linear solutions that closely resemble all that has been done previously.</p><p>This is called “reasoning by analogy” and this leads to solutions that are like something else. It can be useful heuristic when speed is required and novel solutions are not the goal. However, it falls short when dealing with complex problems in need of imaginative solutions.</p><p>Imagine the solution to a problem as a house. The foundation is the assumptions upon which the solution rests. If the foundation is shady, the house will collapse. If the foundation is sturdy, the house will hold up. First principles form a STRONG FOUNDATION for the house.</p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edbf4dc55adc3997a07_623fc129f4290dbd43c64609_Untitled%2520design%2520(19).jpeg\"><h4>Case Study: Elon Musk and his original SpaceX Rocket</h4><p>The complex problem? Sending a rocket to Mars. The logical first step: to obtain a rocket.</p><p>Musk discovered the cost of buying a rocket was insanely expensive—or can we say otherworldly 😅. Buying a rocket for ~$65 million was not only untenable, it was also grounded in assumptions of how rockets have always been built and what they should cost.</p><p>He turned to first principles. He asked and answered basic, foundational questions. What is a rocket made of? Aerospace-grade aluminum alloys, titanium, copper, and carbon fiber.</p><p>What is the value of those materials on the open market? Just ~2% of the typical rocket price. So Elon decided to build his own. Rather than accepting the “truths” he had been told about the cost of a rocket, Musk grounded his problem solving in first principles.</p><p>Today, SpaceX rockets are safely delivering humans to space and the dreams of a Mars voyage are alive.</p><h3>Conclusion.</h3><p>There is no such way to establish first principles. “Socratic questioning” —a technique where you use systematic questioning to drill-down to fundamental truths—is one method. The greatest thinkers and problem solvers agree: when solving a complex problem, think simple and ground yourself in first principles and build your solution up from there. This is what we do at FinMango.</p><p>Check out out newest tool, the “<a href=\"http://mngo.org/portfolio\">Build Your Portfolio</a>” Simulator!</p>"
  },
  {
    "title": "It's almost time to relaunch",
    "date": "Jun 28, 2022",
    "year": 2022,
    "location": "HQ",
    "excerpt": "I am excited to share that FinMango is embarking on a new journey, with a new focus on something more.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/6390a7ef99e2d1bbe3d03a61_26mag-Migratiion-Images-12-superJumbo.jpg",
    "body": "<p>I am excited to share that FinMango is embarking on a new journey, with a new focus on something more. Something bigger. </p><p><strong>FinMango is on a mission to solve complex problems that endanger the financial health of young adults in transition. We believe in financial equity for all.</strong></p><p>As an organization, <strong>we will no longer be a player in the crowded financial education world</strong>. Instead, our work will focus on the complex context of young adults globally and their financial health. More specifically, it will target the stability of young adults during times of life transitions and financial shock.</p><h3>Why financial health?</h3><p>Too many people struggle to manage their daily financial lives–especially young adults. Interestingly, this struggle does not just apply to low-income households or certain geographic areas. In fact, according to <a href=\"https://www.cnbc.com/2022/01/19/56percent-of-americans-cant-cover-a-1000-emergency-expense-with-savings.html\">CNBC</a>, 56% of Americans can’t cover a $1,000 emergency expense with savings.</p><p>Good financial health can change everything. But what is financial health? “<strong>Financial health or wellbeing is the extent to which a person or family can smoothly manage their current financial obligations and have confidence in their financial future</strong>. The elements that shape a person’s financial health include: </p><ul><li><strong>Day to day</strong>: Smooth short-term finances to meet financial obligations and consumption needs.</li><li><strong>Resilience</strong>: Capacity to absorb financial shocks.</li><li><strong>Goals</strong>: On track to reach future goals. </li><li><strong>Confidence</strong>: Feeling secure and in control of finances.” (<a href=\"https://www.unsgsa.org/sites/default/files/resources-files/2021-09/UNSGSA%20Financial-health-introduction-for-policymakers.pdf\">UNSGSA</a>)</li></ul><p>We’re just at the beginning of this journey and we can’t wait to share our plans to achieve our new mission and vision. If you're like me, you are even more eager to get involved. Here's how:</p><ul><li>For questions about the strategic planning process itself–what we have done, what we have learned and where we are heading, reach out to Katherine (katherine@finmango.org).</li><li>If you’re as excited as we are about FinMango’s future and want to help once we roll out our strategic plan, let Bruna (bruna@finmango.org), Kaylei (kaylei@finmango.org) or any of us know.</li><li>If you’re curious about the design and strategic theory behind our planning process, contact Chris (chrisashannon@gmail.com).</li></ul><p>I’m so excited for the future of FinMango and can’t wait to support young adults during life transitions and financial shocks. </p><p>Stay tuned for more news about our new launch date: July 22nd – National Mango Day. </p><p>References: </p><p><a href=\"https://www.cnbc.com/2022/01/19/56percent-of-americans-cant-cover-a-1000-emergency-expense-with-savings.html\">https://www.cnbc.com/2022/01/19/56percent-of-americans-cant-cover-a-1000-emergency-expense-with-savings.html</a></p><p><a href=\"https://www.unsgsa.org/sites/default/files/resources-files/2021-09/UNSGSA%20Financial-health-introduction-for-policymakers.pdf\">https://www.unsgsa.org/sites/default/files/resources-files/2021-09/UNSGSA%20Financial-health-introduction-for-policymakers.pdf</a></p>"
  },
  {
    "title": "Strategic Planning Process Update",
    "date": "May 25, 2022",
    "year": 2022,
    "location": "Columbus, Ohio",
    "excerpt": "Mango Family, As our strategic planning process continues to evolve, I’d like to share an update.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/6390a72fcc27e9d38c049cef_62bc8d8ef3c953460de68ed0_1653485083086%2520(2).jpeg",
    "body": "<p>Mango Family, </p><p>As our strategic planning process continues to evolve, I’d like to share an update.</p><p>The strategic planning team consists of eight thoughtfully picked Mangos – <a href=\"https://www.linkedin.com/in/katherine-lordi/\"><strong>Katherine Lordi</strong></a><strong>, </strong><a href=\"https://www.linkedin.com/in/gauthamkannan95/\"><strong>Gautham Kannan</strong></a><strong>, </strong><a href=\"https://www.linkedin.com/in/ojasvinee-singh/\"><strong>Ojasvinee Singh</strong></a><strong>, </strong><a href=\"https://www.linkedin.com/in/bruna-ch%C3%ADxaro-37a98a105/\"><strong>Bruna Chíxaro</strong></a><strong>, </strong><a href=\"https://www.linkedin.com/in/tobias-abramenko-964b95196/\"><strong>Tobias Abramenko</strong></a><strong>, </strong><a href=\"https://www.linkedin.com/in/avneeshsawhney/\"><strong>Avneesh Sawhney</strong></a><strong>, </strong><a href=\"https://www.linkedin.com/in/dominic-julian-a47077169/\"><strong>Dominic Julian</strong></a><strong>, </strong><a href=\"https://www.linkedin.com/in/sglasgow/\"><strong>Scott Glasgow</strong></a> – &nbsp;and one facilitator – <a href=\"https://www.linkedin.com/in/chrisshannon1/\"><strong>Chris Shannon</strong></a>. Each member was carefully selected based on their availability and skill sets related to project management, communication, stakeholder voice, and membership voice.</p><p>Starting today, we will begin updating the community on a weekly basis. </p><p>To date, our time has been spent <strong>surveying</strong>, <strong>mapping the financial education ecosystem</strong>, <strong>creating empathy maps</strong>, and <strong>conducting supplemental research</strong>. Looking ahead, we will <strong>identify a potential target population</strong> where we believe we will have a deep and unique impact, <strong>define the problem we are trying to solve</strong> for that population through our collective efforts, and use this information to <strong>revise our mission statement and draft a vision statement</strong> to guide our work in the coming years. Following those developments, we’ll jump into creating strategies to achieve that vision, including objectives and key results (OKRs) as well as our criteria for success. </p><h3>We will publicly present FinMango’s refined strategic direction on <strong>July 22nd – National Mango Day!</strong></h3><p>I look forward to learning as we go and sharing more frequently, all in service of fostering a collaborative and transparent approach to this process. </p><p>For many of you, I know that this transition represents a long-awaited milestone and a positive sign that we can engage more fully-focused moving forward. For others, it may also be an unsettling change. <strong>I want you to know that we are deeply honored by your commitment to FinMango and the work you are doing around the world to create positive change.</strong> We are committed to making sure that your personal and professional needs are still being met as we enter this next phase together – I know there is a lot of excitement, and with that can come questions! To make sure you are getting the information you need from the best source, please direct questions to the following Mangos:</p><ul><li>For questions about the strategic planning process itself–what we have done, what we have learned and where we are heading, reach out to Katherine (katherine@finmango.org). </li><li>If you want to help us move our work forward during this time of transition, please &nbsp;reach out to Jack (jenkema@finmango.org) about supporting the vetting and rollout of the Company Benefits and Definitions Guide. </li><li>Communication is going to play a very important role in the next six months; consider supporting OJ (oj@finmango.org) with her communications and branding work.</li><li>If you’re curious about the design of our strategic planning process, contact Chris (chrisashannon@gmail.com).</li></ul><p>On July 7th, 2017, an organization was formed in Akron, Ohio to redefine the way we understand money and make people’s lives better in the process. Five years later – and many impactful projects together – we mark this occasion by redirecting ourselves to that vision. I can’t wait to see what we will accomplish together in our passionate desire to make the world a place where all people have the opportunity to live their best financial lives.</p><p>Love &amp; fury,</p>"
  },
  {
    "title": "Hello World! Welcoming The New FinMango 🚀",
    "date": "Jul 22, 2022",
    "year": 2022,
    "location": "HQ",
    "excerpt": "It’s time to officially introduce the world to the new FinMango 🥭, which launches today – on National Mango Day! FinMango’s new mission is to solve complex problems that endanger...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/6390a83c9311824b82b02fbe_vYIJDv5J.jpeg",
    "body": "<p>It’s time to officially introduce the world to the new FinMango 🥭, which launches today – on <strong>National Mango Day! </strong></p><p><br></p><p>FinMango’s new mission is to solve complex problems that endanger the financial health of young adults in transition. We believe in a world with financial equity for all and adhere to the following values:</p><p><br></p><p>(1) Globally inclusive. We work to inspire coalitions and are, in turn, deeply inspired by those who share our passion. (2) Insatiably curious. We never stop learning. We deploy new knowledge to increase our capacity and to explore what might be possible. (3) Boldly joyful. We pursue a better life for all with boundless passion. (4) Fanatically focused: We choose our work and our partners intentionally based on research, data and capacity with an eye for measurable impact. (5) Honest and transparent: We are humble enough to recognize our own shortcomings, open enough to share our work and brave enough to shine a light on system failures.</p><p><br></p><p>The term “<strong>financial health</strong>” appeals to us for so many reasons. Learn more about why on our NEW WEBSITE (finmango.org)<strong> 🚀</strong>, which is still in the works but launches today. </p><p><br></p><p>Looking back, I am so thankful to <a href=\"https://www.linkedin.com/feed/#\"><strong>Chris Shannon</strong></a> for facilitating the strategic planning process and for all the thoughtfully picked mangoes that served on the team – <a href=\"https://www.linkedin.com/feed/#\"><strong>Katherine</strong></a>, <a href=\"https://www.linkedin.com/feed/#\"><strong>Tobias</strong></a>, <a href=\"https://www.linkedin.com/feed/#\"><strong>Dominic</strong></a>, <a href=\"https://www.linkedin.com/feed/#\"><strong>Ojasvinee</strong></a>, <a href=\"https://www.linkedin.com/feed/#\"><strong>Bruna</strong></a>, <a href=\"https://www.linkedin.com/feed/#\"><strong>Avneesh</strong></a> and <a href=\"https://www.linkedin.com/feed/#\"><strong>Gautham</strong></a>! In just 15 weeks, they have drastically altered the direction of FinMango for the better and I am deeply grateful for their contribution. Please reach out to any of these members if you have questions.</p><p><br></p><p>Looking ahead, it's now time to execute. In short, our master plan is:</p><p><br></p><p>(1) Evolve into a learning organization. We’ll constantly create, acquire, and transfer knowledge to the public and be able to quickly adapt our behavior to reflect new insights.<br></p><p>(2) Develop into a leading data aggregation organization. Financial health is a young area of study, and many important questions need to be investigated.<br></p><p>(3) Leverage strategic partnerships to maximize the impact of our work.<br></p><p>(4) Probe AI and tech innovations to improve the financial health of young adults globally. With AI and technology, we have more tools to explore and address hard, unanswered questions with the help of data.</p><p><br></p><p>*NOTE: FinMango is no longer a player in the crowded financial education world.</p><p><br></p><p>I’m so excited for the future of FinMango and can’t wait to support young adults during life transitions and financial shocks. FinMango has come far — and has a long journey ahead. It is you, our Mango Family, that empowered us to reach this point. FinMango isn’t only built for you, it’s built by you. </p><p><br></p><p>Check out our new website and stay tuned for updates on how to support our work and get involved. </p>"
  },
  {
    "title": "Strategic Planning Process Update",
    "date": "Jun 03, 2022",
    "year": 2022,
    "location": "HQ",
    "excerpt": "The mango is one of the most popular fruits in the world.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/6390a730c0d0128e37589451_62bc8ddad82619c1e323311f_Untitled%2520design%2520(69).jpeg",
    "body": "<p>The mango is one of the most popular fruits in the world. Simplistically, most would say it is oval and orange, but the mango can actually be found in a multitude of sizes, colors, and tastes. Hundreds of varieties exist. At first glance, the mango seems like a typical fruit. But further assessment reveals much more complexity. </p><p>I couldn’t resist reminiscing on this assessment during a discussion on the Cynefin Framework – a model used in adaptive leadership to assess complex concepts and address real-world problems. The model depicts five contexts for problem-solving and action: simple, complicated, complex, chaotic, and finally, disorder. Learn more about it <a href=\"https://youtu.be/epXqgrm2hs4\">here</a>.</p><p>At an organizational level, FinMango’s work aligns with the “complex,” or systems, context. Our approach will be experimentation with an emphasis on probing, sensing, and then responding.</p><p>Though a complex system may appear predictable, hindsight does not lead to foresight because at the end of the day, external systems constantly change. This means that we cannot predict what will happen and that the system is dynamic. Solutions can’t be imposed; rather, they emerge from the circumstances and are often put into action through influence.</p><p>Moving forward, it’s evident – thanks to the community survey – that our work should focus on the complex context of young adults around the world and their financial stability. More specifically, thanks to your input, we should focus on supporting that stability to young adults in times of transition. </p><p>FinMango has come far — and these changes may not be easy. It’s going to require us to think and act much differently than we have in the past. Nevertheless, It is you, our “mango” family, that has energized us to reach this point. I have never been so excited about our future and feel even more committed to help young adults, and even more passionate about the cause of helping people in transition. I firmly believe now more than ever, FinMango is moving in the right direction with a clear focus. </p><p>Do you have questions? Reach out to us!</p><ul><li>For <strong>questions about the strategic planning process itself</strong>–what we have done, what we have learned and where we are heading, reach out to <a href=\"mailto:katherine@finmango.org\">@Katherine Lordi</a>. </li><li>If you want to <strong>help us move our work forward</strong> during this time of transition, please &nbsp;reach out to <a href=\"mailto:jenkema@finmango.org\">@Jack Enkema</a> about supporting the vetting and rollout of the Company Benefits and Definitions Guide.</li><li>If you’re as excited as we are about FinMango’s future and <strong>want to help once we roll out our strategic plan</strong>, let <a href=\"mailto:Kaylei@finmango.org\">@Kaylei Ruffing</a> or <a href=\"mailto:oj@finmango.org\">@OJ Singh</a> know. Communication and branding work will be important in FinMango 2.0.</li><li>If you’re curious about the <strong>design and strategic theory</strong> behind our planning process, contact <a href=\"mailto:chrisashannon@gmail.com\">@Chris Shannon</a>.</li></ul><p>Let's mango,</p>"
  },
  {
    "title": "Battle of the IRAs Calculator",
    "date": "May 03, 2021",
    "year": 2021,
    "location": "Field",
    "excerpt": "Let's see how much your savings can grow and which IRA wins in the end!Introducing the “Battle of the IRAs” calculator, a sequel to the world’s BEST Roth IRA calculator we...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed75acfc4503863e9b5_624b31834a7725b8af70c899_Untitled%2520design%2520(94).jpeg",
    "body": "<p>Let's see how much your savings can grow and which IRA wins in the end!</p><p>Introducing the “Battle of the IRAs” calculator, a sequel to the world’s BEST Roth IRA calculator we introduced last week. Our interactive modules explain foundational investing concepts and show students how to make money work for them. Built on FIRE (Financial Independence, Retire Early) concepts, these modules are a great way to supplement your in-class teachings or learn on your own. Check out more tools at <a href=\"https://ignite.finmango.org/#about\">mango IGNITE</a>.</p><p>Drop a comment below or email us at hello@finmango.org with feedback/suggestions 😃.</p>"
  },
  {
    "title": "Beta Launch: Snap-Style Lessons",
    "date": "Aug 18, 2021",
    "year": 2021,
    "location": "Field",
    "excerpt": "Beta Launch Alert 🚨‼️ We’re excited to softly launch Mango Stories: bite-sized lessons that look and feel like Instagram stories.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed8789b5e989e653c5e_624b3368b663cae9d77f1c11_Untitled%2520design%2520(99).jpeg",
    "body": "<p>Beta Launch Alert 🚨‼️ We’re excited to softly launch <a href=\"https://stories.finmango.org/\">Mango Stories</a>: bite-sized lessons that look and feel like Instagram stories. Mango stories are a product of <a href=\"https://x.finmango.org/\">Mango X</a> and we would love to get your feedback before we fully release the product to the public. 🚀</p><p>Check it out at <a href=\"https://stories.finmango.org/\">stories.finmango.org</a> and don’t hesitate to reach out with feedback via email (<a href=\"mailto:hello@finmango.org\">hello@finmango.org</a>), <a href=\"https://www.instagram.com/finmango/\">DM</a>, or in the comments section below. A few beta testers will receive a FinMango hoodie 🤗</p><p><a href=\"javascript:void(0)\">6</a><a href=\"https://blogs.finmango.org/p/beta-launch-mango-stories/comments\">Comment</a><a href=\"javascript:void(0)\">Share</a></p>"
  },
  {
    "title": "12 Year Old FinLit Guru - Pranav",
    "date": "Feb 12, 2021",
    "year": 2021,
    "location": "Field",
    "excerpt": "is 12 years of age and lives in Los Gatos, California.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed741aa3521fe028ba6_624b0c6af182dc3c7fb97435_Untitled%2520design%2520(52).jpeg",
    "body": "<p>By <a href=\"https://www.linkedin.com/in/erinn-heffes-88bb8415a/\">Erinn Heffes</a></p><p>Pranav is 12 years of age and lives in Los Gatos, California. He is currently in 6th grade and is passionate about Math, English and Science. He believes he grew up extremely driven and focused and wants to get to a high place in life. To Pranav, getting to a high place means “...getting a really good rank in whatever he does.” Whether that be getting his PhD, becoming an astronaut who goes to Mars, or becoming a ‘top’ doctor. Pranav’s goal is to simply be the best and most successful version of himself he can be. When he isn’t doing school work or focused on being a financial wiz, Pranav enjoys reading, drawing comics, crafting and so much more. A few fun facts about Pranav include, his love for learning about how antibiotics work against different viruses and germs etc. and his fascination with moving from one planet to another. Pranav’s mind is always thinking big and focused on the impossible for many, that will one day become possible to him. </p><p>Pranav’s interest in financial literacy and investment began when he overheard his parents talking about stocks and investing. He never understood what those words signified and when he realized it had to do with money he wanted to get involved and learn about stocks and investing, to see what he could do with his money. He spoke to his parents about it and ended up taking some financial education classes with another amazing FinMango advocate; Carolyn Cooper.</p><img alt=\"IMG_2573.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed741aa354510028ba7_624b0c7bcc8aaaca36020392_IMG_2573.jpeg\"><p>Not only did Pranav develop his financial education, but he took it a step further and is currently running his own business; <a href=\"https://bunnysitting101.business.site/\">Bun Bun Bunny Sitting</a>. Pranav has a pet bunny of his own and the thought crossed his mind as to what would be done with his rabbit if he was on a trip. It then escalated into thinking, “What do people in general do with their pets when they need to take a trip or vacation?” This thought snowballed even further and led to Pranav setting up a website using google my business and creating his own business where individuals can request his services, to have their rabbits cared for while they are away. </p><p>As Pranav’s business was taking off and he was increasing his financial education with Carolyn’s help, he found about FinMango through her and ended up taking one of Mango Bob’s investment classes. Pranav believes that “Mango Bob’s class was extremely good. He went into detail about everything, he made it easy to understand and you could tell what he was doing from his teaching.” Pranav believes others should take this class (especially the younger generations) because of the impact it can have. Without being educated on these topics, it could harm one’s financial future and younger generations are in a lucky spot and should take advantage of their age and start learning how to prepare themselves for the future.</p><p>Asides from being involved in FinMango’s classes, Pranav also had the opportunity to appear on a <a href=\"https://www.ngpf.org/blog/podcasts/ngpf-podcast-carolyn-cooper-and-her-student-pranav-discuss-the-importance-of-financial-education/\">podcast</a> with Tim Ranzetta at Next Gen Personal Finance, which focused on stocks and bonds; what they are and how they work.</p><p>Pranav is immensely passionate about financial literacy and when asked what he wishes to see being done differently in schools to address financial literacy, his response was to have more exposure. He believes the biggest issue is that people simply do not know what investing is, how to do it or its importance and that needs to change. People tend to have their money sitting in a bank where no growth is being seen, when they could be investing and growing it.</p><p>Three pieces of advice he wants to leave are:</p><ul><li>Relating to stocks : Don’t put all your eggs in one basket. Diversification over different stocks is important. </li><li>Start investing when you are young, as your money will grow over time. </li><li>Don’t end up in debt as this will compound over time. </li></ul><p>In the end helping people around the world is what makes Pranav happy. He strives to find ways to give and support others. Whether that be through his bunny sitting business, appearing on podcasts, advocating for development in financial literacy (especially in schools) or becoming a top doctor one day.</p><img alt=\"IMG_3392.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed741aa354cb3028ba8_624b0c7caa918d0a8223a1fb_IMG_3392.jpeg\"><p><br></p>"
  },
  {
    "title": "Call for Volunteers - FinMango SMB Guide Translation Project",
    "date": "Jul 14, 2021",
    "year": 2021,
    "location": "Emergency Response",
    "excerpt": "Hey Mango community!Hope you're all doing well.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed81472383f6590c4ea_624b32f6281537d60dbebb35_6249d5a33460621da4031c03_51064545_1200770356758126_8848772222022582272_o%2520(1).jpeg",
    "body": "<p>Hey Mango community!</p><p>Hope you're all doing well.</p><p>With the pandemic pushing hundreds of millions of people below the poverty line this year, FinMango has more incentive than ever to help people all around the world get financially literate. </p><p>Our newest global initiative is the <a href=\"https://wahltinez.github.io/small-business-guide/\"><strong>Small Business Guide</strong></a><strong> - </strong>It is to help small business owners effectively bring their business to the digital era. We have partnered with the <a href=\"https://wahltinez.org/\">Wahltinez Foundation</a> to create a free online resource which can help these business owners navigate the various barriers to setting up and managing their online businesses. </p><p>We intend to make this guide globally available in 20 or more different languages and are looking for volunteers to help us. </p><p><strong>Volunteer Requirements:</strong></p><p>We are looking for volunteers to work with dedicated team members for FinMango in translating our SMB Guide-book. Volunteers need to be:</p><ol><li>Fluent in any 1 of the following languages - French, Spanish, Portuguese, Any South Asian Language</li><li>Able to perform basic market research wherever needed to contextualize the document for a given geography</li><li>A great team player and communicator</li></ol><p><strong>Volunteers Responsibilities:</strong></p><ol><li>One time volunteering stint of 5-6 hours on translation and research related tasks</li><li>Provide share updates with dedicated FinMango team members on your progress</li><li>Work well with various team members and adhere to timelines for given goals</li></ol><h2>If you are interested - Sign-up with your details on this <a href=\"https://finmango.typeform.com/to/ZE9w83WS\"><strong>FORM</strong></a>. </h2><p>A few hours of your efforts could help someone redeem years in their life :)</p><p>Best,</p><p><a href=\"https://www.linkedin.com/in/harish-sharma9/\">Harish Sharma</a> &amp; <a href=\"https://www.linkedin.com/in/gauthamkannan95/\">Gautham Kannan</a></p>"
  },
  {
    "title": "Advocate Spotlight: Saloni Tandon",
    "date": "Jun 30, 2021",
    "year": 2021,
    "location": "India",
    "excerpt": "Name: Saloni TandonLocation: IndiaOccupation: Manager at MicroSave Consulting (MSC)What achievement makes you most proud?At MSC, we have been able to ensure that the Government of...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed88d03791e23900164_624b32509b8bec0cf08ec078_Untitled%2520design%2520(97).jpeg",
    "body": "<p><strong>Name</strong>: Saloni Tandon</p><p><strong>Location</strong>: India</p><p><strong>Occupation</strong>: Manager at MicroSave Consulting (MSC)</p><h4><strong>What achievement makes you most proud?</strong></h4><p>At MSC, we have been able to ensure that the Government of India and the banking infrastructure work together in an efficient and effective manner to rapidly onboard beneficiaries on to the formal financial system and enroll them in affordable social protection schemes. Over the last two years, we have helped establish new protocols, and enhance the efficiency of the existing ones across 27 districts. This has helped ensure that over 20 million new beneficiaries have access to basic bank accounts. Our project has been deemed successful and has allowed the Government of India to expand it across all 112 backward 'aspirational' districts in the form of a dedicated government led mission. This has been a major achievement for us. It allows us to share critical policy level recommendations with the government, with the aim of ensuring that all people in the country have access to basic bank accounts, and social protection.</p><h4><strong>Why do you advocate for financial literacy &amp; inclusion?</strong></h4><p>At every stage of life, access to affordable and timely financial resources makes all the difference. For a poor, vulnerable individual, lack of access to affordable financial resources pushes him/her further in the vicious cycle of poverty. The recent COVID crisis has proved the importance of savings, and credit for the ultra poor, and the low and middle income segment. Women across the globe, and more particularly in India, face negative gender norms. The lack of - access to a safe place to save their money or avenues to borrow credit often restricts their empowerment or even worse, traps them in toxic, abusive environments. I hope to be able to bridge these gaps through my work. I believe access to finance, especially to individuals that intent to repay the money, should never be a barrier in their access to a better standard of living, quality education or quality healthcare.</p><h4><strong>What would you say is the best advice for the next generation of youth (inspiring them to become financially literate)?</strong></h4><p>Unfortunately, the world runs on money. There will be a time when you'll need money for a loved one, or to fulfill your own ambitions. Every single penny spent unwisely in the past will come to haunt you at that moment. For the sake of you and your family's future, please be wise today. Please take care of your finances today.</p><h4><strong>Favorite (inspirational) quote</strong>:</h4><p>It is not the critic who counts; not the man who points out how the strong man stumbles, or where the doer of deeds could have done them better. The credit belongs to the man who is actually in the arena, whose face is marred by dust and sweat and blood; who strives valiantly; who errs, who comes short again and again, because there is no effort without error and shortcoming; but who does actually strive to do the deeds; who knows great enthusiasms, the great devotions; who spends himself in a worthy cause; who at the best knows in the end the triumph of high achievement, and who at the worst, if he fails, at least fails while daring greatly, so that his place shall never be with those cold and timid souls who neither know victory nor defeat. - Theodore Roosevelt (1910)</p>"
  },
  {
    "title": "Financial Literacy and Awareness Advances in Ghana",
    "date": "Jun 14, 2021",
    "year": 2021,
    "location": "Accra, Ghana",
    "excerpt": "Peter is the founder and Executive Director of The Center for Financial Literacy Education – Africa (CFLE Africa); a non-profit in Ghana that is significantly advocating for...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9819da28e4bbf1b86_624b31efb169a957272dd904_Untitled%2520design%2520(96).jpeg",
    "body": "<p>Peter is the founder and Executive Director of The <a href=\"http://www.cfleafrica.org/\">Center for Financial Literacy Education</a> – Africa (CFLE Africa); a non-profit in Ghana that is significantly advocating for financial literacy in Africa. His goal is to help mitigate the financial illiteracy pandemic through partnerships and collaborations with other organizations, educational institutions, municipalities, employers and news media. Recently established campaigns in Ghana include:</p><ul><li>Financial Literacy Month in April</li><li>Estate &amp; Gift Planning Awareness Month in October</li></ul><p>Peter is on a mission to positively impact lives with advocacy and accessibility to useful resources so people can make educated decisions on their financial future.</p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9819da2b648bf1b87_624b3202da4b0deaea48b02b_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252F467fc613-d003-45eb-b9d4-3a1af63f5a9c_1000x666.jpeg\" alt=\"\"><p>On the 31st of March, The Improving Financial Awareness &amp; Financial Literacy Movement in Ghana was launched at a media press conference held at University of Ghana and hosted by CFLE Africa. The University of Ghana Business School, The FA Association, and The Financial Awareness Foundation (TFAF), and its partners including Axis Pension Trust, PALI Global, Pro Patria Ltd, High School Gh, and others strategic partners and stakeholders including reps from Bank of Ghana, Ministry of Finance, Ghana Association of Bankers, EDC Investments Limited, KPMG Ghana, the 13 Thought Leading News Media Organization, declaring April to be known as Financial Literacy Month in Ghana.</p><p>The Month was dedicated for financial awareness and financial literacy activities. The month was celebrated with various virtual seminars, media campaigns and community outreaches. There were social media campaigns such as daily quotes by strategic partners, interviews and speaking engagements to address issues of finances and money management.</p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9819da22ce3bf1b88_624b3202f6d63d5d3c168e5c_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252Ffb1f6034-6437-456c-a873-5ca40fba878e_1000x666.jpeg\" alt=\"\"><p>On April 30th, Peter collaborated with the National Commission for Civic Education (NCCE - La- Nkwantanang, Madina) to implement a community outreach program at the Madina Market Center. &nbsp;A team of about 40 volunteers engaged over 300 market women and men on financial awareness and financial education to help them get and keep their financial house in order.</p><p>Most women in the community shared that they have lost confidence in financial institutions and the banking sector due to the closure of most banks by the government, and this has led to no savings, or if they do, they save in their homes. </p><p>The Movement addressed most of their concerns and advised them to keep their financial house in order.</p><p>While speaking on a popular television station with Award Winning Journalist Bela Mundi, Bela stated: “most young people think creating wealth happens overnight, that’s not true. There are processes you have to go through. All the wealthy people we see around went through the process. I think we are not telling young people what they need to hear. We have to do something about it and get young people to start thinking.” </p><p>Peter concurs with this statement and believes financial literacy is the foundational skill needed to create a brighter future for all—especially the youth.</p><p>The first edition of Financial Literacy Month in Ghana has created momentum and Peter is looking forward to pushing the movement even further by continuing his work and by helping to form the first <a href=\"https://x.finmango.org/\">Mango X</a> chapter in Africa.</p><p>Peter Kwadwo Asare Nyarko, Executive Director CFLE Africa, </p><p>Email: <a href=\"mailto:peternyarko403@gmail.com\">peternyarko403@gmail.com</a></p>"
  },
  {
    "title": "FinMango Awarded $50,000 Grant from Google Health to Continue Collaboration on the COVID-19 Open Data Project.",
    "date": "Sep 09, 2021",
    "year": 2021,
    "location": "Emergency Response",
    "excerpt": "FinMango, a data-driven non-profit that promotes financial literacy, education, and advocacy around the world, has been awarded a $50,000 grant from Google Health to continue...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9340daf261bd53fc5_624b33a96174609405eb99ec_Untitled%2520design%2520(100).jpeg",
    "body": "<p><a href=\"https://finmango.org/\">FinMango</a>, a data-driven non-profit that promotes financial literacy, education, and advocacy around the world, has been awarded a $50,000 grant from <a href=\"https://health.google/\">Google Health</a> to continue collaboration on Google’s <a href=\"https://github.com/GoogleCloudPlatform/covid-19-open-data\">COVID-19 Open Data Project</a>. </p><p>The COVID-19 Open Data Project is the world's most comprehensive COVID-19 dataset; we track sub-national cases and vaccine deployment data for 20,000+ distinct locations in over 190 countries. Our data has influenced vaccine research, government public policy decisions, and travel safety measures, amongst other things. Additionally, our data has been used by numerous international organizations, including The <strong>WHO (Covax)</strong>, <strong>The World Bank</strong>, <strong>IMF</strong>, <strong>Harvard University Research</strong>, <strong>USAID</strong>, and <strong>Verily</strong>, to name a few.</p><p>Since the inception of the project, the goals of the collaboration have remained the same:</p><ol><li>Help decision-makers understand the unique impact of COVID-19 on different communities,</li><li>Provide timely, transparent, and unbiased data about the pandemic, and</li><li>Establish partnerships with data providers and users to collect facts and extract insights.</li></ol><p>Over the years, we have learned a thing or two about uniting people from different communities, backgrounds, and countries to make a positive impact on the world together. FinMango will use this grant to thank our volunteers, who have dedicated countless hours from their personal lives, education, and careers, to plug the data gap and attempt to create information symmetry between organizations during this devastating pandemic. </p><p>For more about the project and what we’re up to, visit <a href=\"http://covid.finmango.org/\">covid.finmango.org</a>.</p><p>Current contributors [with length of time on the project] include: Pam Hoalt, PhD [14 months], James Glasgow PhD [14 months], James Glasgow Pharm.D. [14 months], Rebeca Lozano [14 months], Kishan Patel [14 months], Uday Patel [14 months], Enrico Buoro [14 months], Scott Glasgow [14 months], Ojasvinee Singh [12 months], Kevin D'Souza [12 months], Martin Noguera [12 months], and Nathan Immel [1 month].</p>"
  },
  {
    "title": "Peying Attention to Peyton ✈️",
    "date": "Oct 01, 2021",
    "year": 2021,
    "location": "Lomé, Togo",
    "excerpt": "Peyton ZachrichSmall Business Digital Guide Spotlight Series.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfab106c847fdb173e_624b34076b21e66cf6e7f69b_Untitled%2520design%2520-%25202022-04-04T140802.878.jpeg",
    "body": "<h3><a href=\"https://www.linkedin.com/in/peytonzachrich/\"><strong>Peyton Zachrich</strong></a></h3><p><a href=\"http://small%20business%20digital%20guide%20spotlight%20series/\">Small Business Digital Guide</a> Spotlight Series.</p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfab106c7c1bdb1742_624b33e46174600bcdeb9f03_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252F27c03e56-a019-49cf-9345-2b706f09c728_3024x3780.jpeg\" alt=\"\"><p><strong>Q: Where did you start out in the business world and where are you now?</strong></p><p><strong>Peyton</strong>: it depends on what you count as starting out. I’ve been doing entrepreneurial-type things since I was like 4, honestly. My first ever journey into it was when my grandpa gave me some seedcorn. My Dad had a garden at the time so I decided to plant them. For whatever reason, my Dad’s own plants died, so I offered mine to him for a price.</p><p>After that, I did tons of different stuff as a kid. I started a pawn shop during recess in 3rd or 4th grade, different little mowing and raking companies when I was growing up, and in college, I started an E-Commerce business with my little brother. It didn’t end up gaining traction, but it actually taught me a lot and helped improve my mental models about how to run a successful business. </p><p>In my last semester before graduating with a degree in Finance from Akron, a friend of mine told me about real estate investing. I think about things in terms of numbers, so I never quite understood it but he was the one who showed me how the concept really plays out. Once I understood it, I became extremely interested in it. Right before I graduated, I decided to buy a really distressed real estate company. I was able to turn it around relatively smoothly and then I started my career in the corporate path. The same week, I decided to take on another distressed real estate project. The second one was a much harder turnaround. It was very much an extreme emergency of business, as things go. It took a long time to turn around and was extremely challenging to take on while pursuing a corporate career simultaneously. I couldn’t even tell my coworkers what I had going on outside of work. During lunch, I’d lock myself in this little room eating and making real estate calls. I’d be on call at the gym, in bed, basically at all times. I was sweating for a while. Fortunately, we went from exploding, to eventually stable, and then finally we reached the point where we had this thing where we wanted it. We could finally grow and take on new projects.</p><p>That’s pretty much where I’m at with that now. I left my corporate job about 8 months ago to go all-in as an entrepreneur We just bought a second self-storage facility in August and hope to buy another one soon. I really like self-storage. People have a lot of stuff and always will. I’m currently very close to buying another small business here in Cleveland that makes and installs glass-box windows.</p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfab106c68fadb1740_624b33e47ce989a7cc2bde07_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252Fc6541c8c-cfe2-4a68-a4f1-7d12467e3026_1240x1612.jpeg\" alt=\"\"><h6>Peyton purchasing the glass-box windows business in Cleveland, Ohio.</h6><p><strong>Q: What motivated you to become self-sufficient and leave the corporate path you were on?</strong></p><p><strong>Peyton</strong>: I think that I had always predetermined that I was going to do it. I have such an extreme personality in the sense of really caring about freedom a lot. Ever since I was young, autonomy has been my highest value. The ability to just be me, be authentic, and live the life that aligns with that and brings the maximum amount of growth to myself.</p><p>Originally I had a 10-year plan of working my way up the corporate ladder and then making the jump on my own when I was “ready”. Due to some of the opportunities I got early on, though, the plan definitely got sped up. I was only in corporate for about a year and a half before I made the jump. I remember trying to do both and thinking “man, if only I could just focus on one”. Once I made it through though, I realized that I was so glad that I did both. That foundation really gave me the experience and comfort that I needed to make the jump on my own.</p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfab106c36a7db173f_624b33e4d0c62b9ca57c3584_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252F8b6a86db-c689-4c2a-b1db-f94bf19bbd68_1080x1141.jpeg\" alt=\"\"><p><strong>Q: Starting a successful small business is no small feat. We’ve all heard the stats: about 20% fail within the first year, yet, this sector of the economy is so integral. If someone who was interested in becoming a small business owner came to you for advice -- or perhaps you got a chance to talk to yourself at the beginning of your journey -- what’s one story or piece of advice that you would give that person?</strong></p><p><strong>Peyton</strong>: Before you get into it, you have to know what you’re getting into. You have all the skin in the game. When you have a bad day, you won’t just have an unpleasant couple of hours. You’ll have the full consequences reach you, so things will be more emotional. You no longer have a boss, you no longer have mentors unless you’re specifically seeking them out, so you have to understand that the most important thing to manage is yourself. You have no idea what problem is actually going to sink you vs what problem is actually going to be easy to solve. The mental game-</p><p><strong>Q: Kinda like being a golfer or a tennis player, huh?</strong></p><p><strong>Peyton</strong>: Exactly. Managing yourself is the most challenging part so you have to go about it the right way for yourself.</p><p><strong>Q: If you could put it into just one single quality or word, what does the prospective small business owner need?</strong></p><p><strong>Peyton</strong>: Mindfulness. The ability to be self-aware and be able to admit when you get stuff wrong. Be able to bring yourself out of your own neurosis back into the present moment to be able to accomplish what needs to be done.</p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfab106c3ea8db1741_624b33e4aaf11ac2fdb7bf59_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252Fbadbb1f5-1e1b-4506-8468-dda95e429f8c_1080x1350.jpeg\" alt=\"\"><p><strong>Q: Lastly, at what point during your journey did you find FinMango, and what attracted you to the organization</strong></p><p><strong>Peyton</strong>: I believe that it was during the spring of 2018 while I was in college at Akron. Hector, a friend of mine, introduced me to FinMango and encouraged me to join. He introduced me to Scott (Glasgow) and we immediately hit it off and realized that I needed to get involved with this. I’ve always been super interested in financial literacy as a means of taking control over your own life and I thought FinMango was an effective way to do that. The curriculum is effective, the energy is great, and it’s more about getting things done than bureaucracy. In the first project that I worked on, we made French video curriculum for our partnership with the organization in Togo. It’s been an unforgettable experience for me.</p><iframe src=\"https://www.youtube-nocookie.com/embed/6_LgNpd4LUw?rel=0&autoplay=0&showinfo=0&enablejsapi=0\" frameborder=\"0\" allowfullscreen=\"true\"></iframe><p>Interested in small business resources? Check out our <a href=\"https://wahltinez.github.io/small-business-guide/\"><strong>Small Business Digital Guide</strong></a><strong>! - </strong>In partnership with the <a href=\"https://wahltinez.org/\">Wahltinez Foundation</a>, our goal is to help small business owners effectively bring their business to the digital era.</p>"
  },
  {
    "title": "Introducing the FIRE Calculator",
    "date": "May 12, 2021",
    "year": 2021,
    "location": "Field",
    "excerpt": "Introducing the “FIRE” calculator. FIRE stands for Financial Independence, Retire Early. It is a movement in the space of personal finance that encourages people to live well...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eddfcb9dc76cbf8d82d_624b31bf801099356ecc7cd9_Untitled%2520design%2520(95).jpeg",
    "body": "<p>Introducing the “FIRE” calculator. FIRE stands for Financial Independence, Retire Early. It is a movement in the space of personal finance that encourages people to live well within their means, and aggressively save money towards early retirement.</p><p>For more tools, visit <a href=\"https://modules.finmango.org/\">Power Modules</a>. Our interactive modules explain foundational investing concepts and show students how to make money work for them. Built on FIRE (Financial Independence, Retire Early) concepts, these modules are a great way to supplement your in-class teachings or learn on your own.</p><p>As always, drop a comment below or email us at hello@finmango.org with feedback/suggestions 😃.</p>"
  },
  {
    "title": "How 2021 Was Special",
    "date": "Dec 30, 2021",
    "year": 2021,
    "location": "HQ",
    "excerpt": "Since FinMango was founded in 2016, we’ve been chasing one ambitious goal: ending the global financial exclusion crisis.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edc51fc3af5cf1ab26c_623c6284a23baf3cabee4453_Untitled%2520design%2520(13).jpeg",
    "body": "<p>Since FinMango was founded in 2016, we’ve been chasing one ambitious goal: <strong>ending the global financial exclusion crisis</strong>. And while the crisis is huge, we’re optimistic. We know how to solve the problem, and we make progress every day thanks to our impressive technical capabilities and a strong network of <strong>supporters, teachers, partners, and volunteers</strong>. Currently impacting <strong>1,000,000+</strong> lives annually. </p><p>‍<br></p><h4><strong>Key recipe that worked in 2021:</strong></h4><ol><li>Focus on the people</li><li>Build, rebuild, and rebuild again</li><li>Keep it simple</li></ol><h4><strong>What we didn’t do:</strong></h4><ol><li>Spend a lot of money</li><li>Build everything we envisioned</li></ol><h4><strong>A little history, first</strong>…</h4><p>The FinMango story began with a 2014 class discussion at Kent State University. The name was inspired by my Financial Management class—nicknamed FinMan—and my favorite fruit—the mango. Originally, I launched FinMango as an energy bar company with a foundation arm focused on financial literacy. The business failed, but the foundation lives on.</p><h4>“FinMan” + “Mango” = FinMango! </h4><h6>You can read the full story <a href=\"https://timeline.finmango.org/\">here</a>.</h6><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edc51fc3aa1171ab291_623e05e83f682d0edd09f4de_1a324da0.jpeg\"><p>Since a young age, I was always prompted to think about how I could make a positive difference in this world. This curiosity led me to the field of finance where I constantly asked myself questions like: How could we deepen financial literacy / inclusion across the planet, and more than that, how could we actively participate? How do we help people gain more control and understanding of their money? How do we inspire others?</p><p>My answer to these questions ended up being <a href=\"https://finmango.org/\"><strong>FinMango</strong></a>, a people first organization on a mission to make financial literacy and inclusion universally accessible and useful. Since inception in 2016, we have grown from teaching a unique financial literacy course in the rust belt to impacting 1,000,000+ lives around the world with work featured by Google Health, U.S. News &amp; World Report, Google.org, CNN, The New York Times, NBC, The Daily Beast, and TIME Magazine.</p><h4>Focus on the people</h4><p>Building connections that really matter. It’s why we exist, and why we do what we do. Not many organizations have the power to connect people and help them find purpose in this sometimes crazy and complex world. We do. And that’s something we can all be proud of. Our people (aka the mangoes) come from across the world and can speak up to 20+ languages. 2021 consisted of giving back to these incredible people and we’re excited to do an even better job in 2022!</p><h4>Build, rebuild, and rebuild again</h4><p>The biggest bet to pay off in 2021 was building Mango X—a group of volunteers who build and launch technologies that aim to improve the lives of millions, even billions, of people.</p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edc51fc3aacf21ab294_623e0643ef5bb2629d045a99_Screen%2520Shot%25202022-03-25%2520at%25202.12.47%2520PM.png\"><p>At mango X, the goal is to take <strong>moonshots</strong>: far-out, crazy sounding ideas that could one day make the world a radically better place financially. There’s <strong>no step-by-step manual</strong> for what they do, but there are some guidelines that help them improve their odds:</p><ul><li>A <strong>huge problem</strong> in the world that affects millions or billions of people.</li><li>A radical, <strong>crazy sounding solution</strong> that may seem impossible today</li><li>A <strong>technology breakthrough</strong> that gives us a glimmer of hope that the solution could be possible within the next decade.</li></ul><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edc51fc3a606d1ab290_623dff86d513e8a413089d2f_image02.jpeg\"><p>Mango X has built all the new <a href=\"https://education.finmango.org/\">digital tools</a> and they plan to leverage strategic partnerships in 2022 to amplify their work.</p><h4>Keep it simple</h4><p>The world is complex and connected in ways we don’t fully understand. Everything from products to personalities has a brand, a logo, an experience.</p><h5><strong>Most are instantly forgettable.</strong></h5><p>They look and feel the same as everything else. They’re built on rational thinking and they follow trends instead of forging them. A great brand is the opposite.</p><p>At <a href=\"https://finmango.org/\"><strong>FinMango</strong></a>, simple wins in our brand and design philosophy. It is what guides what we do for the people we reach and how we act as an organization. For example, check out <a href=\"https://stories.finmango.org/\">stories.finmango.org</a> or our flagship “<a href=\"https://finvest.finmango.org/\">How To Become a Millionaire</a>” program.</p><h4><strong>Were there no challenges?</strong></h4><p>The short answer: too many to list. The long one: entrepreneurship and organization is never easy. <strong><em>Failing is never a full-stop. Rather, a semi-colon that motivates you to learn.</em></strong>Everyone faces failure and rejection and FinMango is no exception. A lot of ideas never got built and we also dealt with a lot of logistical problems on projects like the <a href=\"https://health.google.com/covid-19/open-data/\">Google Health Open Data Project</a>.</p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edc51fc3a00831ab292_623b37727e18ab0d06869e0e_Copy%2520of%2520World%2527s%2520most%2520comprehensive%2520COVID-19%2520dataset%2520(2020%2520-%25202022)%2520(1).png\"><p>Below are my takeaways from 2021:</p><ul><li>Keep your ego behind</li><li>Be humble and always give</li><li>Listen carefully to understand vs. listening to respond</li><li>The quality of your work = the sum of decision quality (bets) + luck.</li></ul><p>Overall, the faster you realize it’s not about you, the better you are positioned to find the lesson in a failure. Once you find that lesson, you’ll see the magic start happening. Trust me, it literally feels like MAGIC and you can quickly iterate.</p><h2><strong>Conclusion</strong></h2><p>FinMango is and has always been built by the people, for the people. As a result, we do our best to give back to the people that make us mango and make it a priority to even do more. Our culture has always allowed us to increase our execution and consequently, impact. Seeing mere statistics: that FinMango is just 5 years old, or that we have so many young people actively involved from across the world — you might cultivate the false belief that building something impactful is easy.</p><p>Behind the scenes, we have fallen short countless times for countless reasons. But in a way, that’s the beauty of it… Entrepreneurship is the art of making the most out of available and often, limited resources. We have always done that financially and it’s exciting to do the same with passionate people. Initiatives like the <a href=\"https://covid.finmango.org/\">Open Data Project</a>is an excellent testament to our ability to make the most out of what we have.</p><p>Oh, finally, as a result of our focus on people, we’re relaunching <a href=\"https://campaign.finmango.org/\"><strong>FinMango’s Advocacy / Mentorship program</strong></a> in early 2022! Our community will have more opportunities than ever before to become active and create direct impact.</p><p>FinMango has come far — and has a long journey ahead. It is you, our “mango” family, that has empowered us to reach this point. FinMango isn’t only built for you, it’s built by you. Let’s keep building a better financial future together.</p><p>Feel free to check out our <a href=\"https://cooperative-ink-2d0.notion.site/c68a41bb2a084abeab2d50bde4674e4d?v=273aa8dbbe4b4065b5983ee688e7eecc\">Product Roadmap</a> and don’t hesitate to send me feedback directly at <a href=\"http://mailto:scott@finmango.org/\"><strong>scott@finmango.org</strong></a>. Let’s rock! </p>"
  },
  {
    "title": "Introducing the World's Best Roth IRA Calculator",
    "date": "Apr 28, 2021",
    "year": 2021,
    "location": "Field",
    "excerpt": "https://finmango.github.io/mango-x-rothira/A project of Mango X. Our interactive modules explain foundational investing concepts and show students how to make money work for them.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edd8468247493e02181_624b30feb7be8932b2930583_Untitled%2520design%2520(93).jpeg",
    "body": "<h2><a href=\"https://finmango.github.io/mango-x-rothira/\">https://finmango.github.io/mango-x-rothira/</a></h2><p>A project of <a href=\"https://x.finmango.org/\">Mango X</a>. Our interactive modules explain foundational investing concepts and show students how to make money work for them. Built on FIRE (Financial Independence, Retire Early) concepts, these modules are a great way to supplement your in-class teachings. Check out more tools at <a href=\"https://ignite.finmango.org/#about\">mango IGNITE</a>.</p><p>Email us at hello@finmango.org with feedback/suggestions 😃.</p>"
  },
  {
    "title": "Introducing the FinMango Product Roadmap 🚀",
    "date": "Oct 06, 2021",
    "year": 2021,
    "location": "Field",
    "excerpt": "We're always building new avenues for our community that drive us towards achieving our mission of making financial literacy & inclusion universally accessible and useful around...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edd4cca9b2e4f19b11c_624b344929144e44e8854bab_Untitled%2520design%2520-%25202022-04-04T140909.953.jpeg",
    "body": "<p>We're always building new avenues for our community that drive us towards achieving our mission of making financial literacy &amp; inclusion universally accessible and useful around the world.</p><h4>Built by the people, for the people.</h4><p>As many of you know, we recently doubled down on <a href=\"https://about.finmango.org/\">our mission</a> starting with the launch of <a href=\"https://x.finmango.org/\">Mango X</a> and a suite of new <a href=\"https://products.finmango.org/\">products</a>.</p><p>Demand for <a href=\"https://finmango.org/\">FinMango</a> has been high and we’re trying to scale responsibly. So far we have built an incredible community of supporters, teachers, partners, and volunteers from around the world who have enabled us to build our organization.</p><h4>Today, we are super excited to unveil our <a href=\"https://cooperative-ink-2d0.notion.site/c68a41bb2a084abeab2d50bde4674e4d?v=273aa8dbbe4b4065b5983ee688e7eecc\">product roadmap</a> to the public:</h4><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edd4cca9b576419b121_624b3458b45fb4456845b652_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252F477f6246-6175-4dcd-b6ff-b913a7a034d0_1920x1080.jpeg\" alt=\"\"><p>FinMango’s <a href=\"https://cooperative-ink-2d0.notion.site/c68a41bb2a084abeab2d50bde4674e4d?v=273aa8dbbe4b4065b5983ee688e7eecc\">product roadmap is a freely accessible board</a> where our community can see what we have released, what we are currently working on, and what is potentially coming next.</p><p>More importantly, our community <a href=\"https://finmango.typeform.com/to/XXz0ulmC\">can suggest things they would like us to work on</a>.</p><h2><strong>Why are we publishing the FinMango Product Roadmap to the public? 👀</strong></h2><h4>The mango community comes first!</h4><p>For us, building connections that really matter is what we stand for. It’s why we exist, and why we do what we do. <strong>Not many non-profits have the power to connect people and help them find meaning and purpose in this sometimes crazy and, complex world. We do</strong>. And that’s something we can all be proud of. Because at FinMango, we have the power to change lives for the better.</p><p>Our organization is <strong>built by the people, for the people</strong>. We’re inclusive, straight up, insatiably curious, delightfully surprising, and value the power of simplicity.</p><p>One of the ways to keep our people, products and partners on the right path to achieve our purpose is to openly share our roadmap publicly.</p><h4><strong>Keeping ourselves accountable and transparent 🔍</strong></h4><p>Publishing our roadmap to the public creates an ongoing commitment to solving problems that matter to our community most. It holds us accountable and encourages us to be more focused about what we build, hence building the <a href=\"https://finmango.github.io/mango-x-ira-battle/\">world’s BEST ROTH IRA calculator</a> that our community loves to use.</p><h4><strong>What has been included in the roadmap?</strong></h4><p>Not everything is shown on the roadmap. For example, Mango X is semi-secret and we also work on a multitude of smaller items and larger projects (i.e. busy work) behind the scenes.</p><p>Some might worry that we’re putting ourselves at a disadvantage for releasing all this information for our competitors to see; however, we don’t see this as a problem. At the end of the day, ideas don’t matter, execution is everything.</p><p>The purpose of the roadmap is to be transparent and ensure we’re delivering products people actually <strong>WANT</strong>.</p><h2><strong>What’s next? 🚀</strong></h2><p>Help us decide by checking out our roadmap and suggesting ideas on this <a href=\"https://finmango.typeform.com/to/XXz0ulmC\">form</a>.</p><p>Our mission has and always will be to revolutionize financial literacy by making it universally accessible and useful. We’ve always drawn strength from our diversity, welcomed people from every walk of life to our organization around the world, and strived to build a culture that is inclusive of everyone. It's in our DNA.</p><p>You inspire us daily and make our work possible. It’s an honor to hold hands as we create a better, more just world for everyone.</p><p>Learn more about <a href=\"https://finmango.org/\">our work and ways to get involved here</a>.</p>"
  },
  {
    "title": "Introducing Mango X",
    "date": "Apr 21, 2021",
    "year": 2021,
    "location": "Field",
    "excerpt": "The moonshot factory of FinMangoFinMango is launching a new squad, dedicated to building scalable technology to bring financial independence to teens across the United States and...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edd7932d7c76b09f4c5_624b30886e0cba870df64341_Untitled%2520design%2520(92).jpeg",
    "body": "<p>The moonshot factory of FinMango</p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edd7932d7c76b09f4c5_624b30886e0cba870df64341_Untitled%2520design%2520(92).jpeg\"><p><a href=\"https://finmango.org/\">FinMango</a> is launching a new squad, dedicated to building scalable technology to bring financial independence to teens across the United States and then around the world. This elite and high-energy crew has tech and computer science talent at its core and finance people supporting the content.</p><p><a href=\"https://x.finmango.org/\"><strong>Mango X</strong></a> isn’t here for incremental impact and linear progress - we’re here to take our biggest moonshots at building the most engaging and effective digital roadmaps to financial independence and then getting it into the lives of millions of people at the ages when they need it most.</p><p>Our first project focuses on spreading the <strong>FIRE</strong> (Financial Independence, Retire Early) movement to high schoolers. Our aim is twofold: first, make these among the most beneficial lessons of the school year and, second, build the best support structures possible for our community of teachers who are working hard to empower their high schoolers to take control of their lives.</p><p>Over the years we have learned a thing or two from bringing financial literacy to tens of thousands of high school students through boots on the ground, and FinMango is never going to stop doing what we love. Now <strong>Mango X</strong> will be partnering with some of our rockstar teachers to make big bets for bringing financial education into many more high school classrooms through technology.</p><p>For more about us and what we’re up to, visit <a href=\"https://x.finmango.org/\"><strong>https://x.finmango.org/</strong></a><strong>.</strong></p>"
  },
  {
    "title": "#PaintTheFuture: 0% Interest Micro-Loans for Creative Entrepreneurs in Uganda.",
    "date": "Nov 05, 2021",
    "year": 2021,
    "location": "Kampala, Uganda",
    "excerpt": "HEY FINMANGO FAMILY!THIS NEWSLETTER IS TO SHARE WITH YOU ALL ABOUT AN AMAZING NEW PROJECT FINMANGO IS WORKING ON.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edeafdabfa87f7565b4_624b34a5dccb6200a78e612d_Untitled%2520design%2520-%25202022-04-04T141042.967.jpeg",
    "body": "<p>HEY FINMANGO FAMILY!</p><p><strong>THIS NEWSLETTER IS TO SHARE WITH YOU ALL ABOUT AN AMAZING NEW PROJECT FINMANGO IS WORKING ON.<br><br>READ ON FOR MORE INFORMATION, TO DONATE OR TO GET INVOLVED!</strong></p><p><strong>A CREATIVE REVOLUTION</strong></p><p><strong>FinMango has been working alongside communities in Uganda for some time now and is joining forces with Ugandan based organization, Artisan Global, to bring about a creative revolution.</strong></p><p><strong>“As a country, we are convinced that the Cultural and Creative Industries are a pillar in the Country’s socio-economic development. The Government of Uganda, therefore, pledges to invest in the Cultural and Creative Industries until their contribution to the National Economy is visible and indisputable.” &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</strong></p><p><strong>Source: UNESCO - National Action Plan On Culture And Creative Industries Of Uganda</strong></p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfafdabf5d2d7565b5_624b34913eed1ab005eed9cf_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252F1623b883-04cf-424b-84c6-94b3186ac430_600x202.png\" alt=\"\"><p><em>Who is Artisan Global?</em></p><p>Artisan Global is a 501(c)(3) non-profit that develops sustainable jobs, strategies, and vocational workspaces in Uganda. Accelerating the creative &amp; cultural industries through education, collaboration, and innovation.<br><br>Click the button below to visit their website and learn more about Artisan Global!</p><p><a href=\"https://www.artisanglobal.org/\">Read More</a></p><h1><em>ABOUT THE PROGRAM</em></h1><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfafdabf84197565b7_624b3492d0c62b85bf7c3755_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252Ffc75494a-3ba5-49a1-b1c0-00f98b186c6e_1880x1576.png\" alt=\"\"><h4><em>#PaintTheFuture gives 0% interest micro-loans for creative entrepreneurs in Uganda to increase sustainable income opportunities and provide immediate relief for local businesses severely impacted by the pandemic. These creative entrepreneurs are highly skilled in film/photography, basketry, tailoring/fashion design, jewelry design, visual arts and more. </em></h4><p>CLICK BELOW TO READ MORE ON THE PROGRAM AND TO DONATE!</p><p><a href=\"https://paintthefuture.org/\">Read More</a></p><p><a href=\"https://www.every.org/finmango/f/help-fund-artisan-businesses-in-uganda\">Donate Here</a></p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfafdabf9fe17565b8_624b3491d181e68ab9256f63_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252F6c8f64bb-22b9-49bd-b047-e2b668033958_1920x1080.png\" alt=\"\"><p><strong>By providing these artisans and young entrepreneurs with micro-loans, we will be able to jumpstart their businesses and make sure that the creative industries are prioritized in Northern Uganda during and post-pandemic.</strong></p><h3><strong>Ending Extreme Poverty with Artisans</strong></h3><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfafdabf7b7f7565b6_624b34910fca2b5f2a6eb7ce_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252F2fd2b5bb-e81f-4453-8a10-00d1b0955746_806x1206.png\" alt=\"\"><p>The artisan sector has massive potential to contribute to the end of extreme poverty as it is the second-largest employer around the globe in low-income communities after agriculture, worth over $32 billion every year (World Bank). <br><br>We are committed to supporting the beneficiaries of this new program through business management, marketing workshops, financial literacy education, and other entrepreneurial skills training. </p><p>Through specialized industry training, we will ensure the micro-loans have the biggest impact possible for these entrepreneurs and their communities. </p><h3><strong>YOUR IMPACT WILL LAST GENERATIONS</strong></h3><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfafdabf2b9c7565ba_624b34911dcbf287395ce7bc_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252F66d1efc0-cda4-4fe1-83f7-ed7cbcb4eb88_1920x1080.png\" alt=\"\"><p>By donating towards financial resources for global entrepreneurs, your impact will last for generations to come as we address barriers for small businesses to thrive in economically disadvantaged communities.</p><p><strong>HOW TO MAKE A DONATION!</strong></p><p>This is an amazing way for you to get involved and grow as part of the FinMango family and help pursue our mission and create some change in the world. Click<a href=\"https://www.every.org/finmango/f/help-fund-artisan-businesses-in-uganda\"> HERE</a> to make a donation and stay tuned for other amazing aspects of this project.<br>(including merchandise and wining personalized art!)</p><h1><strong>GET INVOLVED!</strong></h1><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfafdabf32ac7565bc_624b3492d81f9b83ff7fb0b5_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252Fec64bf4d-cfc8-4948-a075-cea3bf03d615_2050x1364.png\" alt=\"\"><ul><li>Want to get involved with the program and help with planning!?</li><li>Have social media / graphic skills?</li><li>Email <a href=\"mailto:erinn@finmango.org?subject=Joining%20the%20Uganda%20Microfinance%20Program%20Team%20\">erinn@finmango.org</a> or <a href=\"mailto:karla@finmango.org?subject=Joining%20the%20Uganda%20Microfinance%20Program%20Team%20\">karla@finmango.org</a>.</li></ul><h1><strong>THANK YOU TO EVERYONE WHO HAS DONATED SO FAR!</strong></h1><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfafdabf1ad97565b9_624b3491e592df6463f8d389_https%25253A%25252F%25252Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%25252Fpublic%25252Fimages%25252F222b5530-fdc1-4f39-bf3f-ff811681eff6_1080x1080.png\" alt=\"\"><p>WE HAVE RAISED OVER $6,000 IN UNDER 8 HOURS AND WE ARE EXTREMELY GRATEFUL FOR ALL THE SUPPORT. CLICK THE BUTTON BELOW TO DONATE AND HELP US REACH OUR GOAL!</p>"
  },
  {
    "title": "Some Lessons From Grandma",
    "date": "Jan 15, 2021",
    "year": 2021,
    "location": "India",
    "excerpt": "up, my weekends and holidays were all spent the same way.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1fcb9dc3a44f8d874_624b0a92c2347b04ecb5015a_Untitled%2520design%2520(51).jpeg",
    "body": "<p>By <a href=\"https://twitter.com/SamatAhana\">Ahana Samat</a></p><p>Growing up, my weekends and holidays were all spent the same way. My parents, both of whom worked full time, even on Saturdays, would drop me off in the morning at my grandmother’s apartment and pick me up in the evening. This routine became such a way of life for me, that it continued on unquestioned even as a teenager. </p><p>Every morning, I would be greeted the same way. “Hi <em>Putta,</em>” she would say, evoking my nickname, her characteristic bindi in the middle of her forehead, and her sari so neatly pinned up, that I often joked that it looked like it had been pleated with a ruler.</p><p>In the extensive time I have spent with my grandmother, or <em>Bajju</em>, as everyone calls her, my appreciation for her fierce independence has only grown.</p><p>In a small town in India in the 1970s, Bajju, a single mother, worked two jobs as a teacher and a tutor, for what must have been 10 hours a day, to single-handedly sustain her family. She independently financially supported my mother through school, university, and graduate school. All this at a time when most women were afforded little autonomy, and those who seized opportunities and broke glass ceilings were discriminated against systematically.</p><p>Very little of my general perspective on life has remained untouched by Bajju. Through leading by example, she has taught me some of the most profound lessons in life, the most important of which helps me manage my finances as a college student.</p><p>For starters, she showed me the importance of recording everything I spend. And I mean, EVERYTHING. For as long as I can remember, every time we came back from buying groceries, she would immediately write down the amount she spent in a little notebook. At the time, I didn’t think much of it, but as I began living on my own, I emulated that habit. While I use an excel sheet to record all my expenses instead of pen and paper, the importance of organization and discipline in having adequate information to make informed fiscal decisions is not lost on me. Sometimes, I am scared to know how much I spend for fear that I have made bad monetary decisions. However, knowing exactly where my money goes helps me cut down on subscriptions, takeout, or Amazon packages when I need to.</p><p>But it’s not just about not wasting money, it’s also about not wasting things. A rule that Bajju enforced- and that I continue to hold onto- was to never waste food. I never throw away the food I cook, I never take more on my plate than I know I can eat, and I always store leftovers in the freezer for subsequent meals. &nbsp;Most of my friends and I often say we would save so much money if we stopped eating out. An<a href=\"https://www.moneyunder30.com/the-true-cost-of-eating-in-restaurants-and-how-to-save\"> article</a> by Money Under 30 on the true cost of eating out quantifies this opinion, - actually fact. So, every time I think of ordering in, I also think about whether there is food in my fridge and if I want to waste it. It sounds silly but it’s saved me so much money!</p><p>Why stop at food? Bajju would always recycle glass containers (like those that hold pasta sauce, for example) to hold grains, lentils, or leftovers instead of throwing them away. I recycle all my pasta sauce jars to hold food, stationary, and even act as vases. On a more philosophical level, I have begun to appreciate the variety in utility of every material and how one’s creativity can add to it.</p><p>The core of any endeavor, Bajju has taught me, is the drive to learn. Every afternoon when I visited, Bajju and I would sit beside each other: She would be reading (she is never without a book), and &nbsp;I would be working on homework. Whenever she comes across a word she does not know, she immediately consults the dictionary to learn what it means. If she is not satisfied with the explanation, she consults the thesaurus. </p><p>I apply her example to personal finance. I choose a topic, research it online, and reference several sources before I am satisfied. Sometimes, it is investopedia; sometimes, it is an eBook from my university library: and sometimes, it is my favorite personal finance Instagram account, but I try to make sure I <em>really </em>understand it. The process is never complete - it is comprehensive and exhaustive. But, it is an invaluable lesson in the determination to master a topic and the ambition to succeed.</p><p>Admittedly, I may be biased. But, of all the books I have read, podcasts I have listened to, and the research I have done, I have yet to come across a better financial role model than Bajju. An 83 year old woman with a neatly pinned sari who taught me the most valuable lessons I have yet learned in managing my finances <em>and </em>conducting my life. </p><p><br></p>"
  },
  {
    "title": "COVID-19 Policy Brief",
    "date": "Oct 29, 2020",
    "year": 2020,
    "location": "Emergency Response",
    "excerpt": "the COVID-19 pandemic, the Effective Reproduction Number – Re – has been the go-to metric for most government agencies and public health officials.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed8fcb9dc8895f8d73b_624aff56b54beb46eedbeca7_Untitled%2520design%2520(42).jpeg",
    "body": "<p>By <a href=\"https://www.linkedin.com/in/ojasvinee-singh/\"><strong>OJ SINGH</strong></a></p><p>During the COVID-19 pandemic, the <a href=\"https://www.groundup.org.za/article/covid-19-making-sense-of-r/\">Effective Reproduction Number</a> – <em>Re</em> – has been the go-to metric for most government agencies and public health officials.</p><p><em>Re</em> is a metric used to gauge the <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7121794/\">transmissibility of a disease</a>; by calculating <em>Re, </em>governments can implement various intervention strategies, applying them at the degree required, to mitigate the spread of that disease.</p><p><em>Re</em> is determined by <a href=\"https://www.groundup.org.za/article/covid-19-making-sense-of-r/\">three factors</a>: how infectious the infected person is, how many susceptible people the average infector meets in a day, and how many days the infector remains infectious. </p><p>The incubation period for the virus is between <a href=\"https://www.news-medical.net/health/Coronavirus-Incubation-Period.aspx\">5-6 days</a>, however, the recommended range is <a href=\"https://www.news-medical.net/health/Coronavirus-Incubation-Period.aspx\">1-14 days</a>; this is why many protocols require quarantining for 14 days after coming in contact with an infected person. The average infection period for COVID-19 is <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7147278/\">12 days</a>, often starting a few days after symptoms appear.</p><p>So, what <em>Re</em> should policymakers aim for in order to effectively manage the pandemic? </p><p>When <em>Re</em> is greater than 1, that means that each infected person infects more than one other person; the virus <a href=\"https://www.cebm.net/covid-19/exponential-growth-what-it-is-why-it-matters-and-how-to-spot-it/\">grows exponentially</a>, and <a href=\"https://www.groundup.org.za/article/covid-19-making-sense-of-r/\"><em>Re</em> increases</a>. When <em>Re</em> is less than 1, that means that not every infected person infects someone else. </p><p>The <a href=\"https://hughmurrell.github.io/CoVmodel/Rt.pdf\">goal is to keep <em>Re</em> below 1</a> – this doesn’t signal a rapid decline in new cases, it signals that with a constant <em>Re</em> below 1, the number of cases per day will slowly decline to 0 over a period of time, as fewer and fewer people are infected. </p><p>As mitigation strategies are implemented and uplifted, and individuals interact within unprecedented environments, <em>Re</em> is constantly changing. Government agencies and public health officials should use their area’s <em>Re</em> to create plans appropriate for their specific circumstances and objectives. </p><p>Hugh Murrell and Daniel Murrell, two researchers from South Africa, relied on FinMango’s South Africa COVID-19 data to create a <a href=\"https://hughmurrell.github.io/CoVmodel/Rt.pdf\">simple algorithm to calculate <em>Re</em></a>, so those without in-depth statistical knowledge can understand data and trends in layman’s terms. They uploaded their technique on GitHub, so that anyone can personalize models and tweak parameters for their specific circumstances. To conduct the industrial-scale algorithms at a fast pace, the researchers switched from using the University of Pretoria’s data to using FinMango’s data, as FinMango was accurately publishing granular data in a timely fashion from previously unreported districts. </p><p>Using this <em>Re</em> model, policymakers should implement lockdowns, face covering policies, social distancing regulations, curfews, contact tracing, widespread testing, and whatever else is necessary to contain COVID-19. </p><p>Some governments, like those of <a href=\"https://ourworldindata.org/covid-exemplar-vietnam\">Vietnam</a> and <a href=\"https://www.nejm.org/doi/full/10.1056/NEJMc2025203\">New Zealand</a>, will choose to go into full lockdown and shut down all non-essential activity, conduct extensive contact tracing and widespread testing, and implement travel restrictions to contain the virus and keep it contained.</p><p>Other governments, like those of <a href=\"https://www.bbc.com/news/world-europe-51892477\">France</a> and <a href=\"https://www.bbc.com/news/world-europe-51892477\">Spain</a>, will initially shut down to flatten the curve, and then <a href=\"https://in.reuters.com/article/us-health-coronavirus-spain/spain-hopes-to-keep-french-border-open-as-regions-tighten-health-measures-idUSKCN24N0S1\">open back up</a>, after assembling what they believe is necessary medical infrastructure and testing protocols. Recently, both Spain and France have gone back into lockdown. Spain imposed a <a href=\"https://www.bbc.com/news/world-europe-54682222\">national curfew</a> to combat its second wave of the virus three days ago. <a href=\"https://www.bbc.com/news/world-europe-54716993\">France</a> declared a second national lockdown, as cases soared, this morning. </p><p>Whatever policymakers do, ethically, their goal must be to save as many lives as possible.</p>"
  },
  {
    "title": "Advocate Spotlight: Dr. Julie Heath",
    "date": "Nov 24, 2020",
    "year": 2020,
    "location": "Columbus, Ohio",
    "excerpt": "by Dylan WestmeyerBackgroundWho is Julie Heath you may ask? First and foremost, Julie Heath is the executive president of the Alpaugh Family economic center and is associated with...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed77d30f9fd58375b4a_624b071549818f37084f37fd_Untitled%2520design%2520(48).jpeg",
    "body": "<p>by <a href=\"https://www.linkedin.com/in/dylan-westmeyer-9ba3a51b8/\">Dylan Westmeyer</a></p><p><strong>Background</strong></p><p>Who is Julie Heath you may ask? First and foremost, Julie Heath is the executive president of the Alpaugh Family economic center and is associated with the University of Cincinnati. Secondly, she is one of the many amazing advocates at FinMango! She became intrigued by economics, but not in the normal sense. She started as a Sociology and Phycology major while minoring in math. While trying to find her calling, she decided to take a Ph.D. program where she was required to take a microeconomics class. Three days into class she fell in love with it. The chair of the economics department was teaching the class and saw the light bulb go off over her head therefore recruiting her to the Ph.D. program in economics and the rest is history. Julia became involved with FinMango after Co-founder and CEO Scott Glasgow reached out to her over LinkedIn. </p><p><strong>Education</strong></p><p>Julie stated during our interview that the most important skills in economics are curiosity and self-motivation. When one is doing research it is on the person to complete the task at hand and get it published. She also states that looking at a problem in a way that no one has before will also help in achieving goals that were believed to be out of reach. Some skills in the financial education field that would be necessary are empathy and creativity. <strong>“How can we help people who are downright afraid of the topic? How can we help people who aren’t afraid but have no idea where to look? How can we start young?”. </strong>These are all questions that Dr. Heath states that are fundamental to the furthering of financial education. She then states that financial education is not strictly a high school subject; that it should be taught from a very young age just like Math courses or English courses. Dr. Heath believes that the classes should be captivating and engaging but also have substance. She acknowledges that topics will change throughout the learning process and gives the example that one would not teach a kindergarten class how to write a check or balance a checkbook, but that the students should learn how to think critically and how to think through the costs and benefits to make a good decision. Young students should be taught the costs and benefits of borrowing. She also wishes that young students should learn about opportunity cost. Financial education should be the same as any other subject and not be seen as strictly a high school level class because no other subjects are seen in such a way why should financial education be different. </p><p><strong>Career</strong></p><p>Dr. Heath and I then spoke about the hardships that she had to go through to become a Professor of Economics and to her, one aspect stood out. Being a woman. Economics is a highly male-dominated field and for Dr. Heath, it was no easy feat to be hired. The first position she earned was at the University of Memphis and was strictly told when she was hired that it was only an affirmative action hire. She did not care though because it was a job and she states that she published more than anyone in her field, but it should not have taken so much for her to rise through the ranks. Dr. Heath believes that to integrate women into the economics field more weight should be placed on alternative ways to answer questions. She goes on to clarify that the Neo-Classical model is very mathematical. There isn’t much acceptance of describing people’s behavior or findings of the macroeconomy when there are other valid approaches. She then states that publishing is also very difficult because many publishers reject the work. People must learn to get a thicker skin and also learn how to absorb the criticism; leading to humbling experiences. As a writer, you must be able to pivot because when you put a year and a half into your work and then it gets shot down you must be able to learn what parts to save and what parts to get rid of then move forward. </p><p><br><strong>Debt</strong></p><p>We then go on to speak about mistakes that people can make in today’s economy which are not as noticeable to the people who are not as educated in economics. She states that the main mistake is the accumulation of student debt. <strong>“We know from research that most people when they acquire debt don’t even know the terms of that debt”</strong>. She then states that it is largely due to colleges making it much easier to accept student loans than it is to deny them. Colleges make it much easier to view student aid packages and just click accept rather than going through extra steps to state that students don’t want the student loan. She then states that even when students need to take on debt they are unsure of what they need to pay, the length of time and whether it’s public or private. The mechanics of taking out debt is very confusing. Ohio ranks very high per student per capita of student debt and Dr. Heath states that this is very frustrating because though students may need to take on debt they need to do so with their eyes wide open. She states it’s so important because when students find out how much they must pay back once they graduate it stops them from spending money as non-indebted adults. These loans cause people to postpone marriage, having children, mortgages, and spending. This then leads to the economy being hurt because it runs on people spending money. Dr. Heath then states that two-thirds of the economy is run on individuals spending money and when debt gets in the way then all of us suffer and the economy doesn’t grow as it should. </p><p><strong>Advice</strong></p><p>I finally asked Dr. Heath if she had anything she would like the world to know and she states that the most important concept that she wants people to know is the concept of opportunity cost. She wishes that when people are deciding to pick option A that they are not doing options B through Z and is it worth it? She then states that people make decisions on a knee-jerk reaction and if they would just slow down and think through the implications of their choices they would make better decisions. If implications are unknown then go do research and find out what they are. Then people would make much smarter decisions. She believes that the &nbsp;Finacial meltdown of 2008 would have been much less severe if people knew the concept much better. The concept is simple but people do not use it as they should. </p><p>Dr. Julia Heath is such an amazing advocate (<a href=\"https://finmango.org/dr-julie-heath\">https://finmango.org/dr-julie-heath</a>) and all of us at FinMango would like to thank you for what you are doing. If you would like to become an advocate click this link <a href=\"https://finmango.org/campaign\">https://finmango.org/campaign</a> and you will be taken directly to our website. </p>"
  },
  {
    "title": "Cultivating Potential to Cultivate Potential- How FinMango Changed my View of Finance",
    "date": "Nov 01, 2020",
    "year": 2020,
    "location": "Emergency Response",
    "excerpt": "by Ahana SamatFor a long time, I envisioned the financial services industry as an endless re-run of “The Wolf of Wall Street.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed87d30f925f3375b78_624affb8d6d44eb68d6e4c37_Untitled%2520design%2520(43).jpeg",
    "body": "<p>by <a href=\"https://www.linkedin.com/in/ahanasamat/\">Ahana Samat</a></p><p>For a long time, I envisioned the financial services industry as an endless re-run of “The Wolf of Wall Street.” Finance seemed so ruthless, competitive, and masculine. As a woman, I assumed that I could hold a very small place in it. This was despite the fact that I was raised by encouraging parents who owned a small scale business, and family dinners often included asking for my opinion about their work.</p><p>Being fairly middle class, finance played a significant role in my life. It became even more important when I looked for scholarships to attend a university in the United States and calculated the expenses of studying abroad. My life revolved around finance yet I claimed I would have nothing to do with it. </p><p>In college, I quickly changed my major to Economics. I had no particular rationale for doing this apart from the fact that I enjoyed the subject. But finance was a world apart. So, when I came across the FinMango page on my Instagram, I was surprised. I knew immediately that FinMango was doing important work in promoting personal and economic freedom via financial literacy. They were making people independent and self-sufficient- what could be better? This inspired me when I thought the world of finance had little humanity to offer.</p><p>Soon after, I took a leap of faith. I messaged the founder and CEO of FinMango, Scott Glasgow, on Instagram asking if his organization had any volunteer opportunities available for a college student with no experience and an interest, that after months of denial, had revealed itself.</p><p>FinMango took me on after we messaged<strong>. </strong>After two weeks of being a “Mango”, I was already in charge of conducting a panel at our grand “EXTRAVAGANZA” event, a 24-hour free Zoom call, where people from all walks of life were united in one mission – to promote financial literacy. Specifically, I conducted a panel discussion on the importance of financial literacy for women in the world of business. As I prepared for the panel, I felt a bit like an imposter. I used to view finance as a very male-dominated field, but here I was, talking to women pioneers in venture capital, risk management, and corporate law. My belief that finance was a place that I didn't belong was shattered<strong>. </strong>I wasn't disappointed to be wrong.</p><p>A topic that came up in the panel was the low number of women represented in the financial services industry and the relative invisibility of those who were. We also talked a lot about confidence. This struck me on a very personal level. Despite successfully navigating a very quantitative- heavy major, I didn’t feel confident in my abilities to handle finance or numbers. In this panel<strong>, </strong>as well as conversations I have had with my peers, there is agreement that women are socialized into being nice and modest, often at the expense of their confidence. The lack of this quality can infiltrate our careers and the way we view finance. </p><img alt=\"unnamed.png\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed87d30f9187c375b7a_624affc330ba02db13f76bc9_unnamed.png\"><p>Developing this innate confidence also depends on the community one is surrounded by. At FinMango, I have been given opportunities that strengthened my belief in my ability to make a change. One prominent example of this is the Google collaboration, an open source data project designed to collect information about the COVID-19 pandemic. I worked with a team that supported my outlook and encouraged my leadership in a world that often tells women otherwise. Additionally, the internal training opportunities for volunteers have led me to meet some of the most fascinating leaders in fields of marketing and corporate law, who have mentored me and shared their knowledge, skills, and external resources to help me succeed in the business world. To say I am one of the lucky few is an understatement. </p><p>Women are underrepresented in the financial services industry, are <a href=\"https://www.annuity.org/financial-literacy/women/#:~:text=Women%20are%20three%20times%20as,lower%20rates%20of%20financial%20literacy.&text=Generally%20speaking%2C%20women%20earn%20less,same%20living%20expenses%20men%20pay\">less likely to be financially literate</a>, yet, according to an article by <a href=\"https://www.economist.com/graphic-detail/2018/03/08/womens-wealth-is-rising\">The Economist</a>, women were expected to control $72 trillion of the world’s wealth by 2020, as estimated in 2015. The number of women represented in the financial services industry is growing, as companies promise equal representation. But it shouldn’t stop there – the goal is to ensure equity through visibility. Women should not just have a seat at the table; their voice and professional opinions should be accorded equal legitimacy as their male peers. Workforces should encourage the confidence of women, rather than subscribing to archaic societal norms of meekness. </p><p>The FinMango community, the resources it has provided me with, and my personal experiences convince me that I can help drive change. By building my confidence and providing me with endless opportunities, FinMango has changed the way I view finance, my place in it as a woman, and has shown me what I can do to help those who come after me. It has inspired me to follow my passion of increasing financial literacy among women and making the financial services industry more representative. But equality- true equality- can only exist when it is not limited to pockets and available to a “lucky few” but is an indisputable fact of life for all. I believe that financial literacy can aid in this goal. </p>"
  },
  {
    "title": "Carolyn Cooper: from Silicon Valley to the Classroom",
    "date": "Dec 01, 2020",
    "year": 2020,
    "location": "Emergency Response",
    "excerpt": "by Erinn HeffesCarolyn Cooper is a Certified Public Accountant, a Financial Educator and a Coach with professional experience and a passion for creating productive lives that...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed8a7f8b7682a10a430_624b08ed3596ceb0b2b961fd_Untitled%2520design%2520(49).jpeg",
    "body": "<p>by <a href=\"https://www.linkedin.com/in/erinn-heffes-88bb8415a/\">Erinn Heffes</a></p><p>Carolyn Cooper is a Certified Public Accountant, a Financial Educator and a Coach with professional experience and a passion for creating productive lives that inspire growth and independence in young people.She immigrated to San Jose, California from Kuwait when she was 13 years old. A major reason for this move was to afford her the opportunity of an education because opportunities for women were limited in Kuwait at that time. Despite taking an accounting class in high school and thoroughly enjoying it, she realized that she was not taught personal finance. While attending UC Santa Barbara, Cooper studied Business Economics with an emphasis in Accounting. She took part in a class that introduced a sliver of consumer economics; living on your own, creating a budget, renting an apartment, buying a car etc. Asides from this class, most of Cooper’s finance knowledge was self-taught. She came across a radio station that discussed personal finance and investing and through simply listening to this station while driving back and forth from school, Cooper educated herself on personal finance. Cooper eventually ended up pursuing a career in Public Accounting and as soon as she got her first job, she invested in a 401k plan and opened up her IRA account at the same time.</p><p>When her daughters were growing up, she observed that they were not being taught anything on finance and Cooper says she observed that many of the classes she took on personal finance no longer existed. Cooper believed that this was a necessary class her daughters should be taking and a topic they needed to be educated on. Cooper shared an entry with me from 2013 from her journal, while attending a “back to school night” for her daughters where parents were being informed on specific content and aspects. In her journal Cooper wrote about an ‘aha’ moment she had on personal finance and wondered why they were not educating young individuals on personal finance from high school. Cooper, realizing that most of her financial knowledge was self-taught and that not only her daughters but her friends, employees and peers did not have the necessary financial knowledge they actually needed and was available, Cooper realized there was a serious need that had to be fulfilled. &nbsp;Cooper had a successful career in Silicon Valley and was able to save and invest with her husband for years. This allowed her the ability to stop working and rekindle her passion for teaching and educating others, specifically on financial literacy. </p><img alt=\"Teaching on Zoom.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed8a7f8b7359110a431_624b08ef2379f3694dbe133f_Teaching%252Bon%252BZoom.jpeg\"><p>Throughout her research, Cooper came across <a href=\"https://www.ngpf.org/\">Next Gen Personal Finance</a> and began taking classes with them. She began teaching before the COVID-19 pandemic and like many she did now allow her plan and passion to be derailed and she has continued teaching via Zoom classes. Cooper says that, “It isn’t a job… it’s a dream. THE dream job” If there was one thing that Cooper wishes someone told her when she was younger, it is the importance of honing your soft skills; being more open, volunteering, public speaking and simply putting yourself out there. Cooper incorporates these skills from early in her classes so that students are prepared for when their professional careers develop. Asides from public speaking and networking, Cooper believes that one major skill that is necessary in this area is behavioral finance and practicing living within your means. Cooper says, “It is not just the actual skills of literally here is a spreadsheet and you start filling it out…there is a lot of behavioral finance that goes into it.” There is more to finance than dollars and cents and Cooper wants to help people to understand this. While behavioral finance is a major skill Cooper believes needs to be pushed, she also believes this is the major issue in terms of financial literacy. The notion of not really understanding what it is and not having these foundational skills. </p><p>Cooper says that we would never give a 16 year old the keys to a car without the proper driving certifications, so why would we give them the keys to everything as soon as they turn 18, with no training. At the age of 18, one can open a bank account, sign up for credit cards etc. all on their own, yet they frequently lack the education to support these processes properly. She says that COVID has created great awareness and there is now a momentum and everyone simply has to do their share. Cooper is extremely passionate about this issue and providing access to this knowledge to all. As a result, Cooper’s classes are not necessarily non-profit nor are they ‘for business.’ She does charge for some classes, but believes this helps to build accountability and attendance. Cooper does offer some classes for free and waives fees. She really wants to teach and for it to be affordable. She wants everyone to have that access and believes the earlier they have this access the better.</p><p>Carolyn is an incredible advocate (<a href=\"https://finmango.org/carolyn-cooper\">Advocate Profile</a>) and all of us at FinMango would like to thank you for what you are doing. Click this link if you want to become a FinMango advocate: <a href=\"https://finmango.org/campaign\">https://finmango.org/campaign</a>.</p>"
  },
  {
    "title": "Flight of the Purple Martins: FinMango’s Story",
    "date": "Nov 05, 2020",
    "year": 2020,
    "location": "Columbus, Ohio",
    "excerpt": "As told by Jon LiA summer in Suburban Ohio.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb3857e49936f28d9a_624b00c4cc8aaa43ed0193a1_Untitled%2520design%2520(44).jpeg",
    "body": "<p>As told by <a href=\"https://www.linkedin.com/in/jon-li-52a70bb8/\">Jon Li</a></p><p>A summer in Suburban Ohio. What do you think of? If you’re not from these parts, I’m guessing you’re thinking of endless rows of corn basking in steady heat and backyard bonfires fueled by Budlight and Swenson’s. If you are from here… you’re probably thinking that my description is pretty accurate. And while Ohio does in fact offer an abundance of Midwest charm it also marks the beginning of my journey with FinMango. </p><p>Looking past the dullness of where I come from, a pristine reservoir called Nimisila teeters on the border of Stark County and Summit County. To me, Nimisila served many purposes throughout the years. In high school, my friends and I would come here and &nbsp;be degenerates. The summer after I graduated, I’d run on the splatter of trails next to Nim to soothe myself and marinate &nbsp;in my thoughts. Then came summer 2016 - my first summer home from college. <a href=\"https://finmango.org/meet-the-founder\">Scott</a> started inviting me to kayak on the reservoir. At that time, I thought nothing more of it, he was a workout friend who I’d played tennis with since high school. &nbsp;</p><p>As the summer progressed, our conversations while paddling around on the kayaks kept turning towards this idea he had for a nonprofit called FinMango - a foundation that would &nbsp;address the inequitable access to financial literacy throughout the world. Well, I figured, “Why the hell not?” I quickly jumped aboard this opportunity to give back to the community at large by starting something of my own. On a smaller but just as meaningful scale, &nbsp;I had started a STEAM nonprofit in high school that reached hundreds of students. That experience made the idea of helping thousands, if not hundreds of thousands or even millions of people a lot more fathomable.</p><p>This simple burning desire to create and volunteer led to many sunburnt afternoons spent discussing the concept on Nim. Somehow, these kayaks turned out to be the first boardroom, and the beating sun was our Zoom background before Zoom was even mainstream. Early phone calls made by Scott and I often came while we were on the water. Somehow, we’d have to figure out how to make sense of the ideas that floated across the (nonexistent) waves. Like the sky above us during those times, there truly wasn’t a limit.</p><img alt=\"IMG-5039-Original.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb3857e4eec3f28d9b_624b00d15d2e2fadbc059f53_IMG-5039-Original.jpeg\"><p>Fast forward to September, 2020. We’re in the middle of a pandemic and consequently, I had spent my first summer home since the one in &nbsp;2016. Scott and I are again kayaking on Nimisila. As we’re paddling into the middle of the reservoir, we wonder why so many people are in the water and what dozens of spectators had anxiously put up lawn chairs to witness. What Scott and I were about to witness is a perfect, but admittingly cheesy, analogy to where FinMango has progressed since its inception 4 years prior. </p><p>The purple martins emerged from the horizon. They came in black streaks all while somehow creating a harmonious cacophony. Seemingly endless waves kept gliding past us in disjointed patterns until they would suddenly create a beautifully symmetric vortex. To us, their flight trajectories seemed to make no sense, until it did. Again and again, the smattering of birds across the sky would collect more of their brethren and then orchestrate symphonic tornados. The finale was the last vortex of birds, perfectly choreographed and synchronized. The great fall migration had begun. </p><p>Much like the purple martins, FinMango came from a conglomeration of ideas. Waves of fresh inspiration came from journals, conferences, and long conversations. Thousands of hours of work had been put into a variety of different projects by hundreds of volunteers, forming these successful vortexes that validated the original concept. But, we’re now at an inflection point. I know we’re at the same stage as the last vortex of the purple martins, where everything is now coming together. We always had this grandiose vision, but as an organization, we now understand <em>how</em> we’re going to fly onto the big stage and <em>what</em> we need to get there. Through calculated miracles, we’ve managed to make sense of the beautiful cacophony (by separating our work into 3 pillars: Data, Tech, and Advocacy), and now we’re ready to migrate. </p>"
  },
  {
    "title": "Fruits From The Mango Tree",
    "date": "Nov 16, 2020",
    "year": 2020,
    "location": "Emergency Response",
    "excerpt": "by Bruna ChíxaroIt's only been a few months since I was invited to join FinMango, a global financial inclusion nonprofit, as a volunteer team member to work on the COVID-19 Open...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb5acfc4588163e9c8_624b0319ce81d16bcf0442a2_Untitled%2520design%2520(47).jpeg",
    "body": "<p>by <a href=\"https://www.linkedin.com/in/bruna-ch%C3%ADxaro-37a98a105/\">Bruna Chíxaro</a></p><p>It's only been a few months since I was invited to join FinMango, a global financial inclusion nonprofit, as a volunteer team member to work on the COVID-19 Open Data Project. However, it’s been enough time to learn a great deal about dedication, teamwork, healthy leadership behavior, and, most important of all, empathy.</p><p>I have been observing each team member, internally known as “Mango,” and their particular skills. From day one, I have been amazed by their individual abilities, that when combined together as a team, allow them to unite people together around a common goal, and bring out the best in one another. Our group is a great example of people who have not lost empathy for others, during these difficult times of the pandemic. After all, this has been a difficult year for all people, as the COVID-19 has left no country untouched. </p><p>I believe the current pandemic has instilled in the Mangoes the importance of practicing kindness, not only toward others, but also themselves. The volunteer team has shown the whole world the important role that financial literacy plays in the life of every individual. Not only have the repercussions of COVID-19 created a public health crisis, they have also indicated that the lack of financial education can contribute to greater social issues.</p><p>Two years ago, I came across FinMango on Instagram; I was in my first year of specializing in Human Rights and International Law, and started following the nonprofit to learn more about the important aspects of financial education for the global community. Since then, I have observed how passionate and determined FinMango is in pursuing their mission of ending the problem of financial exclusion by integrating values like compassion, empathy and cooperation.</p><p>Beyond the pandemic, it is important to reflect upon the current global economic model which is based on uninterrupted growth, waste, and unsustainable consumerism. Specifically, this pandemic calls on every person to rethink with solidarity about the possibilities for sustainable life globally, and to participate in building a more cooperative, and empathic society. It is crucial that each person tries to the best of their ability, to put empathy into action throughout the world. </p><p>In this aspect, each Mango, in their particular way, has been a true role model for me, and I am truly grateful for that.</p>"
  },
  {
    "title": "How Passion Creates a Domino Effect: The Role of Interpersonal Uplifting in the FinLit World",
    "date": "Oct 27, 2020",
    "year": 2020,
    "location": "Nairobi, Kenya",
    "excerpt": "My name is Anthony Schilt, volunteer lead of public relations and communications at FinMango, a non-profit organization whose goal is to solve the problem of global income...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edc70b6a9da64823c95_624afe7faee621d7a775e73e_Untitled%2520design%2520(41).jpeg",
    "body": "<p>My name is <a href=\"https://www.linkedin.com/in/anthony-schilt\">Anthony Schilt</a>, volunteer lead of public relations and communications at <a href=\"http://finmango.org/\">FinMango</a>, a non-profit organization whose goal is to solve the problem of global income inequality through financial literacy. FinMango has a unique and riveting start-up story. Focusing on data, technology, and advocacy to solve the problem of financial exclusion, we help others realize their true potential by igniting a world of opportunity. </p><p>Instead of talking about these key components in depth, – and how important each of them are, this blog will bring into focus what makes FinMango’s volunteers, internally known as “mangos,” so creative and passionate. &nbsp;</p><p>My journey with FinMango began in December 2019. One day in early December, I was casually scrolling through LinkedIn. I only had five connections (most of whom were family members), no practical experience related to my studies, and a lack of understanding for what career I wanted to pursue. I was looking at other people’s profiles, jealous of what I saw, until a certain brand caught my eye. The person I was stalking on LinkedIn was involved in FinMango. </p><p><em>Have I heard about this somewhere before? </em>After looking into FinMango’s page on LinkedIn, I knew almost immediately that I might have found “it.” I loved the cause, and was majoring in Finance; these two ‘pros’ were good enough for me. I was a freshman trying to build up my resume after all. So, I reached out to this person, scheduled a one-on-one, and planned to meet with them later that same day for an interview. </p><p>On my way there, I was trembling; my hands were sweating and I was anxious about how I’d perform. I was, as they say, a hot mess. Ultimately, my nerves settled down due to my interviewer’s energetic persona. I admired his passion. He was a fellow student at OSU. I would later come to find out that this virtue – being passionate – was the foundation that FinMango thrived on.</p><p>Although I was noticeably nervous, he saw past that, and asked about my strengths and abilities. This meant a lot to me. It signaled the nurturing and supportive environment that fuels creativity inside our organization. After the interview, I was told that I would hear back soon from one of the leaders. Soon after, I had the opportunity to speak over the phone with Scott Glasgow, the Founder and Chief Executive Officer of FinMango.</p><img alt=\"DSC_0069.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edc70b6a90853823cb3_624afeabcc8aaa68d80187c2_DSC_0069.jpeg\"><p>When <a href=\"https://www.linkedin.com/in/sglasgow/\">Scott</a> initially contacted me via text, I smiled. It was almost 2:00 A.M.; he was a night owl, just like me. Scott explained to me how he and the other night owls at FinMango are constantly communicating, working on progressive initiatives, or brainstorming about the next big thing. I knew that I would be one of them. <em>I don’t know. It’s just something about the nighttime that gets me motivated to work. If that’s how the CEO operates, maybe I’m doing something right. </em></p><p>We had spoken together over the phone that night, and just before we ended the call, I noticed that it had lasted over an hour. I was blown away; it felt like 15 minutes. At half-past, 3:00 AM, I was standing in front of the mirror with the biggest smile on my face I’ve had in awhile.<em> I told myself not to get too excited, though, since I wasn’t officially a part of this just yet.</em></p><p>In the following days, Scott introduced me to <a href=\"https://www.linkedin.com/in/gemma-bosch-martinez/\">Gemma Bosch Martinez</a>, FinMango’s Chief Knowledge Officer. Gemma lives in Spain, a country I have always wanted to travel to, so I was ecstatic to speak with her about her experiences there. I love learning about Spanish language and culture, so having this global connection with someone immersed in the culture was really cool. </p><p>One of my greatest “FinMemories,” in fact, was when I spoke with Gemma for the first time, and I found out that I wasn’t as good as I thought I was at conversational Spanish. It was hilarious, and a great learning experience. It was the small, seemingly insignificant moments like these that made the greatest memories at FinMango. Meeting all of these amazing leaders, students and bosses alike, combined with the opportunity to make an impact in the world, left me with profuse excitement. I was ready to get started.</p><img alt=\"IMG_2181.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edc70b6a90c2b823cb0_624afeac2e690048f74ea29e_IMG_2181.jpeg\"><p><strong>Getting started:</strong></p><p>I began working on my very first project, a collaboration with <a href=\"https://www.kubuka.org/volunteering-in-kenya-2017/\">KUBUKA</a>, an organization focused on developing vulnerable communities in Kenya and Zambia. After reading my instructions from Gemma, I had a feeling that this “getting-started project” wasn’t exactly about getting started. Instead, it was about providing a positive economic impact right away. I got a feel for the work I would be doing beforehand, and appreciated that greatly. I was intimidated, but I was more so eager to learn, and that eagerness overtook the intimidation I felt. </p><p><em>So, what was my task? </em>— To co-create an educational presentation tool (with resources) that would take place over three weeks. The program taught 100 children and adults about Financial Literacy and Entrepreneurship. <em>Wow. </em></p><p>While I worked on the project, I struggled, as I expected, but I asked questions and was able to overcome those struggles. Since many projects fail at non-profit organizations, I was congratulated for having a successful first project — something not many mangos have the opportunity to experience. </p><p>I was overjoyed to receive such feedback on my work. The team was impressed with the content I produced, and the program was implemented in Zambia later that month (pictured below). This accomplishment spurred self-confidence that I had been lacking, and helped me understand how I can combat my depression and anxiety by helping others and making an impact.</p><img alt=\"EQ6OBEqX0AIGsxo.jpeg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edc70b6a9e0d0823cb1_624afeac84d7a6cf0259e054_EQ6OBEqX0AIGsxo.jpeg\"><p><strong>Operation Extravaganza:</strong></p><p>I was promoted to “Creative Marketing Intern” after this project. The first initiative I took part in during my internship – <a href=\"https://finmango.org/extravaganza\">The FinMango Extravaganza</a> – became an integral part of FinMango’s story. The Extravaganza, hosted virtually in May 2020, was a 24-hour live webinar that took place over Zoom, and featured 50+ successful keynote speakers. I was co-coordinator of technology for the event, alongside <a href=\"https://www.linkedin.com/in/uday-patel-100b13178/\">Uday Patel</a> and <a href=\"https://www.linkedin.com/in/kishan-patel-k/\">Kishan Patel</a>. For the first 12 hours, covering the United States, Uday, Kishan, and I hosted the webinar nonstop. <em>But nothing great lasts forever, right? </em></p><img alt=\"Screen Shot 2020-10-27 at 4.28.01 AM.png\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edc70b6a912b0823caf_624afeabaf333f051698875c_Screen%252BShot%252B2020-10-27%252Bat%252B4.28.01%252BAM.png\"><p>When logistical problems arose, &nbsp;our team had to combat them efficiently—failure was simply not an option. One of our issues was actually having too many people, as ironic as that sounds. A celebrity, who will remain unnamed, posted our event link, which led to an overwhelming influx of Zoom viewers. When hundreds of people joined, they saw our CEO speaking. In a matter of seconds, everyone changed their name to “Scott Glasgow,” or “Scott Glasgow #2, or #3” &nbsp;and so on, which was quite funny for onlookers, but a disaster for the three of us manning technology! Once we figured out the technical issues, however, we had a smooth rhythm. <em>Of course, we still had our laughs at the hundreds of Scott Glasgows joining our webinar. </em></p><p>It would be impudent not to highlight how the logistics were pulled-off; I want to underscore the intricate efforts of two mangos in particular: <a href=\"https://www.linkedin.com/in/uday-patel-100b13178/\">Uday Patel</a>, a sophomore at The Ohio State University studying information systems management, and <a href=\"https://www.linkedin.com/in/kishan-patel-k/\">Kishan Patel</a>, a junior at The Ohio State University studying Finance.</p><p>I was lucky enough to play the role for Uday that Ben, my interviewer for FinMango, played for me. In late February of 2020, I had a conversation with Uday about FinMango’s mission and why he should be excited. After our conversation, he had a similar realization — he immediately saw the intrinsic value of being a “mango.” Two weeks later, Uday spoke with Kishan Patel about FinMango and its goals. Kishan became a marketing and technology intern in early April. <em>And so starts the ultra critical uplifting domino-effect.</em></p><p>Extravaganza was launched the month after Uday and Kishan were onboarded. They adapted to a mammoth challenge immediately, learning along the way to overcome every obstacle we faced! The FinMango leadership was in awe of our accomplishments. What was significant about this experience, though, was that I had unknowingly found my niche, as did Uday and Kishan. Personally, I found out how rewarding it was to build a team, communicate, and uplift in a way that led us all to success. Uday and Kishan found that they wanted to pursue technology and data-focused volunteering, which they have made tremendous strides in: they learned the logistics of <a href=\"http://cloud.google.com/\">Google Cloud</a>, <a href=\"https://datastudio.google.com/\">Google Data Studio</a>, and <a href=\"https://www.tableau.com/\">Tableau</a>, while simultaneously inputting data for the K-12 covid data initiative within FinMango’s <a href=\"https://finmango.org/data\">Data Project</a>. Now, like me, Uday and Kishan are “<a href=\"https://finmango.org/team\">mango fellows</a>,” a status given to those who demonstrate proven commitment to FinMango and its cause over time. </p><p>Once Extravaganza was over, the weight of the moment hit; our leaders shed tears. A group of student mangos pulled off something this great with one secret weapon – passion. </p><p>Our team mapped out this idea, planned accordingly, assembled a group of over 50 professionals and keynote speakers, and accidentally broke the world record for the world’s longest Zoom call. Little did we know that the Extravaganza event set the stage for everything FinMango will accomplish later on. It also subconsciously worked wonders for everyone’s personal and professional development. </p><img alt=\"IMG_7196.jpeg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edc70b6a97c1e823cb4_624afeac7fdc2d977a87c149_IMG_7196.jpeg\"><p><strong>How we “mango” during the pandemic:</strong></p><p>The COVID-19 pandemic has impacted the lives of billions around the globe. Just about everyone has been affected by the virus in one way or another. It breaks my heart to think about the lives lost and impacted, and I wish the best to those affected by the virus in health, financially, or otherwise.</p><p>Instead of standing idly by on the sidelines, we knew we had to do something. FinMango made the humanitarian cause surrounding COVID-19 a short-term priority alongside our long-term goal of diminishing financial exclusion. When we launched the FinMango Data Project, I didn’t know what to expect. I was nervous. However, Now was the time to make an impact on real people, as real lives are at stake. This urgency keeps our mangos sharp and focused when they conduct this work.</p><p>Two main initiatives are at the heart of FinMango’s Data Project:</p><ol><li>FinMango’s contributions to the <a href=\"https://github.com/GoogleCloudPlatform/covid-19-open-data\">Google COVID-19 Open Data Project</a></li><li>“thecovidmonitor.com” – Researching COVID-19 outbreaks data in K-12 schools across the United States, and providing real-time accurate reporting and transparency</li></ol><p>I took charge of managing social media for @TheCOVIDMonitor on Twitter and Instagram; a seemingly easy task. I have the pleasure of reading through countless tweets, replies and comments from people looking for a rise out of FinMango. I have even received some questionable direct messages on my personal accounts. <em>I actually love everything about this; at FinMango, haters are, in fact, our motivators.</em></p><img alt=\"Untitled+design.png\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edc70b6a9fa50823cae_624afeacaf427fd8d9fb2da1_Untitled%25252Bdesign.png\"><p>Alongside my responsibilities for our Data Project, I was responsible for all applicant hiring. I am especially careful when seeking out potential mangos. I ensure they (1) are genuinely interested, (2) understand our mission and why it is an issue, and (3) are likely to positively contribute to our greater cause. Many students ask me about FinMango so they can put it on their resume; the fact of the matter is, at FinMango, we don’t make room for those who don’t make room for us. <em>Oh, and we also don’t make room for those who don’t wear masks and practice social distancing.</em></p><p>Over the Fall, I sought to speak to other students on campus at the Ohio State University about both the COVID pandemic and financial exclusion crisis. I found my passion for our mission almost one year ago, and maybe that’s why I have the ability to get others to FinMango like I do. Being immersed in such a supportive, progressive environment at FinMango has only benefited me positively. </p><p>So, from mid-August to the end of October, I have been successful in seeking out, interviewing and onboarding five outstanding new mangoes. These talented individuals include: (1) <a href=\"https://www.linkedin.com/in/kevin-dsouza7/\">Kevin D’Souza</a>, who is naturally attentive to detail and always performs beyond expectations. (2) <a href=\"https://www.linkedin.com/in/bryce-chappelear-a191511b7/\">Bryce Chappelear</a>, who input essential K-12 covid data at the last-minute per our CEO’s request and successfully saved the day. (3) <a href=\"https://www.linkedin.com/in/esha-sharma-b08524171/\">Esha Sharma</a>, who has an innate ability to multitask, pioneering FinMango’s first ever internally produced merchandise collection. (4) <a href=\"https://www.linkedin.com/in/dylan-forman-0b65751a3/\">Dylan Forman</a> and (5) <a href=\"https://www.linkedin.com/in/sam-holtzapple-0719521b8/\">Sam Holtzapple</a>, who have only been involved for a few weeks’ time, have already collaborated with me in producing several videos that have been published since on our website. I could not have been happier with these wonderful mangos, who have also come to be some of my best friends.</p><img alt=\"Screen Shot 2020-10-27 at 4.34.11 AM.png\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edc70b6a98281823cb2_624afeacf2caaa7fd1cf07ef_Screen%252BShot%252B2020-10-27%252Bat%252B4.34.11%252BAM.png\"><p>October 27, 2020</p>"
  },
  {
    "title": "Here is why full-grown adults, who should know better, are opening schools, and why that sucks",
    "date": "Oct 17, 2020",
    "year": 2020,
    "location": "Emergency Response",
    "excerpt": "coronavirus pandemic has had a seismic impact on every aspect of our lives.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edc7d30f9cabd375bca_624afc4560fbd3934fbdd4a0_Untitled%2520design%2520(39).jpeg",
    "body": "<p>By <a href=\"https://www.linkedin.com/in/ojasvinee-singh/\"><strong>OJ SINGH</strong></a></p><p>The coronavirus pandemic has had a seismic impact on every aspect of our lives. From frequenting gyms and restaurants, to attending social events with friends and family; events we once took for granted have revealed themselves to be privileges.</p><p>A wide range of industries have been impacted during the pandemic, and now institutions of higher education, and the environments surrounding them, face a unique intersection of <a href=\"https://www.timeshighereducation.com/hub/keystone-academic-solutions/p/impact-coronavirus-higher-education\">challenges</a>. </p><p>Universities and colleges are massive social hubs &nbsp;where &nbsp;students come together from around the world to engage in educational and social activities that heavily influence their character development. College towns, communities built around institutions of higher education that support countless university members and affiliates, are <a href=\"https://www.cbsnews.com/video/local-businesses-in-college-towns-suffering-from-coronavirus-restrictions-on-sports/\">financially suffering</a> along with the academic institutions they support. </p><p>College students, typically between 18-23 years of age, have a lower mortality rate from COVID-19, but are very likely to <a href=\"https://www.cdc.gov/mmwr/volumes/69/wr/mm6939e1.htm\">asymptotically transmit</a> the virus to more vulnerable populations, like older university staff and professors, immunocompromised students, and many other people in the broader campus bubble. The attached <a href=\"https://www.nytimes.com/interactive/2020/us/covid-college-cases-tracker.html\"><em>New York Times</em> map</a> visually represents the extent of community spread in college campuses around the United States. </p><p>The data below shows estimated active cases in Alachua County, Florida, home of the University of Florida, which has a student body of around <a href=\"https://ir.aa.ufl.edu/uffacts/enrollment-1/\">60,000 students</a> as of 2019. </p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edc7d30f942f3375bd4_624afc7d3302e96ffae3c369_Image_20201018_022550.jpeg\"><p>Can you guess when in-person college classes resumed?</p><p>Young people are not invincible. Even if they survive Covid, there is a high probability of sustaining <a href=\"https://www.mayoclinic.org/diseases-conditions/coronavirus/in-depth/coronavirus-long-term-effects/art-20490351#:~:text=COVID%2D19%20symptoms%20can%20sometimes,completely%20within%20a%20few%20weeks.\">permanent organ damage</a>, the full extent of which is still unknown. </p><p>The question is why are administrative personnel at institutions of higher learning , who have known since April, 2020 about both the exponential spread of the virus and the national Covid testing shortage, pushing to open campuses? </p><p>An <a href=\"https://www.nbcnews.com/news/education/crisis-looming-u-s-colleges-not-just-because-pandemic-n1235338\">NBC College Financial Health</a> report outlines before the pandemic, how universities were already financially struggling due to declining enrollment rates, and dwindling governmental budgetary support. Private institutions, some with sizable endowments, still <a href=\"https://www.air.org/system/files/downloads/report/Delta-Cost-Trends-in-College%20Spending-January-2016.pdf\">rely heavily on tuition</a>, donations, and other revenue (sponsored research, hospital wings, etc.). Losses are covered by institutional revenue and endowments, &nbsp;and are later <a href=\"https://www.nbcnews.com/news/education/crisis-looming-u-s-colleges-not-just-because-pandemic-n1235338\">recovered through increases in tuition</a> and fees. </p><p>With the possibility of another <a href=\"https://www.cnbc.com/2020/06/09/us-officially-in-a-recession-but-its-different-than-2008.html\">recession allegedly looming</a>, public institutions, largely funded by state subsidies, are anticipating budget shortfalls, and have already begun <a href=\"https://www.cnbc.com/2020/06/23/colleges-cut-programs-in-face-of-budget-shortfalls-due-to-covid-19.html\">cutting academic programs</a>. The 2017 Tax Cuts and Jobs Acts weakened government revenue retention, and further increased the <a href=\"https://www.washingtonpost.com/business/2019/10/25/us-deficit-hit-billion-marking-nearly-percent-increase-during-trump-era/\">federal deficit</a>, which was compensated for by cutting an already depleted <a href=\"https://www.washingtonpost.com/local/education/trump-seeks-to-slash-85-billion-from-education-department-budget/2019/03/11/69ab930e-441f-11e9-8aab-95b8d80a1e4f_story.html\">education budget</a>. With necessary emergency spending for unemployment benefits, small business bailouts, and increasing healthcare costs, it is unlikely that the education budget will receive a larger portion of &nbsp;government revenue when <a href=\"https://www.cbpp.org/research/state-budget-and-tax/states-grappling-with-hit-to-tax-collections\">tax revenue is projected to fall sharply</a> due to the virus. </p><p>A major reason for reopening (or at least trying to reopen) institutions of higher education seems to be financial. </p><p>Many schools, large and small, public and private, have tried one of the following strategies: online-only instruction, hybrid instruction, and in-person instruction.</p><p>In early June, <a href=\"https://www.forbes.com/sites/susanadams/2020/07/06/harvard-will-hold-all-undergraduate-classes-online-this-fall-and-invite-only-40-of-students-to-campus/#16b038e12bdd\">Harvard announced that it will be online-only</a> for the 2020-21 academic year, &nbsp;and will invite up to 40% students to live on campus. Others changed course while implementing a strategy; <a href=\"https://www.nytimes.com/2020/08/18/us/notre-dame-coronavirus.html?auth=login-email&login=email\">University of Notre Dame</a> and <a href=\"https://www.nytimes.com/2020/08/19/us/colleges-closing-covid.html\">University of North Carolina at Chapel Hill</a> closed down within two weeks of resuming in-person instruction because of clusters of infections arising from campus parties. <a href=\"https://www.freep.com/story/news/education/2020/08/18/michigan-state-university-online-classes-coronavirus-covid-19/3394429001/\">Michigan State University</a> moved to online-only instruction days before their hybrid reopening, after realizing that any in-person instruction was not feasible due to <a href=\"https://www.wsj.com/articles/covid-19-testing-is-hampered-by-shortages-of-critical-ingredient-11600772400\">lack of medical infrastructure</a> necessary to support routine testing of thousands of students &nbsp;in order to contain outbreaks.</p><p>Some schools soldiered on with in-person classes, even though infections spiked.</p><p>The University of Georgia and the University of Alabama remain committed to in-person instruction, despite over <a href=\"https://www.nytimes.com/interactive/2020/us/covid-college-cases-tracker.html\">3,500</a> and <a href=\"https://www.nytimes.com/interactive/2020/us/covid-college-cases-tracker.html\">2,500 students testing positive</a> respectively for the virus. Georgia Tech students <a href=\"https://www.11alive.com/article/news/health/coronavirus/georgia-tech-ra-quits-over-covid-19-safety-concerns-as-college-classes-resume/85-11f3924f-5006-4fab-a809-a7fc8d2bd68a\">staged a “die-in”</a> on the first day of class to protest the university’s safety standards. </p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edc7d30f90556375bd3_624afc9d5d4c5d1db25629b1_Image_20201018_022600.jpeg\"><p>The Southeastern Conference (SEC) and other conferences are allowing &nbsp;<a href=\"https://www.thestate.com/sports/college/acc/clemson-university/article245351535.html\">tens of thousands of fans</a> into football stadiums, where guidelines for social distancing and face covering are <a href=\"https://www.usatoday.com/story/sports/ncaaf/2020/10/15/college-football-unmasked-fans-stadiums-covid/5975775002/\">not strictly enforced</a>. It is important to note that athletic revenue is a multifaceted &nbsp;benefit for schools. When athletic teams perform well, <a href=\"https://www.washingtonpost.com/graphics/2018/sports/ncaa-applicants/\">student applications rise</a>, and <a href=\"https://www.vox.com/conversations/2017/9/5/16180862/college-football-ncaa-student-athlete-mike-mcintire\">everyone makes millions</a>, except for the athletes themselves..</p><p>One may ask, what is the “net gain”? Is it time to rethink for-profit only higher education? If institutions of higher learning have been aware of the risk of bringing students back, but have been allowing preventable negative ramifications to occur by holding in-person classes to justify charging the same rate of tuition anyways, clearly, the purpose of offering a higher education has been lost a while ago. </p><p>It is one thing to say that we have to live with the virus until there is a vaccine, but it is not ethical &nbsp;to disregard common sense precautions and create an environment that easily allows the virus to spread.</p><p>University administrators with collective decades of experience in higher education, are shifting blame for infection clusters onto 18-23 year old students for partying, when adults with immense life experience, who are culpable for bringing students back, should simply know better. This does not absolve students of responsibility, and those who break rules should be disciplined. However, administrators cannot expect to invite socially-starved students back to school, believing that all students will comply with the rules, and that there will be no unintended consequences, not fully grasping the fact it only takes one person to start an outbreak.</p><p>The fallacy of sunk cost, a cost that has already been incurred and is unable to be recovered, employed by administrators of institutions of higher learning is harming &nbsp;thousands of college &nbsp;students each day. The United States is likely entering its <a href=\"https://thehill.com/changing-america/well-being/medical-advances/521448-us-covid-19-cases-are-climbing-to-a-third-peak\">third peak of the first wave</a> of infections. &nbsp;Over <a href=\"https://www.worldometers.info/coronavirus/country/us/\">220,000 people are dead</a>, and many who survive face <a href=\"https://www.vox.com/2020/5/8/21251899/coronavirus-long-term-effects-symptoms\">long-term health complications</a>. &nbsp;</p><p>I hate writing about the pandemic in economic terms. To me, the simple fact that people are dying is sufficient for change. In exchange for short-term “gains,” decision-makers are creating environments that will allow several negative health effects to occur among the population, that will prolong the current crisis: the potential for a permanently incapacitated labor force, lack of hospital beds for the severely ill, and unending negative economic impact, due to consistent high positivity rates of Covid that will continue to keep multiple industries closed or operating at low capacity, without a plan for long-term recovery in sight.</p><p>There is no net gain. However, that does not mean that we choose the road that leads to the most negative consequences.</p><p><br></p>"
  },
  {
    "title": "How the Pandemic Inspires Me to Build Resilience Around the World",
    "date": "Oct 22, 2020",
    "year": 2020,
    "location": "Emergency Response",
    "excerpt": "There’s something that happens when adversity strikes that changes the way you look at life.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edcfcb9dc8030f8d7d6_624afd39f821604e36836351_Untitled%2520design%2520(40).jpeg",
    "body": "<p>By <a href=\"https://www.linkedin.com/in/sglasgow/\" target=\"_blank\">Scott Glasgow</a> </p><p>There’s something that happens when adversity strikes that changes the way you look at life. This year, I was lucky enough to overcome that adversity with resilience—the ability to absorb, adapt, and transform. </p><p>It’s crazy to think about how different things were just a few months ago. I was working 80+ hours a week, jumping on flights to speak around the world, and not understanding the concept of work-life balance. FinMango had little focus and I was struggling to keep it all together. </p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edcfcb9dcb7f3f8d7d7_624afd6ef2caaa72b0cefab0_IMG-7423.jpeg\"><p>But today, I got to look back on a year of wins, losses and learning and take comfort in the fact that we didn’t ever run out of money, and we did manage to mostly keep it all together. And thanks to a few lucky breaks—like smashing a world record, launching a collaboration with Google, and gaining national media coverage—we’re now focused and jumping into an incredible future.</p><p>With the year quickly coming to a close, I’m motivated to work harder than ever to solve the financial exclusion problem. FinMango can now be defined by three words: <a href=\"https://finmango.org/data\">Data</a>, <a href=\"https://finmango.org/tech\">Tech</a>, and <a href=\"https://finmango.org/campaign\">Advocacy</a>. You can read more about the pivot <a href=\"https://finmango.org/blogs/2020/10/14/master-plan-part-deux\">here</a>.</p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edcfcb9dc36aef8d7d9_624afd8dc31d277ecc92cedc_IMG_0396.jpeg\"><p>While I’m grateful for how radically different my life has changed during the pandemic compared to the average person, recognizing this is a reminder of how important it is to use the privilege and opportunities we are given to help those around us.</p><p>At FinMango, all we do is give. We give people the opportunity to influence the world, to work on projects that save lives, and be a part of something bigger. Much bigger. </p><p>And in our lives, we’re only given so many opportunities to do things like that ... most never even get the chance.</p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edcfcb9dc3c62f8d7d8_624afda4773b0d3f02396133_IMG-3264.jpeg\"><p>Overall, this year has taught me so much about resilience. All of the failures, successes, hopes, dreams, and disappointments that I have experienced have turned into important life lessons. I’ve learned about the importance of giving and of radical generosity. I’ve learned about integrity, respect, and kindness. I’ve tried to be generous with my time and I’ve tried to be of service to others. And as I look forward to the next few years, I can only hope that all these lessons I’ve learned can be used to help spur the potential of tens of millions more people around the world.</p><p>We have a lot of work ahead and we need to raise a lot of money to make it happen, but I feel grateful for 2020. I’ve been given the opportunity of a lifetime and I’m running with it. I might be wrong, but I think the FinMango story has just begun… Let’s jump on the train! </p><p>Stay tuned and learn how to support our work at <a href=\"https://finmango.org/\">finmango.org</a>.</p>"
  },
  {
    "title": "How Unity and Passion Can Change the World: My Data Internship Experience with FinMango",
    "date": "Nov 06, 2020",
    "year": 2020,
    "location": "Emergency Response",
    "excerpt": "by Rebeca LozanoAfter being evacuated from Brazil, during what was supposed to be my year-long and fascinating experience in a country I had longed to visit, I felt troublingly...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edca9f43760025a0dce_624b0114afc7f633f773856d_Untitled%2520design%2520(45).jpeg",
    "body": "<p>by <a href=\"https://www.linkedin.com/in/rebecaslozano/\">Rebeca Lozano</a></p><p>After being evacuated from Brazil, during what was supposed to be my year-long and fascinating experience in a country I had longed to visit, I felt troublingly out of place. Plans suddenly changed, not only within my program, but within school, work, and among my friends, and family. Upon my return to the United States, I could not help but think about my month and a half experience in Brazil. More intensely, I could not help but think of some of the moments that shook me to my core – from witnessing theft in an appliance store, a man beaten in the streets by the police for stealing a phone, and to being pickpocketed on my walk back to my apartment.</p><p>I kept thinking about the huge contrast between my life in Texas and in Minas Gerais regarding their levels of safety and crime rates, and I constantly thought about how my daily routine changed dramatically once in Brazil. Inevitably, I began to think of the why. Why is the level of safety tragically lower? Why can’t I walk to the corner store without being overly-aware of my surroundings, what I’m wearing, or where I have my phone, wallet, and keys?</p><p>It is easy to highlight the many things that enable the level of insecurity. &nbsp;However, my initial thought was the inaccessibility of economic resources to communities, such as the lack of well paid employment, the lack of financial literacy, and the inability of the government to help the poor.</p><p>Fast-forward to a couple of days being back in the U.S.,I was settled in my college apartment in Austin, Texas, and I began to think of ways in which I could provide immediate help to improve access to economic resources in any shape or form, big or small. I was already overwhelmed simply with the idea of helping, wondering where to start, especially considering we were in the middle of a pandemic. I thought there may not be opportunities to help in the slightest. One evening, as I was scrolling through Instagram photos with the hashtag “#financial literacy,” I came across FinMango’s page. I was captivated by the colors and the bio that quickly phrased “We’re on a mission to solve the financial exclusion problem..”. I applied to volunteer not really knowing what to expect, what I would specifically be working on, or what I needed to know, but needless to say I was excited.</p><p>A couple days later, Scott gave me a call and mentioned this COVID-19 Data Project. He summarized what the project would entail, gathering geographical data on this fast-changing virus no one really knows much about. Even though I knew this did not directly have much to do with financial literacy, I knew it was a way in which I could help FinMango and thus, support its mission. A team of about 10 people was formed. Our team consisted of high-schoolers, college students, a pharmacist, a professor, an engineer, and our great CEO, Scott. It is easy to say that with this dynamic, and the level of expertise, I was a bit skeptical of how efficient we would be. I was curious to see how a couple of college and high school students would be able to contribute to a project of this magnitude. I felt like 10 individuals were about to take over the world’s COVID-19 data – clearly exciting. </p><p>We began designing a structure. We organized where our data would go, set up several calls per week, and searched for reliable sources from health organizations that appropriately met our expectations in credibility and accuracy. This was a challenge. I was now reading and browsing extensively for sources that seemed reliable. We also came to realize there were many countries that lacked reporting daily or weekly. However, after what felt like a couple of days, we began finding these “gold mines” of data and got to work. For weeks I went from digging for sources, updating the data routinely, meeting with our team, and sharing our successes and challenges on a weekly basis.</p><p>Celebrating our work, we knew we could take on more. We were then introduced to the idea of contributing to a dataset focused on K-12 districts across the U.S. My initial thought was that this would be easier than searching for resources with COVID-19 data from across the globe. I thought, “It’s the U.S. There must be many people collecting K-12 data. Outbreaks in schools are crucial to track. This should be easy.”</p><p>But, I was very wrong. To my surprise this data collection proved itself to be even more difficult, which was shocking. I soon came to realize that data accessibility was extraordinarily limited for several states in the Southeast region. There were also states that still were not reporting outbreaks and cases, even though it was clear from the news that cases were rising nationwide with classes resuming across specific districts. I was worried and questioned why such numbers were not being reported when these are facts anyone should have access to, especially those attending and working in schools in these districts. I kept coming across news articles <em>for weeks </em>that said, “So and so state does not have a COVID-19 dataset nor dashboard for their school districts, but reported they will be releasing one soon.”</p><p>While this was rather devastating to encounter, we surpassed our own expectations and standards for the states that were actively reporting on K-12 cases and outbreaks. Our team (now slightly bigger than when we started) continuously worked to get The COVID Monitor up and running with the data available. We shared these victories during our weekly meetings and work sessions – and soon enough, we were featured on the NY Times, CNN, The Vox, and simultaneously skyrocketing on Twitter thanks to our social media guru, Anthony. It seemed like a couple of high-schoolers and college students were quite helpful after all. While this all happened over the course of months, it feels like it was just yesterday that Scott had given me that call. It has enabled me to take part in something necessary, and now I can clearly see the magnitude of what we’re facing today, not only nationally but globally. Nevertheless, throughout the countless meetings and work sessions, it was always a pleasure to see that even after <em>many </em>hurdles, each one of us shared the <em>passion</em> to do our part. Unitedly, we contributed our talents, ideas, and professions to something, as frequently quoted, “bigger than ourselves.”</p><p><br></p>"
  },
  {
    "title": "Personal Growth and Financial Literacy – How I Found my Purpose through FinMango",
    "date": "Nov 12, 2020",
    "year": 2020,
    "location": "Emergency Response",
    "excerpt": "by Uday Patel“An investment in knowledge pays the best interest.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfafdabf93b37565bd_624b01a105fd15576336ab69_Untitled%2520design%2520(46).jpeg",
    "body": "<p>by <a href=\"https://www.linkedin.com/in/uday-patel-100b13178/\">Uday Patel</a></p><p>“An investment in knowledge pays the best interest.” This quote by Benjamin Franklin has been ingrained in me, and has been embedded in my mind since a very young age. This inspirational quote has always motivated me to address every obstacle that I’ve encountered. These words have taught me how important every aspect of my life is, even if it’s the smallest thought that enters my mind. </p><p>Being raised in a country with one of the highest poverty rates in the world, this quote opened my eyes to a new way of perceiving the world. These simple, yet powerful words instilled a passion within me from a very young age, to volunteer and dedicate my time to the community to perhaps have the opportunity to see a smile on someone’s face. </p><p>Last year, I had the chance to reflect on the purpose of my life, and what would make me truly happy. I resolved that my life’s purpose was to help other people, and to help improve the environment in the most positive and innovative ways possible.” It was this purpose that brought me to FinMango.</p><p>While exploring FinMango’s web page, I ran across <a href=\"https://www.linkedin.com/in/anthony-schilt\">Anthony Schilt</a>’s instagram page, and I was intrigued by the mission of FinMango. I saw this as a great opportunity to serve my community through data, advocacy, and technology. After speaking with <a href=\"https://www.linkedin.com/in/sglasgow\">Scott Glasgow</a>, the CEO of FinMango, internally known as Mango Scott, I immediately got involved in FinMango as a Marketing and Technology intern .</p><img alt=\"Screen Shot 2020-11-05 at 12.35.51 PM (1).png\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfafdabf1b047565c1_624b0195aa918de7022327b1_Screen%252BShot%252B2020-11-05%252Bat%252B12.35.51%252BPM%252B%2525281%252529.png\"><p>My first responsibility was to work with <a href=\"https://www.linkedin.com/in/kishan-patel-k/\">Kishan Patel</a> to utilize a $120,000 grant for our Google Adword campaign. I appreciated how I had the opportunity to showcase my skills, and the way Scott trusted me with every step of the way. After settling in with this project, I was given the opportunity to be co-coordinator with Kishan Patel and Anthony Schilt for the technology segment of the Extravaganza. Extravaganza was a 24-hour zoom call with 50+ keynote speakers. This event was filled with impressive and successful people who shared their stories about financial literacy. </p><p>I also had the privilege of being a moderator for one of the panels titled “The Impacts of Financial Literacy on Young Professionals.” Being involved in the Extravaganza increased my knowledge about financial literacy, in addition to improving my communication and leadership skills. Several hundreds of people participated in watching these panels, challenging me to step out of my comfort zone, and invest all of my energy into making this program a success. I felt really good after being a panel moderator; this achievement reinforced in me the importance of educating a person about financial literacy. I also recognized the fact that I possibly made someone smile! I felt confident I was &nbsp;impacting other people’s lives while simultaneously educating myself.</p><p>After a couple of weeks, we started to work on FinMango’s Data project. I didn’t know where this project would lead – it has turned out to be one of the most amazing projects that I’ve worked on as a member of FinMango. I am in awe of the depth of information and experience I have gained from this project, and the impact it is having on people. In the collaborative project with Google, I am the lead mango for covid data collection for South Africa with two fellow mangos, James Glasgow and Dr. Glasgow. After investing hard work at the inception of the project, including reaching out to hospitals, health departments, managers, different resources, and collecting data, we had the most reliable Covid-19 data in the world.This was an unforgettable feeling. I am grateful to <a href=\"https://www.linkedin.com/in/owahltinez/\">Oscar Wahltinez</a> for providing this tremendous and unique opportunity to us. The Covid-19 Data Project was the idea of Oscar Wahltinez, a Developer Programs Engineer at Google, who provided insight and guidance for our team throughout each step of the process. This project led to another avenue of data collection – researching Covid-19 outbreaks data in K-12 schools across the United States. I was designated as the lead on this project for all K-12 schools on the east coast of the United States. I am proud to see our team gaining recognition for our work of collecting and sharing pertinent data with the world – we have been published on <a href=\"https://www.youtube.com/watch?v=Ua3829GSqTU&ab_channel=FinMango\">CNN</a>, <a href=\"https://www.nytimes.com/interactive/2020/09/21/us/covid-schools.html\">The New York Times</a>, and <a href=\"https://www.thedailybeast.com/rebekah-jones-fired-florida-data-scientist-and-ron-desantis-worst-nightmare-goes-after-covid-in-schools\">The Daily Beast</a>, with (hopefully) plenty more to come. </p><img alt=\"Untitled+design (1).png\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfafdabfee957565c0_624b01954a2bef81c0dea6ad_Untitled%25252Bdesign%252B%2525281%252529.png\"><p>After several weeks on the Google Data Project, the United Nations informed us that they wanted to use the data we collected. They also wanted to learn about the framework of the project in its entirety. Scott asked me if I was willing to present our project with Kishan Patel and <a href=\"https://www.linkedin.com/in/ojasvinee-singh/\">OJ Singh</a> in front of the UN. When I heard the news, I freaked out! I had to prepare extraneously for this presentation, which meant going out of my comfort zone, again. Nevertheless, the presentation went well, and now I can say that the biggest accomplishment in my life (so far) has been presenting in front of the UN!</p><p>So far, FinMango has been an epic journey for me; I can't wait to see what our team of mangoes will do next! I love every single one of them and look forward to continuing growing with them. FinMango helped me develop my personal drive and motivation. It helped me become someone who will never stop trying to become what they aspire to be. Our team of mangoes truly feels like my second family; an environment where everyone is encouraged to be their authentic self.</p><img alt=\"Screen Shot 2020-11-05 at 12.36.23 PM (1).png\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edfafdabfc4617565c2_624b0195edcb52b16f005ab7_Screen%252BShot%252B2020-11-05%252Bat%252B12.36.23%252BPM%252B%2525281%252529.png\">"
  },
  {
    "title": "\"Teach them how to fish\"​: how will that help their finances?",
    "date": "Dec 08, 2020",
    "year": 2020,
    "location": "Field",
    "excerpt": "all know the oldest cliché in development, aid or whatever subject the speaker wants this to be about: \"give someone a fish, and they'll eat for a day.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1fe7221494fe4cf44_624b098e50a5e4fda5696daf_Untitled%2520design%2520(50).jpeg",
    "body": "<p>By <a href=\"https://www.linkedin.com/in/1michaelgilmore/\">Michael Gilmore</a></p><p>We all know the oldest cliché in development, aid or whatever subject the speaker wants this to be about: \"give someone a fish, and they'll eat for a day...\"</p><p>I don't need to finish it, do I? You're already saying the second half in your head right now. It's so well known and so powerful, Mad Men-style advertising copywriters would give their Martini-holding right arms to come up with something half that resonant.</p><p>And yet. With all that power and fame, where are all the fishing lessons?</p><p>If we know that this epithet is true, and has been true ever since Lao Tzu was supposed to have originally said it, shouldn't we by now have learnt that we all need to be taught how to survive for the rest of our lives? Shouldn't we be making sure that every generation is equipped with the skills it will need?</p><p>Back in Lao Tzu's day that was probably actually fishing, but today, right now, and probably for most of the last 100 to 200 years, that should have been finance. Not necessarily \"high finance\" or anything complicated, but enough to understand what money really is, and how to make it work for us more than we have to work for it.</p><p>Some time back, an idle thought crossed my mind: I wonder if more people teach fishing than financial literacy, and obviously raced to google to check. Almost everywhere I searched, using different terms, different virtual locations and even different engines, the results showed that people actually do offer and search for fishing lessons more than they do financial literacy.</p><p>Yes, more of us are either looking for or offering lessons on fishing, a thing that would have been the latest and greatest thing a couple of thousand years ago, than are looking or offering to help learn how to manage the money in our lives. Which would be the greatest if not latest thing today.</p><p>The thing that makes us secure. The thing that might stop us dropping into poverty. The thing that might help us have a happy and healthy retirement. The thing that might, actually, help us \"eat forever\".</p><p>I re-ran the test this week on google trends, inspired by Stephen Barnham (who I failed to link here - sorry Steve), and the results are roughly the same - this time run on a global database. On the chart at the top of this post, the blue line is fishing lessons, the red one is finance lessons.</p><p>Globally, fishing lessons have been twice as popular on average as financial literacy for the last five years. Lessons for the thing that could actually dramatically change our lives have only been more popular than fishing in only a few weeks out of that period. This is insane.</p><p>It's not just fishing. Pottery lessons score 10% more than finance on google trends, and knitting, yes knitting, is only 20% less popular in the last five years! Give it a try for yourself if you've got a hobby you would like to compare:<a href=\"https://trends.google.com/trends/explore?date=today%205-y&q=fishing%20lessons%2Cfinance%20lessons\"> https://trends.google.com/trends/explore?date=today%205-y&amp;q=fishing%20lessons,finance%20lessons</a></p><p>Despite the fact that money - or particularly the lack of it - can drive the flow of our lives, classes for understanding it are barely as popular as skills that, while charming and potentially distracting, have stopped being a viable source of income and support for most of the world in the last 50 years. And they definitely shouldn't be a source of income for people searching them on google!</p><p>If I go back to one of the things I said in my last article (https://www.linkedin.com/pulse/how-financial-literacy-could-matter-than-ever-michael-gilmore), that people don't want to be financially literate, they want to be financially stable, secure or even wealthy, then we can see the evidence for this on google too.</p><p>\"Financial security\" as a search term is ten times more popular than fishing lessons and 20x times more popular than finance lessons. The yellow line in the chart below is \"financial security\" added to the one above for fishing and finance.</p><img alt=\"1606968959144.png\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1fe7221a6dfe4cf45_624b099f3596ce3c1db9678b_1606968959144.png\"><p>People are desperate to learn how to eat forever, but because our education system doesn't tell them that understanding money is the way to achieve this, they are twice as likely to look for fishing lessons as finance ones! It's a 20-to-1 mismatch in terms of people looking for financial security and looking for financial literacy.</p><p>That people are looking for financial security is a worry - but also a relief. It is obviously sad that so many people are concerned about their financial security than so many other subjects, but in some ways it is a positive that they are at least searching for the answer. If we can create and distribute tools, products, books, apps - and maybe even a journal (https://www.linkedin.com/pulse/how-were-trying-use-our-simple-little-journal-solve-two-gilmore) - that address this gap, we can meet this demand head on and help resolve this eminently fixable problem. We can perhaps be 20x more effective if we address the demand for financial security than that for financial literacy.</p><p>The <a href=\"https://www.ft.com/content/e25ce66e-b639-408b-b7ef-f524d664a30d?shareType=nongift\">FT's new initiative</a> &nbsp;appears to me to be the most promising I have seen, and I hope to be as involved as I can be. </p><p>It could help millions of people. It could make aid programmes more efficient and education systems more relevant. It also doesn't require any great break-throughs, as everything that needs to be taught is already well-known, it just needs re-shaping to fit its audience rather than its teachers.</p><p>Let's do this! Let's take this opportunity to teach people how to really fish, how to manage their money so it helps their lives, so they can indeed eat forever.</p>"
  },
  {
    "title": "FinMango in Uganda!",
    "date": "Jul 11, 2018",
    "year": 2018,
    "location": "Kampala, Uganda",
    "excerpt": "Amazing work is being done in the community of Lugala in the Namayingo District of Uganda! Teaching 55 students about financial literacy and the money cycle in their native...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9b18357dd4af80004_624b2f68b9f953c38b7592e1_Untitled%2520design%2520(91).jpeg",
    "body": "<p>Amazing work is being done in the community of Lugala in the Namayingo District of Uganda! Teaching 55 students about financial literacy and the money cycle in their native language Lusamia! Great work by our partner organization <a href=\"https://www.facebook.com/childrcrisiscenteruganda/?fref=mentions\">Child Crisis Center Uganda</a></p><p><a href=\"https://images.squarespace-cdn.com/content/v1/56be4e4c356fb031229edcbb/1531285783841-EZ8IVXVQMWXUJCX5D7UO/36887987_1046356782199485_7291504629106343936_n.jpg\"><br></a></p><img alt=\"36887987_1046356782199485_7291504629106343936_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edab18357d005f80006_624b2f44d181e6364b254859_36887987_1046356782199485_7291504629106343936_n.jpeg\"><img alt=\"36919074_1046356798866150_7387934015065423872_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edab183577e5df80005_624b2f44b45fb42c28459016_36919074_1046356798866150_7387934015065423872_n.jpeg\"><img alt=\"36944818_1046356855532811_6658004185671270400_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edab18357c0faf80009_624b2f44dfdd180c4f313c98_36944818_1046356855532811_6658004185671270400_n.jpeg\"><img alt=\"36899258_1046356788866151_7776470985888235520_n (1).jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edab183579537f80008_624b2f44d181e61042254858_36899258_1046356788866151_7776470985888235520_n%252B%2525281%252529.jpeg\"><img alt=\"36885959_1046356792199484_8387113802352558080_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edab18357461df80007_624b2f451dcbf298435cc292_36885959_1046356792199484_8387113802352558080_n.jpeg\"><img alt=\"36879529_1046356848866145_203879950057472000_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edab183572fc9f8000a_624b2f440e98834bf226785d_36879529_1046356848866145_203879950057472000_n.jpeg\">"
  },
  {
    "title": "Alive and Kickin’ in Togo",
    "date": "Mar 05, 2018",
    "year": 2018,
    "location": "Lomé, Togo",
    "excerpt": "FinMango is proud to officially launch the Financial Enlightenment Program (Soccer Version) in Togo! Partner: flyforlifeworld.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed74cca9bcb5b19b044_624b2b6f55e07d5f7b4e3de7_Untitled%2520design%2520(86).jpeg",
    "body": "<p>FinMango is proud to officially launch the Financial Enlightenment Program (Soccer Version) in Togo! Partner: <a href=\"http://flyforlifeworld.org\">flyforlifeworld.org</a></p><iframe allowfullscreen=\"true\" frameborder=\"0\" scrolling=\"no\" src=\"https://www.youtube.com/embed/5gkU9BNN_84\"></iframe><img alt=\"IMG_5225.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed84cca9b42cd19b04a_624b2b4eb367b25a7a5f124f_IMG_5225.jpeg\"><img alt=\"IMG_5142.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed84cca9b0fa219b04c_624b2b4ed181e60f62251a2c_IMG_5142.jpeg\"><img alt=\"IMG_5143.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed84cca9bb05f19b04d_624b2b4ed181e6c64d251a2b_IMG_5143.jpeg\"><img alt=\"IMG_5144.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed84cca9ba92219b048_624b2b4e50add820b8f86058_IMG_5144.jpeg\"><img alt=\"IMG_5222.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed84cca9bf74519b04b_624b2b4ede14f959730cff51_IMG_5222.jpeg\"><img alt=\"IMG_5224.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed84cca9b82d819b049_624b2b4e7982df4e2d354e2e_IMG_5224.jpeg\">"
  },
  {
    "title": "FinMango + Google!",
    "date": "Jan 05, 2018",
    "year": 2018,
    "location": "Field",
    "excerpt": "THANK YOU Oscar and Emilie from Google for the time and effort you took to share your thoughts and experiences with the AWESOME students at the Saint Ambrose Catholic School.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c35396e7f294166_624b281212788727a5c5e7cc_Untitled%2520design%2520(78).jpeg",
    "body": "<p>THANK YOU Oscar and Emilie from <a href=\"https://www.facebook.com/Google/?fref=mentions\">Google</a> for the time and effort you took to share your thoughts and experiences with the AWESOME students at the <a href=\"https://www.facebook.com/SaintAmbroseSchoolBrunswick/?fref=mentions\">Saint Ambrose Catholic School</a>. You truly made a positive difference in the lives of young Mangos!</p><img alt=\"26231086_928313494003815_2893474025414205825_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c353946bf294168_624b27ea50add83855f83abd_26231086_928313494003815_2893474025414205825_n.jpeg\"><img alt=\"26219364_928313954003769_5554825783031955193_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c3539b1ed294167_624b27ea4a7725495f706ff1_26219364_928313954003769_5554825783031955193_n.jpeg\"><img alt=\"26232870_928314174003747_613642773526069803_o.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c35397aae29416b_624b27eadccb6259178e0df7_26232870_928314174003747_613642773526069803_o.jpeg\"><img alt=\"26230043_928314230670408_142755776441099661_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c3539fa7b294169_624b27eaba341f0be63408e1_26230043_928314230670408_142755776441099661_n.jpeg\"><img alt=\"26231481_928313674003797_1847422457922424787_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c353904b329416a_624b27eadf247152080da586_26231481_928313674003797_1847422457922424787_n.jpeg\"><p><br></p>"
  },
  {
    "title": "FinMango Taught at The Univeristy of Akron Finance Day",
    "date": "Jun 02, 2018",
    "year": 2018,
    "location": "Field",
    "excerpt": "We had a BLAST teaching at the University of Akron Finance Day on May 16th! We reached 163 students.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda340daf26c4d53fec_624b2eed2d15c2c0987ec116_Untitled%2520design%2520(89).jpeg",
    "body": "<p>We had a BLAST teaching at the University of Akron Finance Day on May 16th! We reached 163 students. Board Mango Bob Gillingham taught investing while Board Mango Don Tharp taught budgeting!&nbsp;</p><img alt=\"34072561_1009930385842125_6373513742486863872_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340daf4addd53ff2_624b2ea43169146f69df4363_34072561_1009930385842125_6373513742486863872_n.jpeg\"><img alt=\"33993976_1009930469175450_4651206413404602368_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340daf883ad53ff5_624b2ea4f426e80d2fdaf410_33993976_1009930469175450_4651206413404602368_n.jpeg\"><img alt=\"34104219_1009930402508790_6315075030183051264_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340daf9ae1d53ff1_624b2ea4e592dfb1a8f8a509_34104219_1009930402508790_6315075030183051264_n.jpeg\"><img alt=\"34031936_1009930455842118_1854993665018036224_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340daf4630d53ff0_624b2ea4b9f9532ae8758fe7_34031936_1009930455842118_1854993665018036224_n.jpeg\"><img alt=\"34121918_1009930405842123_2905719244610076672_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340daf9e9dd53ff3_624b2ea44a77256c6f70ab33_34121918_1009930405842123_2905719244610076672_n.jpeg\"><img alt=\"33993983_1009930795842084_2832683325741596672_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda340daf7b26d53fed_624b2ea4edab44c8886642fe_33993983_1009930795842084_2832683325741596672_n.jpeg\"><img alt=\"34035992_1009930692508761_7718123314006196224_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340daffa0fd53fef_624b2ea65d06af226f0eb959_34035992_1009930692508761_7718123314006196224_n.jpeg\"><img alt=\"34175083_1009930755842088_5212720645158207488_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda340dafe9d7d53fee_624b2ea4b5d5fa3888246d26_34175083_1009930755842088_5212720645158207488_n.jpeg\"><img alt=\"34067458_1009930485842115_7009556029172088832_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340daf4828d53ff4_624b2ea5bdd2fb37d5523e87_34067458_1009930485842115_7009556029172088832_n.jpeg\">"
  },
  {
    "title": "Financial Literacy Class to 50 Realtors!",
    "date": "Mar 20, 2018",
    "year": 2018,
    "location": "Columbus, Ohio",
    "excerpt": "We taught a financial literacy class to 50 realtors and their families at Weymouth Country Club in Medina, Ohio! Thanks for sponsoring this event, First Security Mortgage...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c3539fc26294160_624b2dcc8010998b63cc5c74_2.jpeg",
    "body": "<p>We taught a financial literacy class to 50 realtors and their families at Weymouth Country Club in Medina, Ohio! Thanks for sponsoring this event, First Security Mortgage Corporation!</p><p><a><br></a></p><img alt=\"1.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c35390634294162_624b2da8b169a964ae2da8cc_1.jpeg\"><img alt=\"2.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c3539fc26294160_624b2dcc8010998b63cc5c74_2.jpeg\"><img alt=\"3.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c3539b6dc294161_624b2da86b21e66d89e7c72e_3.jpeg\">"
  },
  {
    "title": "FinMango Supporters Meet in Cleveland",
    "date": "Apr 18, 2018",
    "year": 2018,
    "location": "Cleveland, Ohio",
    "excerpt": "FinMango supporters, volunteers, and board members gathered to discuss the future of FinMango.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda581fcebc4d5e8923_624b2ee829144e0d79852649_Untitled%2520design%2520(90).jpeg",
    "body": "<p>FinMango supporters, volunteers, and board members gathered to discuss the future of FinMango.&nbsp;</p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda581fce1ea55e8925_624b2e4d9b8bec5b058e9999_29694759_974582789376885_8710401242171686110_n.jpeg\">"
  },
  {
    "title": "FinMango launches in Angola",
    "date": "Mar 03, 2018",
    "year": 2018,
    "location": "Luanda, Angola",
    "excerpt": "Our partners are local experts and professionals with years of exceptional work and proven progress.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda48bbc3681d997a15_624b2b07181eaa588800e9a3_Untitled%2520design%2520(85).jpeg",
    "body": "<p>Our partners are local experts and professionals with years of exceptional work and proven progress. We’re excited to officially launch in Angola. Partner: Chamuanga International School</p><img alt=\"28276439_954806534687844_3597775531319614139_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda48bbc38e4b997a18_624b2afdb45fb4ffcb456c01_28276439_954806534687844_3597775531319614139_n.jpeg\"><img alt=\"28167178_954806508021180_438873454000683694_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda48bbc380f1997a19_624b2afde06e6126cb04b754_28167178_954806508021180_438873454000683694_n.jpeg\"><img alt=\"28058635_954806514687846_2816193520700284257_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda48bbc35358997a17_624b2afdd81f9bae527f6129_28058635_954806514687846_2816193520700284257_n.jpeg\"><img alt=\"28058453_954806538021177_2421190973368012799_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda48bbc33bec997a16_624b2afd6231cd1296331086_28058453_954806538021177_2421190973368012799_n.jpeg\">"
  },
  {
    "title": "Mango Brandyn Published a Book!",
    "date": "Feb 17, 2018",
    "year": 2018,
    "location": "Field",
    "excerpt": "Congratulations on the publication of your book Mango Brandyn! Order “Early Money: A Guide to Financial Independence For College Students” today on Amazon!https://www.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edd7465c83078ee0aa9_624b2a2a55e07d7e8b4e23e4_Untitled%2520design%2520(83).jpeg",
    "body": "<p>Congratulations on the publication of your book Mango <a href=\"https://www.facebook.com/brandyn.neal?fref=mentions\">Brandyn</a>! Order “Early Money: A Guide to Financial Independence For College Students” today on Amazon!</p><p><a target=\"_blank\" href=\"https://www.amazon.com/dp/1979421838/ref=cm_sw_r_sms_c_api_MuNHAbK8FBNES\">https://www.amazon.com/dp/1979421838/ref=cm_sw_r_sms_c_api_MuNHAbK8FBNES</a></p><p><a href=\"https://images.squarespace-cdn.com/content/v1/56be4e4c356fb031229edcbb/1518905438079-OPVUJ5REZ2ARS9F94IPT/27867115_950985735069924_8575719352917600626_n.jpg\"><br></a></p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ede7465c8036eee0aae_624b2a23689b8904e2903026_27867115_950985735069924_8575719352917600626_n.jpeg\">"
  },
  {
    "title": "FinMango in San Francisco",
    "date": "Jan 28, 2018",
    "year": 2018,
    "location": "Field",
    "excerpt": "This past week FinMango was invited to San Francisco to congratulate the third cohort of the Center For Financial Services Innovation’s FinLab.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9f4dc5551119979ed_624b28e42d15c287897e7bd1_Untitled%2520design%2520(80).jpeg",
    "body": "<iframe allowfullscreen=\"true\" frameborder=\"0\" scrolling=\"no\" src=\"https://www.youtube.com/embed/NB0UiYPlUkE\"></iframe><p>This past week FinMango was invited to San Francisco to congratulate the third cohort of the Center For Financial Services Innovation’s FinLab. The team was able to meet the creators of FinTech aimed to revolutionize the way people interact with their finances and experience new creative solutions to everyday financial issues.</p><blockquote>“The Financial Solutions Lab is managed by the Center for Financial Services Innovation with founding partner JPMorgan Chase &amp; Co. The Financial Solutions Lab is a program that seeks to identify, test and brings to scale promising innovations that help Americans increase savings, improve credit, and build assets.” - <a target=\"_blank\" href=\"https://cfsinnovation.org/\"><strong>https://cfsinnovation.org/</strong></a></blockquote><p>Eight companies went through a program that helped to connect and grow their product with consumers and industry leaders. This year the mission was to target at-risk populations--or people who suffer from exclusion because of their financial situations. This issue has been the cornerstone to the mission of FinMango, and we could not have been more excited to hear from these eight companies on how they approached the issue of financial exclusion. Companies included:</p><ul><li><strong>Token Transit</strong>, a company aimed to fight financial exclusion through an easily accessible bus pass purchasing application from their prepaid, debit, or credit card;</li><li><strong>Nova</strong>, a company that acknowledges the obstacles of immigrants building credit in the U.S. by helping share their credit history in their past country to help establish credit history;</li><li><strong>Dave.com, </strong>a company that is on a mission to save you from paying overdraft fees by helping you to monitor your expenses as they come and allowing you to borrow from your next paycheck to avoid overdraft fees;</li><li><strong>Grove,</strong> a company that makes comprehensive financial advisors easy to reach through technology;</li><li><strong>EverSafe, </strong>a company on a mission to stop theft or financial abuse for aging Americans by creating an alert system that ends exploiters before it goes too far;</li><li><strong>Tomorrow, </strong>a company hoping to make creating a will and trust as easy as possible to save Americans from unfortunate situations through a simple mobile app;</li><li><strong>Point, </strong>a company that allows Americans to use the wealth in their home without taking on new debt;</li><li><strong>Blueprint Income, </strong>that takes the idea of income annuity and makes it easy for anyone of any age to look forward to their retirement.</li></ul><p>We heard from speakers and discussed with leaders that frontier the industries of FinTech to learn more about their stories, financial issues, creative solutions, and how we can integrate these solutions to the world around us.</p><p>“<em>The event acted as a catalyst for the Finmango organization, giving us a new drive and direction for the future</em>,” commented Mango Jonathan Li. We are ecstatic to bring back fresh perspectives and all that we have learned in San Francisco to push Finmango’s mission further!</p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edaf4dc554fa39979fc_624b2892f6d63dbe8a1629c4_CFSI_7.jpeg\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edaf4dc5542429979fd_624b289b923403dc02f096a0_CFSI_6.jpeg\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edaf4dc554829997a00_624b28a503d6a5d051eac5c5_CFSI_5.jpeg\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edaf4dc55be2c9979ff_624b28b012788711d4c5ebef_CFSI_3.jpeg\"><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edaf4dc550f4d9979fe_624b28bdaaf11adb3fb74b82_CFSI_1.jpeg\">"
  },
  {
    "title": "Mango Bob wins \"MAN OF THE YEAR\" by JOG!",
    "date": "Feb 09, 2018",
    "year": 2018,
    "location": "Columbus, Ohio",
    "excerpt": "Congratulations on leading the way, Mango Bob (Robert Gillingham II).",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edd5df015e33c2a7fe1_624b29c1543c2831222c46c9_Untitled%2520design%2520(82).jpeg",
    "body": "<p>Congratulations on leading the way, Mango Bob (<a href=\"https://www.facebook.com/robert.i.gillingham?fref=mentions\">Robert Gillingham II</a>). The “MAN OF THE YEAR” award winner by <a href=\"https://www.facebook.com/JobsforOhiosGraduates/?fref=mentions\">Jobs for Ohio's Graduates</a>.</p><img alt=\"IMG_6100.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edd5df01509192a7fe2_624b29c454ce0f8043f70dda_IMG_6100.jpeg\"><img alt=\"IMG_4769.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edd5df015a9d02a7fe3_624b29c4de14f9b6580cedad_IMG_4769.jpeg\"><img alt=\"IMG_3596.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edd5df015ff402a7fe4_624b29c4d81f9be8ba7f5799_IMG_3596.jpeg\"><img alt=\"IMG_5774.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edd5df01507332a7fe5_624b29c46231cd5c7b330592_IMG_5774.jpeg\">"
  },
  {
    "title": "Why I Mango - Maci Woyat",
    "date": "Mar 16, 2018",
    "year": 2018,
    "location": "Kathmandu, Nepal",
    "excerpt": "“Being Mango is standing up for equality and fairness, by empowering the people around you to take their life into their own hands with financial tools and knowledge to fund their...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee27d30f93473375be4_624b2c1961746017a9eb53aa_Untitled%2520design%2520(87).jpeg",
    "body": "<blockquote><strong>“Being Mango is standing up for equality and fairness, by empowering the people around you to take their life into their own hands with financial tools and knowledge to fund their dreams.”</strong> — Maci Woyat</blockquote><p>My name is Maci Woyat! As a current university student, not only am I passionate about my work inside the classroom, but I am passionate about what I can do with that knowledge I have learned to educate the world around me. My love for Finance and Economics comes from my day to day interactions I had where money was constantly flowing around me. I found myself intrigued with how money’s movement influenced decisions and society. This lead me to follow a path towards gaining my bachelors degrees in those subjects.</p><p> However, I always felt that studying inside the classroom could only get you so close to the subject. That it was almost like going to a museum and pressing your face up against the glass to study the artifact in front of you. But, to truly understand and make a difference in the world, you have to be engaged with what you are studying. So I became a Mango to learn more about economics and finance and their impacts in my community. What I learned from my work at FinMango was beyond just applying the knowledge I have been studying. I learned about what it means to make a difference in the world around me and what being a Mango truly means.</p><h3> </h3><img alt=\"IMG_4412.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edaf4dc550f4d9979fe_624b28bdaaf11adb3fb74b82_CFSI_1.jpeg\"><img alt=\"Screenshot_20180313-232409_2.png\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee27d30f94805375be6_624b2bfc1cfe0f5b47ed512a_Screenshot_20180313-232409_2.png\"><img alt=\"Screenshot_20180313-232430_2.png\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee27d30f936f9375be5_624b2bfc5753602a88415d8b_Screenshot_20180313-232430_2.png\"><p>Being a Mango is acting as an advocate for financial literacy. Being a Mango is sharing the knowledge and opportunity you have been granted with the world around you. Being Mango is standing up for equality and fairness, by empowering the people around you to take their life into their own hands with financial tools and knowledge to fund their dreams. Being a Mango is doing all of this while being innovative, creative, and having fun.</p><p>I am a Mango because I want to be a catalyst for others’ success stories. I have had the opportunity to learn about the financial literacy movement from my local community, all the way to Nepal or Togo (to name a few). When I hear the stories from our partners and past students of the programs, I hear proof that our work makes a difference. Being a Mango is one of the most privileged positions I have been granted, and is a constant motivation to learn more and work harder to help improve the lives of others.</p><img alt=\"Screenshot_20180313-234252_2.png\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee27d30f9334c375be7_624b2bfc543c28cabf2c5b29_Screenshot_20180313-234252_2.png\">"
  },
  {
    "title": "JOG Presentation - FinMango",
    "date": "Mar 15, 2018",
    "year": 2018,
    "location": "Columbus, Ohio",
    "excerpt": "Mango Scott had the opportunity to speak at a Career Development Conference held by JOG ( Jobs for Ohio's Graduates) where he taught 150 students!.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edda7d679c2b6aab3d9_624b2cd7b8d8d91b645f9e87_Untitled%2520design%2520(88).jpeg",
    "body": "<p>Mango Scott had the opportunity to speak at a Career Development Conference held by JOG ( <a href=\"https://www.facebook.com/JobsforOhiosGraduates/?fref=mentions\">Jobs for Ohio's Graduates</a>) where he taught 150 students!</p><p><br></p><img alt=\"29472924_969470773221420_7640719092054885543_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edda7d67986e7aab3e8_624b2ca8d181e6092d252618_29472924_969470773221420_7640719092054885543_n.jpeg\"><img alt=\"29473005_969470783221419_6534637047751860382_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edda7d6798f9caab3e9_624b2ca81cfe0f55e4ed52e4_29473005_969470783221419_6534637047751860382_n.jpeg\">"
  },
  {
    "title": "Money Cycle + Tennis in Uganda!",
    "date": "Mar 01, 2018",
    "year": 2018,
    "location": "Kampala, Uganda",
    "excerpt": "Our field partner \"Tennis For All Uganda\" has successfully implemented the first lesson of our Financial Enlightenment program.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ede41aa3570c4028bbe_624b2a97da4b0d7afa486fe4_Untitled%2520design%2520(84).jpeg",
    "body": "<p>Our field partner \"Tennis For All Uganda\" has successfully implemented the first lesson of our Financial Enlightenment program. In our collaboration, we're combining tennis with financial education. We're excited to continue the program while incorporating tennis! </p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ede41aa35e95e028bc0_624b2a90d181e62d5f251369_28190797_10210923845907723_298466472_n%252B(1).jpeg\"><iframe allowfullscreen=\"true\" frameborder=\"0\" scrolling=\"no\" src=\"https://www.youtube.com/embed/kgejoSN71u8\"></iframe><p>‍<a href=\"https://images.squarespace-cdn.com/content/v1/56be4e4c356fb031229edcbb/1518908996775-21JNIAGU09BPT67FY55X/28190797_10210923845907723_298466472_n+%281%29.jpg\"><br></a></p>"
  },
  {
    "title": "Mango Scott Spoke at the Paul & Carol David YMCA!",
    "date": "Feb 07, 2018",
    "year": 2018,
    "location": "Field",
    "excerpt": "Executive Mango told the story of FinMango at the Paul & Carol David YMCA.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edffe72212503e4cf32_624b2939923403e960f09c82_Untitled%2520design%2520(81).jpeg",
    "body": "<p><br></p><p>Executive Mango told the story of FinMango at the Paul &amp; Carol David YMCA. Check out the full story:&nbsp;<a href=\"https://www.facebook.com/davidymcajackson/posts/10156168601044394\" target=\"_blank\">https://www.facebook.com/davidymcajackson/posts/10156168601044394</a></p><img alt=\"IMG_4687.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edffe7221374ee4cf3f_624b2950b7be89226a92b2df_IMG_4687.jpeg\"><img alt=\"IMG_4688.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edffe7221de19e4cf3d_624b294fd181e679f4250af2_IMG_4688.jpeg\"><img alt=\"IMG_4689.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edffe7221afafe4cf3e_624b2959da4b0d516b4864b2_IMG_4689.jpeg\"><img alt=\"IMG_4690.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edffe722136e6e4cf3b_624b2959f6d63d2a85162f25_IMG_4690.jpeg\"><img alt=\"IMG_4691.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edffe7221de0de4cf3c_624b295946e08c7ae8db7832_IMG_4691.jpeg\">"
  },
  {
    "title": "Financial Fitness Boot Camp in Nepal!",
    "date": "Dec 04, 2017",
    "year": 2017,
    "location": "Kathmandu, Nepal",
    "excerpt": "FinMango was proud to serve as a technical supporter for the Financial Fitness boot camp organized by Finlit Nepal Pvt.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed88468246448e020eb_624b25ce1acc4a3ebc96d2f4_Untitled%2520design%2520(76).jpeg",
    "body": "<p>FinMango was proud to serve as a technical supporter for the Financial Fitness boot camp organized by Finlit Nepal Pvt. Ltd and Atharva over the weekend in Nepal!</p><p><a href=\"https://images.squarespace-cdn.com/content/v1/56be4e4c356fb031229edcbb/1512448770254-FVXQ6SZV3W0BWHRCXNUI/24296695_912367225598442_1612988705251459455_n.jpg\"><br></a></p><img alt=\"24296695_912367225598442_1612988705251459455_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed98468247d2fe020ee_624b25e6b5d5fa5b0d242c5f_24296695_912367225598442_1612988705251459455_n.jpeg\"><img alt=\"24231980_912367228931775_5481949432196904915_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9846824d3bbe020f1_624b25e6ba341f8e9133f075_24231980_912367228931775_5481949432196904915_n.jpeg\"><img alt=\"24862548_912367135598451_353601572472253093_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9846824454de020ed_624b25e627c30c6faa4d787f_24862548_912367135598451_353601572472253093_n.jpeg\"><img alt=\"24796511_912367145598450_6955405299028505437_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9846824b548e020ec_624b25e603d6a52a91eaad7c_24796511_912367145598450_6955405299028505437_n.jpeg\"><img alt=\"24301396_912367178931780_5274115456222484987_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed98468242da6e020f0_624b25e650add86bfdf82ebd_24301396_912367178931780_5274115456222484987_n.jpeg\"><img alt=\"23916037_908273159341182_1028139605699422479_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed98468247533e020ef_624b25e7e679db97787ebe1c_23916037_908273159341182_1028139605699422479_n.jpeg\">"
  },
  {
    "title": "Budgeting with a Twist!",
    "date": "Nov 07, 2017",
    "year": 2017,
    "location": "Lomé, Togo",
    "excerpt": "Over the weekend, our partners at Fly for Life traveled to the rural community of Havu in Togo to teach \"Budgeting with a Twist\" lesson for 14 members of the farmers cooperative.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed88d03796ab7900169_624b24086c4e8b011c0cf6b6_Untitled%2520design%2520(74).jpeg",
    "body": "<iframe allowfullscreen=\"true\" frameborder=\"0\" scrolling=\"no\" src=\"https://www.youtube.com/embed/coGTxWW4WvQ\"></iframe><p>Over the weekend, our partners at <a href=\"http://flyforlifeworld.org/\">Fly for Life</a> traveled to the rural community of Havu in Togo to teach \"Budgeting with a Twist\" lesson for 14 members of the farmers cooperative. This lesson was on budgeting for alcohol, as this will help them become aware of how much money they can save if they reduce their alcohol consumption. The farmers now have a sheet where they can fill out how much has been spent on alcohol which will be shared with the family so they can all be aware. Next week these lessons will be continued and they will learn about wise spending!</p><img alt=\"IMG_2552.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed88d037986de900180_624b23a9181eaae6b600c17d_IMG_2552.jpeg\"><img alt=\"IMG_2551.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed88d037942ea900188_624b23a9b7be894823928222_IMG_2551.jpeg\"><img alt=\"IMG_2550.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed88d0379f6c490018c_624b23a9df24719ecf0d7e27_IMG_2550.jpeg\"><img alt=\"IMG_2553.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed88d03793123900181_624b23a96231cd4eb932c4ff_IMG_2553.jpeg\"><img alt=\"IMG_2558.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed88d03791d71900183_624b23a94a7725f654705903_IMG_2558.jpeg\"><img alt=\"IMG_2556.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed88d03790a4d90018d_624b23a98ca876f18e8d5fa6_IMG_2556.jpeg\"><img alt=\"IMG_2557.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed88d037951c890018a_624b23aab2eb39b23843719f_IMG_2557.jpeg\"><img alt=\"IMG_2555.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed88d037966df900184_624b23a946e08c5234db3b05_IMG_2555.jpeg\"><img alt=\"IMG_2559.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed88d03790283900189_624b23a9bdd2fb04c351d9d1_IMG_2559.jpeg\"><img alt=\"IMG_2540.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed88d03790839900185_624b23a9d0c62b69867ba42e_IMG_2540.jpeg\"><img alt=\"IMG_2549.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed88d0379b5e5900187_624b23a929144e22bb84ba7b_IMG_2549.jpeg\"><img alt=\"IMG_2536.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed88d0379456e90017e_624b23aaef15ee3301b3813a_IMG_2536.jpeg\"><img alt=\"IMG_2537.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed88d03797c3d90017c_624b23aa8ca876d4d98d5fa7_IMG_2537.jpeg\"><img alt=\"IMG_2538.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed88d0379121f900182_624b23abafd185f8dc549b15_IMG_2538.jpeg\"><img alt=\"IMG_2541.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed88d0379eef4900186_624b23aab069c0dd09d37624_IMG_2541.jpeg\"><img alt=\"IMG_2542.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed88d03790c1c90017f_624b23aa29144e656284ba97_IMG_2542.jpeg\"><img alt=\"IMG_2543.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed88d037955f990017d_624b23aac694cd7ebd3dc897_IMG_2543.jpeg\"><img alt=\"IMG_2554.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed88d0379b1eb90018b_624b23aad0c62b69a87ba446_IMG_2554.jpeg\">"
  },
  {
    "title": "FinMango to Speak at the University of Akron Finance Day",
    "date": "May 04, 2017",
    "year": 2017,
    "location": "Cleveland, Ohio",
    "excerpt": "A team of students in the Institute for Leadership Advancement in the College of Business Administration will host Finance Day at UA — a financial literacy summit, on Wednesday,...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb8a7acf13c1a429ac_624b0f56afd117e5cbe723da_Untitled%2520design%2520(55).jpeg",
    "body": "<p>A team of students in the Institute for Leadership Advancement in the College of Business Administration will host Finance Day at UA — a financial literacy summit, on Wednesday, May 3, for about 200 freshmen from North High School in Akron.</p><p>The event will take place from 9 a.m. to 1:30 p.m., in E.J. Thomas Performing Arts Hall. Some sessions will be held in other buildings as well. The student team planned all aspects of the day as a Leadership Experience Project.</p><p>Financial professionals from Huntington Bank, SS&amp;G Wealth Management, The Federal Reserve Bank of Cleveland, Tri-C, Bob Gillingham Ford and <strong>FinMango</strong> will be teaching sessions on budgeting, investing and financial decision making.</p><p>\"We created Finance Day at UA to teach high school students about financial literacy in hopes of giving them the knowledge and resources they need to make good financial decisions for their future,\" says Shelby Amatangelo, president of Beta Alpha Psi, Gamma Eta Chapter, and co-founder of Finance Day at UA. “We will teach them how to save and invest their money now, allowing them to build greater financial stability for their future.”</p><p>Source: <a target=\"_blank\" href=\"http://share.uakron.edu/mailAll/Digest/article/1324811\">University of Akron</a></p><img alt=\"Screen Shot 2017-04-29 at 4.00.23 PM.png\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb8a7acf7b37a429ad_624b0f48773b0d3da839f20e_Screen%252BShot%252B2017-04-29%252Bat%252B4.00.23%252BPM.png\"><img alt=\"Screen Shot 2017-04-29 at 4.00.23 PM copy.png\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb846824519ee02112_624b0f472b0a6f106c6b8f31_Screen%252BShot%252B2017-04-29%252Bat%252B4.00.23%252BPM%252Bcopy.png\"><img alt=\"Screen Shot 2017-04-29 at 4.00.27 PM.png\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb8a7acf17d3a429ae_624b0f47851ab81bef834b60_Screen%252BShot%252B2017-04-29%252Bat%252B4.00.27%252BPM.png\">"
  },
  {
    "title": "A Message From The Founder",
    "date": "Apr 17, 2017",
    "year": 2017,
    "location": "Lomé, Togo",
    "excerpt": "Dear Friends,Here at FinMango, we’re passionate about solving the financial literacy crisis of our lifetime.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed736f8bb5a6857dab5_624b0d8d50a5e44d8569913b_Untitled%2520design%2520(53).jpeg",
    "body": "<p>Dear Friends,</p><p>Here at FinMango, we’re passionate about solving the financial literacy crisis of our lifetime. We know that financial literate individuals save, invest, spend, plan, and donate. They develop a better well-being and become more resilient to financial challenges. Accordingly, we wholeheartedly believe that teaching our people to be financially savvy is a gift – one that will keep on giving throughout their lives. </p><p>After officially launching in November of 2016, I am pleased to share that we have had an extraordinary quarter of growth, accomplishments, memorable events, and life changing experiences. And our focus on fun, dynamic, and innovative educational programs have been a huge success.</p><p>To date, we have established financial education programs/operations in Canton, Ohio, Lomé, Togo, and Tijuana, Mexico. Our partners have experience, expertise, motivation, and local knowledge to deliver the best financial education programs possible … one community at a time. Future operations in the works include Brazil, Madagascar, and various organizations in the Northeast Ohio region. </p><p>Overall, It has been a humbling experience and honor to lead this groundbreaking organization into the future. Your dedication and financial support have enabled us to achieve the goals we didn’t think were possible! Thank you! </p>"
  },
  {
    "title": "FinMango Kayak Meeting!",
    "date": "Jul 11, 2017",
    "year": 2017,
    "location": "Field",
    "excerpt": "KAYAK MEETING- FinMango met on paddleboards and kayaks over the weekend! Fun, productive, and conducive for some creative thought.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda49567b2ba6ed816a_624b1525b663cac0157e113c_Untitled%2520design%2520(63).jpeg",
    "body": "<p>KAYAK MEETING- FinMango met on paddleboards and kayaks over the weekend! Fun, productive, and conducive for some creative thought.</p><iframe allowfullscreen=\"true\" frameborder=\"0\" scrolling=\"no\" src=\"https://www.youtube.com/embed/lYxaXgHKQqw\"></iframe><p><br></p><img alt=\"IMG_9111.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda49567b6c2aed816d_624b14c5aaf11a2ec4b6a28a_IMG_9111.jpeg\"><img alt=\"IMG_9781.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda49567b7e96ed8172_624b14c5aaf11a21f2b6a28c_IMG_9781.jpeg\"><img alt=\"IMG_1685.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda49567b936bed816e_624b14c5b9f9534f7b74c7e3_IMG_1685.jpeg\"><img alt=\"IMG_9780.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda49567b67e8ed8176_624b14c69c012359ed9ac448_IMG_9780.jpeg\"><img alt=\"IMG_9792.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda49567ba35fed8174_624b14c501f74e1ac295ecda_IMG_9792.jpeg\"><img alt=\"IMG_3700.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda49567bbb91ed8171_624b14c69404f53ab49486bf_IMG_3700.jpeg\"><img alt=\"IMG_5093.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda49567b5eb3ed816b_624b14c5b367b2ee7b5e64f2_IMG_5093.jpeg\"><img alt=\"IMG_6434.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda49567be69bed8173_624b14c56231cd623a325cb7_IMG_6434.jpeg\"><img alt=\"IMG_9212.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda49567bedbded816c_624b14c5b367b2750e5e64f3_IMG_9212.jpeg\"><img alt=\"IMG_8572.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda49567bc47aed8175_624b14c5ef15ee1854b307df_IMG_8572.jpeg\"><img alt=\"IMG_1116.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda49567b89abed816f_624b14c5b601215ac86ccafe_IMG_1116.jpeg\"><img alt=\"IMG_9788.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda49567b763eed8170_624b14c6689b89e83a8f7a4f_IMG_9788.jpeg\">"
  },
  {
    "title": "Empowering Women in Togo!",
    "date": "Jun 16, 2017",
    "year": 2017,
    "location": "Lomé, Togo",
    "excerpt": "Globally, women play a critical role in their families’ survival and success.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed83857e4d58ef28d84_624b12e5bdd2fb1c93513f3c_Untitled%2520design%2520(59).jpeg",
    "body": "<p>Globally, women play a critical role in their families’ survival and success. The women of Havu, Togo are no different. We understand the multiplier effect that comes with providing women with access to financial education and tools. Accordingly, we're ecstatic to be starting our Women's Empowerment Program in the rural community of Havu.</p><p><br>Mango Maci Woyat will be in charge of the project. She'll be working with Estelle Manou from <a href=\"http://flyforlife.info/\">Fly for Life</a>.</p><p><br></p><img alt=\"IMG_8610.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed93857e45d01f28d87_IMG_8610.jpeg\"><img alt=\"IMG_8616 (1).JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed93857e46e29f28d85_IMG_8616%2B%25281%2529.jpeg\"><img alt=\"IMG_8598.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed93857e41674f28d88_IMG_8598.jpeg\"><img alt=\"IMG_8598.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed93857e41674f28d88_IMG_8598.jpeg\"><img alt=\"IMG_8625.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed93857e472e8f28d86_IMG_8625.jpeg\"><img alt=\"IMG_8627 (1).JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed93857e4d38af28d89_IMG_8627%2B%25281%2529.jpeg\">"
  },
  {
    "title": "FinMango Taught at the JRC!",
    "date": "Aug 25, 2017",
    "year": 2017,
    "location": "Field",
    "excerpt": "Recently, the FinMango team went to the JRC Learning Center to spread some knowledge.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edafe7221683fe4cf06_624b181b806f0ba5dc97134a_Untitled%2520design%2520(67).jpeg",
    "body": "<p><a href=\"https://images.squarespace-cdn.com/content/v1/56be4e4c356fb031229edcbb/1503557887944-OT1DDU2O629GOTCI63BF/IMG_0033.JPG\"><br></a></p><p>Recently, the FinMango team went to the JRC Learning Center to spread some knowledge. </p><p>For the first time, the team taught the kids how to play FinBall, a basketball based game that teaches basic finance lessons. It was a great success!</p><p>In post-lesson quizzes, the kids showed they learned well, scoring almost 100%!!</p><img alt=\"IMG_0033.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edbfe722116cfe4cf18_624b179438e5ca4f4007a207_IMG_0033.jpeg\"><img alt=\"IMG_0741.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edafe722164fae4cf0f_624b1794b5d5fa668a23cbaf_IMG_0741.jpeg\"><img alt=\"IMG_0744.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edafe72211ce9e4cf16_624b17949b8bec59c18da5d2_IMG_0744.jpeg\"><img alt=\"IMG_0746.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edafe72216b7be4cf15_624b17946b21e6d952e6f94b_IMG_0746.jpeg\"><img alt=\"IMG_0766.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edafe72212155e4cf0a_624b17941acc4a54129665ed_IMG_0766.jpeg\"><img alt=\"IMG_0767.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edafe72218474e4cf09_624b1794768d4856e1168413_IMG_0767.jpeg\"><img alt=\"IMG_0768.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edafe72217354e4cf07_624b1795aaf11a362ab6b4ef_IMG_0768.jpeg\"><img alt=\"IMG_0769.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edafe72213b50e4cf08_624b1795b8d8d975e35eceb5_IMG_0769.jpeg\"><img alt=\"IMG_0770.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edafe72210bdbe4cf13_624b179529af84af10408c3a_IMG_0770.jpeg\"><img alt=\"IMG_0772.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edbfe7221e725e4cf19_624b17950fca2b1d8b6dc11f_IMG_0772.jpeg\"><img alt=\"IMG_0777.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edafe7221d346e4cf10_624b1795da4b0d41e747d0b1_IMG_0777.jpeg\"><img alt=\"IMG_0781.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edafe722130d2e4cf0d_624b1795e06e616fd5041c6f_IMG_0781.jpeg\"><img alt=\"IMG_1786.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edafe7221f12fe4cf0b_624b1795c694cdc8c83d597d_IMG_1786.jpeg\"><img alt=\"IMG_1962.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edafe72216b46e4cf0e_624b17953eed1a775cedf7c9_IMG_1962.jpeg\"><img alt=\"IMG_2007.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edafe72210853e4cf17_624b1797b069c0cebfd2f77d_IMG_2007.jpeg\"><img alt=\"IMG_3621.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edafe722111fbe4cf0c_624b1795b9f9536f2d74e37d_IMG_3621.jpeg\"><img alt=\"IMG_5152.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edafe72212f6de4cf14_624b1795bd1805249bfb6334_IMG_5152.jpeg\"><img alt=\"IMG_7045.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edafe7221c034e4cf12_624b1796edab4491b76586cb_IMG_7045.jpeg\"><img alt=\"IMG_7713.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edbfe72211318e4cf1a_624b17951acc4a77809665ef_IMG_7713.jpeg\"><img alt=\"IMG_7807.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edafe722110d7e4cf11_624b179654ce0f5aa9f683d0_IMG_7807.jpeg\">"
  },
  {
    "title": "FinMango Welcomes New Mango: Bob Gillingham",
    "date": "Jun 19, 2017",
    "year": 2017,
    "location": "Cleveland, Ohio",
    "excerpt": "Happy weekend! Just an update, we have a new Board Mango: Robert Gillingham II of Cleveland.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb7d30f91969375bbf_624b13ceb7be89a5cd92004a_Untitled%2520design%2520(61).jpeg",
    "body": "<p><br><br></p><p>Happy weekend! Just an update, we have a new Board Mango: Robert Gillingham II of Cleveland. He's the owner of Gillingham Ford and his involvement in the community has spanned over 40 years, spreading his knowledge of financial literacy to local high school students. His passion amazes everyone he meets! He was introduced to Scott Glasgow (Executive Mango) at the University of Akron Finance Day. Also big thanks again to Shelby Amatangelo (on left) for hosting and inviting us to the UA Finance Day! We're very excited to have Bob on board and look forward to his involvement with us!</p><p><br></p>"
  },
  {
    "title": "FinBall: Our Soon-To-Be FinMango Inspired Basketball Game!",
    "date": "Jun 18, 2017",
    "year": 2017,
    "location": "Field",
    "excerpt": "We had a ball last night coming up with some great ideas for FinBall! We'd like to give a big thank you to Isiah Elliott and KimAldrin Pastor for their basketball skills,...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed936f8bb5d2e57dab8_624b134a6231cdacf5325460_Untitled%2520design%2520(60).jpeg",
    "body": "<p><br><br></p><p>We had a ball last night coming up with some great ideas for FinBall! We'd like to give a big thank you to Isiah Elliott and KimAldrin Pastor for their basketball skills, knowledge, and great ideas to help us find even more ways to make financial education fun and easy! Go team FinMango!</p><p><br></p>"
  },
  {
    "title": "FinMango Taught at the University of Akron Finance Day!",
    "date": "Nov 01, 2017",
    "year": 2017,
    "location": "Cleveland, Ohio",
    "excerpt": "Mango Bob and Scott both presented at the University of Akron Finance Day on October 31st! Bob Spoke on Investing and Scott spoke about budgeting.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edba7f8b7461710a498_624b22bb3eed1a1710ee4b73_Untitled%2520design%2520(73).jpeg",
    "body": "<p>Mango Bob and Scott both presented at the University of Akron Finance Day on October 31st! Bob Spoke on Investing and Scott spoke about budgeting. </p><p>The event hosted <strong>500+ high school students</strong> from Firestone and Buchtel and included financial professionals from FinMango, Gillingham Ford, Cleveland Clinic, Hudson Financial Advisors, McDonald Partners, SS&amp;G Wealth Management, and Westfield Bank. Photos are coming soon!</p><p><a href=\"https://images.squarespace-cdn.com/content/v1/56be4e4c356fb031229edcbb/1509591630049-41B855TXINOB0OCNZ9WP/IMG_4830.JPG\"><br></a></p><img alt=\"IMG_4830.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edba7f8b76ede10a49a_624b22c3543c28a3952c0d77_IMG_4830.jpeg\"><img alt=\"IMG_6618.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edba7f8b708a810a49c_624b22c31278878543c5bbf6_IMG_6618.jpeg\"><img alt=\"IMG_3106.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edba7f8b75f9310a49b_624b22c4b5d5faa19f240c97_IMG_3106.jpeg\"><img alt=\"IMG_5991.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edba7f8b76a6110a499_624b22c4afd1850806549597_IMG_5991.jpeg\"><p><br></p>"
  },
  {
    "title": "FinMango Taught at the UA Finance Day!",
    "date": "May 10, 2017",
    "year": 2017,
    "location": "Cleveland, Ohio",
    "excerpt": "FinMango taught and spoke at the University of Akron Finance Day!The Financial Literacy Summit on May 3rd hosted over 200 North High School students and included financial...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda8468247657e02110_624b0fb3bdd2fb1504512040_Untitled%2520design%2520(56).jpeg",
    "body": "<p>FinMango taught and spoke at the University of Akron Finance Day!</p><p>The Financial Literacy Summit on May 3rd hosted over 200 North High School students and included financial professionals from Huntington Bank, SS&amp;G Wealth Management, The Federal Reserve Bank of Cleveland, Tri-C, Bob Gillingham Ford and FinMango to teach sessions on budgeting, investing and financial decision making. FinMango also served on the panel. </p><p>A message from our founder regarding the event:</p><p>I want to personally congratulate the founders of the University of Akron Finance Day on successfully planning, organizing, and implementing such a FANTASTIC event! </p><p>Your abilities to organize and implement such an event is truly extraordinary and FinMango is honored to have had the opportunity to be part of something so special and value adding. </p><p>I've said it before and I'll say it again... events like these don't just create value, they create compounding value! The teaching of our kids to be financially savvy truly is a gift... a gift that'll keep on paying dividends throughout their lives!</p><p>THANK YOU Shelby, MarySarah and Thomas on the Mission, Vision &amp; Execution of the University of Akron Finance Day!</p><p>In regards,</p><p>Scott M. Glasgow</p><img alt=\"student-union-visit-day.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb846824d32ae02111_624b0fb4543c2861922b744c_student-union-visit-day.jpeg\"><img alt=\"IMG_6470.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb8468247b18e02113_624b0fb354ce0fec14f643a3_IMG_6470.jpeg\"><img alt=\"IMG_6458.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb84682446b9e02115_624b0fb4dccb6222558d22c6_IMG_6458.jpeg\"><img alt=\"IMG_6459.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb8468244884e02114_624b0fb354ce0fdfeef643a4_IMG_6459.jpeg\"><img alt=\"IMG_5223.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb8468244d51e02116_624b0fb3653d845b136e1cc8_IMG_5223.jpeg\"><p><a href=\"https://images.squarespace-cdn.com/content/v1/56be4e4c356fb031229edcbb/1493970310885-4IKQ7R5K6HZ3WL7WGZQ2/Screen+Shot+2017-04-29+at+4.00.23+PM+copy.png\">View fullsize</a></p><img alt=\"Screen Shot 2017-04-29 at 4.00.23 PM copy.png\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb846824519ee02112_624b0f472b0a6f106c6b8f31_Screen%252BShot%252B2017-04-29%252Bat%252B4.00.23%252BPM%252Bcopy.png\">"
  },
  {
    "title": "GREAT NEWS! FinMango is now a 501(c)(3) Non-profit!",
    "date": "Jul 08, 2017",
    "year": 2017,
    "location": "Field",
    "excerpt": "GREAT NEWS!! After a grueling 6 months, we're proud to announce that we have officially been approved by the Internal Revenue Service as a tax exempt, charitable 501(c)(3)...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb41aa35c6a5028bbb_624b14749404f5b7e8948019_Untitled%2520design%2520(62).jpeg",
    "body": "<p><br><br></p><p>GREAT NEWS!! After a grueling 6 months, we're proud to announce that we have officially been approved by the Internal Revenue Service as a tax exempt, charitable 501(c)(3) non-profit organization! This means that FinMango is now a nationally recognized non-profit. A great job by all the Mangos on the team, we're excited to see where we go!</p><p><br></p>"
  },
  {
    "title": "FinMango at Harvard University",
    "date": "Oct 15, 2017",
    "year": 2017,
    "location": "Field",
    "excerpt": "Mango and were ecstatic to have the opportunity to discuss Financial Literacy and Inclusion with the brightest mind in the field and at the BEST University in the world: Harvard!...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9a9f4374c835a0db4_624b1f0a54ce0f3c11f6c81c_Untitled%2520design%2520(70).jpeg",
    "body": "<p>Mango and &nbsp;were ecstatic to have the opportunity to discuss Financial Literacy and Inclusion with the brightest mind in the field and at the BEST University in the world: Harvard! The team also had the opportunity to meet Steve Ballmer, the former CEO of Microsoft and the current owner of the LA Clippers.</p><p><a href=\"https://images.squarespace-cdn.com/content/v1/56be4e4c356fb031229edcbb/1508112286513-NBYDT2NFG50OHWJDKR3N/IMG_1890.JPG\"><br></a></p><img alt=\"IMG_1890.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9a9f43710465a0dba_624b1f1450add84c4af8051e_IMG_1890.jpeg\"><img alt=\"IMG_7683.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9a9f437a7e65a0dbf_624b1f146c4e8b2e8c0cd627_IMG_7683.jpeg\"><img alt=\"IMG_1909.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9a9f43781355a0dbe_624b1f145d06af57d30e3a7b_IMG_1909.jpeg\"><img alt=\"IMG_1914.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9a9f437d4fc5a0db8_624b1f14181eaa520f009847_IMG_1914.jpeg\"><img alt=\"IMG_0066.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9a9f43793c45a0dbc_624b1f14dccb6223828daca7_IMG_0066.jpeg\"><img alt=\"IMG_3379.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9a9f437c0395a0dbd_624b1f1429144efb41848e71_IMG_3379.jpeg\"><img alt=\"IMG_0657.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9a9f43744b25a0db7_624b1f167982dfa45234c608_IMG_0657.jpeg\"><img alt=\"IMG_3734.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9a9f437bfe75a0db9_624b1f1543042ae05436ff3f_IMG_3734.jpeg\"><img alt=\"IMG_4159.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9a9f4370aeb5a0db6_624b1f1528153766babe1863_IMG_4159.jpeg\"><img alt=\"IMG_5252.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9a9f4376d4c5a0db5_624b1f15df2471d2970d58f5_IMG_5252.jpeg\"><img alt=\"IMG_7352.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9a9f437a5095a0dbb_624b1f1510ffbba4c01669f6_IMG_7352.jpeg\"><img alt=\"GPTempDownload 2.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed9a9f43747005a0dc0_624b1f16aaf11a635fb6e9e5_GPTempDownload%252B2.jpeg\">"
  },
  {
    "title": "FinMango Taught the Money Cycle in Togo!",
    "date": "Sep 08, 2017",
    "year": 2017,
    "location": "Lomé, Togo",
    "excerpt": "Last Friday our partners Fly for Life in Togo traveled to the Tohoun community! They went on a mission to replicate our Money Cycle lesson to the kids of Tohoun, and with no...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340daf3086d5402e_624b1861768d481ed4168e6c_Untitled%2520design%2520(68).jpeg",
    "body": "<p>Last Friday our partners <a href=\"https://www.facebook.com/flyforlifeworld/?fref=mentions\">Fly for Life</a>&nbsp;in Togo traveled to the Tohoun community! They went on a mission to replicate our Money Cycle lesson to the kids of Tohoun, and with no doubt, they succeeded! Amazing work teaching financial literacy!</p><img alt=\"IMG_1415.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340daf9816d54036_624b186bb6012194bc6cdf64_IMG_1415.jpeg\"><img alt=\"IMG_1426.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340daf7f0ad54044_624b186bb601212d236cdf65_IMG_1426.jpeg\"><img alt=\"IMG_1416.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340daf8c63d54043_624b186bb8d8d945f35ed648_IMG_1416.jpeg\"><img alt=\"IMG_1422.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340daff6c6d54040_624b186b1acc4a1ca0967082_IMG_1422.jpeg\"><img alt=\"IMG_1430.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340daf1e7fd54035_624b186bdc4e8f288a3eb64c_IMG_1430.jpeg\"><img alt=\"IMG_1420.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340dafe3c9d54038_624b186b806f0b207a971814_IMG_1420.jpeg\"><img alt=\"IMG_1427.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340daf929ed5403a_624b186b6231cd13d5326c63_IMG_1427.jpeg\"><img alt=\"IMG_1421.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340daff119d54037_624b186b923403bba2f01bc9_IMG_1421.jpeg\"><img alt=\"IMG_1428.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340daf4c42d5403f_624b186bafd18561ac545433_IMG_1428.jpeg\"><img alt=\"IMG_1418.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340daf2992d5403c_624b186b2869fc4672e91d18_IMG_1418.jpeg\"><img alt=\"IMG_1423.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340dafb082d54046_624b186b9b8bece5ab8dab39_IMG_1423.jpeg\"><img alt=\"IMG_1429.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340dafc1b5d54039_624b186b2d15c293be7dd030_IMG_1429.jpeg\"><img alt=\"IMG_1424.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340daf64cdd54045_624b186ce679db618c7e4c20_IMG_1424.jpeg\"><img alt=\"IMG_1413.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340daf46dad54041_624b186cafd185eb49545434_IMG_1413.jpeg\"><img alt=\"IMG_1417.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340daf60b7d54042_624b186c6231cd555d326c64_IMG_1417.jpeg\"><img alt=\"IMG_1419.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340daff2e9d5403b_624b186cb5d5faf33323d4ef_IMG_1419.jpeg\"><img alt=\"IMG_1412.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340daf1631d5403d_624b186cb5dacfbd3317419d_IMG_1412.jpeg\"><img alt=\"IMG_1408.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edb340daf09f0d5403e_624b186c0e98830e0f25a9c3_IMG_1408.jpeg\">"
  },
  {
    "title": "Introducing the FinMango MONEY LOOP!",
    "date": "Aug 03, 2017",
    "year": 2017,
    "location": "Field",
    "excerpt": "MAKE IT: Before entering the money loop, we emphasize the importance of earning money.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edda9f437f62f5a0dd6_624b1770bd1805327cfb6291_Untitled%2520design%2520(66).jpeg",
    "body": "<h2><strong>MAKE IT: </strong></h2><p>Before entering the money loop, we emphasize the importance of earning money. Without making it, you can’t save, plant, spend or donate it. </p><h2><strong>SAVE IT:</strong></h2><p>There are times when we’ll run out of money when we need it most. Other times, we’ll want something expensive that we just don’t have enough for. That’s why it’s important to teach our kids to set aside money that they don’t spend right away. &nbsp;</p><h2><strong>PLANT IT:</strong></h2><p>After saving your money, it's important to MANAGE &amp; GROW your money! We teach the kids to set goals for what they want to save for and how much they want to save. Keep track of how much they’re putting away, and watch their money grow. With patience and willpower, kids are surprised by how much money they can put away. And when they do, they feel good knowing that they’ll always have some for when they really need it.</p><h2><strong>SPEND IT:</strong></h2><p>Books, toys, games, ice cream? It’s easy to spend. So we make sure the kids understand the importance to keep track of how much they spend and how much they have left. We can’t buy everything, so we teach them to spend their money wisely and on things that they really want and need. </p><h2><strong>DONATE IT:</strong></h2><p>There are so many fun things for us to spend our money on that we might want to use it all on ourselves. But one of the greatest ways to spend our money is to share it with others. Whether it’s a gift for mom or giving to people that need help, we make sure the kids know that they can use their money to bring happiness and comfort to others. Just like sharing a toy or food with a friend, being generous with our money helps us connect to the people around us and let them know we care. </p>"
  },
  {
    "title": "The Money Cycle in Havu, Togo!",
    "date": "Sep 18, 2017",
    "year": 2017,
    "location": "Lomé, Togo",
    "excerpt": "Huge shoutout to our partners Fly For Life! They taught the money cycle to the kids of the Havu Community in a local home! They never fail to teach the kids in a fun environment!...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee05acfc43ec963e9e7_624b1a7ab5dacf7f37174a49_Untitled%2520design%2520(69).jpeg",
    "body": "<p>Huge shoutout to our partners <a href=\"http://flyforlifeworld.org\">Fly For Life</a>! They taught the money cycle to the kids of the Havu Community in a local home! They never fail to teach the kids in a fun environment! Make it, save it, plant it, spend it, donate it! 😎 •</p><img alt=\"FullSizeRender.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee15acfc46ec863e9ea_624b1a316b21e6aa9de709c1_FullSizeRender.jpeg\"><img alt=\"IMG_1625.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee15acfc450e763e9e9_624b1a3146e08c1137daeeb5_IMG_1625.jpeg\"><img alt=\"IMG_1624.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee15acfc46afd63e9ec_624b1a316231cddd973276b9_IMG_1624.jpeg\"><img alt=\"IMG_1623.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee15acfc47ae363e9f2_624b1a31d0c62b23827b6545_IMG_1623.jpeg\"><img alt=\"IMG_1626.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee15acfc427cb63e9eb_624b1a311278870e0cc5690a_IMG_1626.jpeg\"><img alt=\"IMG_1627.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee15acfc44ed863e9ef_624b1a311dcbf255c45c1f6d_IMG_1627.jpeg\"><img alt=\"IMG_1487.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee15acfc43dbe63e9ed_624b1a316231cd719b3276ba_IMG_1487.jpeg\"><img alt=\"IMG_1494.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee15acfc4cb1b63e9f1_624b1a31bdd2fb823d517ed7_IMG_1494.jpeg\"><img alt=\"IMG_1554.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee15acfc4648a63e9e8_624b1a311293e46d0278e338_IMG_1554.jpeg\"><img alt=\"IMG_1598.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee15acfc4fd3163e9ee_624b1a31f0b0156257c1071b_IMG_1598.jpeg\"><img alt=\"IMG_1602.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee15acfc42b6963e9f0_624b1a31e679db48347e56d1_IMG_1602.jpeg\"><img alt=\"IMG_1606.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee15acfc411c363e9f3_624b1a311dcbf27ab35c1f6e_IMG_1606.jpeg\">"
  },
  {
    "title": "University of Akron Finance Day Photos",
    "date": "Nov 15, 2017",
    "year": 2017,
    "location": "Field",
    "excerpt": "A big thank you to The University of Akron for hosting such a fantastic event! We reached 500+ local high school students.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1afdabf30bd7565d1_624b2512689b895f0c900612_Untitled%2520design%2520(75).jpeg",
    "body": "<p>A big thank you to The University of Akron for hosting such a fantastic event! We reached <strong>500+</strong> local high school students. Mango Bob taught investing and Mango Scott taught budgeting.&nbsp;</p><p><a href=\"https://images.squarespace-cdn.com/content/v1/56be4e4c356fb031229edcbb/1510639040245-K26Z9KN66QQ89VFUKR5J/IMG_2615.JPG\"><br></a></p><img alt=\"IMG_2615.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1afdabf6fa77565e4_624b252f8ca876371c8d71c5_IMG_2615.jpeg\"><img alt=\"IMG_2616.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1afdabf53e77565d8_624b252fda4b0d2584482d82_IMG_2616.jpeg\"><img alt=\"IMG_2617.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1afdabf17b97565db_624b252fe679dbceb37ebc48_IMG_2617.jpeg\"><img alt=\"IMG_2618.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1afdabfa4747565d5_624b252fb367b2eaec5ee0e4_IMG_2618.jpeg\"><img alt=\"IMG_2619.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1afdabf7e1d7565e1_624b25305955422ccbfbf1fc_IMG_2619.jpeg\"><img alt=\"IMG_2620.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1afdabf8ae37565e5_624b252feaed192df0e12000_IMG_2620.jpeg\"><img alt=\"IMG_2621.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1afdabf972c7565e0_624b253027c30c07ae4d7651_IMG_2621.jpeg\"><img alt=\"IMG_2622.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1afdabf1db47565d3_624b2530484cbc192d538308_IMG_2622.jpeg\"><img alt=\"IMG_2623.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1afdabf80a57565d6_624b25301acc4ac39596d0f1_IMG_2623.jpeg\"><img alt=\"IMG_2624.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1afdabf72d57565d7_624b2530b5d5fae9fb242716_IMG_2624.jpeg\"><img alt=\"IMG_2626.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1afdabf5b867565e3_624b2530e06e61724f049491_IMG_2626.jpeg\"><img alt=\"IMG_2627.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1afdabf0da27565d9_624b2530181eaa46bd00c780_IMG_2627.jpeg\"><img alt=\"IMG_2628.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1afdabf4ade7565d2_624b2530c694cd33213dd75e_IMG_2628.jpeg\"><img alt=\"IMG_2629.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1afdabf657d7565dd_624b253055e07d0cad4dfde0_IMG_2629.jpeg\"><img alt=\"IMG_2630.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1afdabfcf8e7565d4_624b25302869fc7ea5e98e2a_IMG_2630.jpeg\"><img alt=\"IMG_2631.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1afdabf7ff97565df_624b2530ba341f409533eddb_IMG_2631.jpeg\"><img alt=\"IMG_2632.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1afdabf910c7565de_624b25304a7725f742705cda_IMG_2632.jpeg\"><img alt=\"IMG_2634.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1afdabfff2f7565dc_624b2530bd18053a23fbb0a5_IMG_2634.jpeg\"><img alt=\"IMG_2635.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1afdabf16ae7565da_624b253055e07db0db4dfde2_IMG_2635.jpeg\"><img alt=\"IMG_2637.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1afdabf3a8f7565e2_624b253054ce0fcce7f6e892_IMG_2637.jpeg\">"
  },
  {
    "title": "Mango Warriors",
    "date": "Jul 25, 2017",
    "year": 2017,
    "location": "Field",
    "excerpt": "FinMango team takes on Warrior Dash - super fun team building exercise!.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee0930301f9e34b9986_624b16dd181eaa4c1000673f_Untitled%2520design%2520(65).jpeg",
    "body": "<p>FinMango team takes on Warrior Dash - super fun team building exercise!</p><img alt=\"20229421_847673432067822_7008350873114853443_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee093030149a54b998d_624b16abaaf11a3fecb6afc5_20229421_847673432067822_7008350873114853443_n.jpeg\"><img alt=\"20264593_847673508734481_3688195463320374134_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1930301691b4b998f_624b16abf0b015d21ac0e4ed_20264593_847673508734481_3688195463320374134_n.jpeg\"><img alt=\"20374534_847673542067811_7582382172215243778_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee0930301ba244b998c_624b16ab55e07d7d3c4d96df_20374534_847673542067811_7582382172215243778_n.jpeg\"><img alt=\"20294069_847673628734469_378342053532764906_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee0930301b4814b998e_624b16ab03d6a5665fea41c1_20294069_847673628734469_378342053532764906_n.jpeg\"><img alt=\"20258068_847673272067838_1067004085029703032_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee19303015d924b9990_624b16ab691db8be2003b3f9_20258068_847673272067838_1067004085029703032_n.jpeg\"><img alt=\"20374752_847673328734499_4750540061905930658_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee193030118684b9992_624b16ac695c130a7b8183f4_20374752_847673328734499_4750540061905930658_n.jpeg\"><img alt=\"20258051_847673388734493_6163355232390058546_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee19303011cda4b9991_624b16ab806f0b64139707c4_20258051_847673388734493_6163355232390058546_n.jpeg\"><img alt=\"20245704_847672925401206_7501175839069255443_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee0930301450c4b998b_624b16ab6b21e6bf4be6f195_20245704_847672925401206_7501175839069255443_n.jpeg\">"
  },
  {
    "title": "THANK YOU Malone Enactus!",
    "date": "Apr 21, 2017",
    "year": 2017,
    "location": "Field",
    "excerpt": "THANK YOU Malone Enactus for the generous gift of Piggy Banks and Sunglasses! Your support means so much, not only to the organization, but to the kids you are empowering! 😎The...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee0f905e794c70750d3_624b0ec94a2bef870ddf0a14_Untitled%2520design%2520(54).jpeg",
    "body": "<h3><strong>THANK YOU Malone Enactus for the generous gift of Piggy Banks and Sunglasses! Your support means so much, not only to the organization, but to the kids you are empowering!</strong> 😎</h3><p>The sunglasses illustrate a fun, energetic and positive learning environment. While the piggy banks remind the kids to set goals for what they want to save for and how much they want to save.</p><img alt=\"18033932_794370744064758_2314561732476783371_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee0f905e74b3e0750d6_624b0ed4de671b1a4865295c_18033932_794370744064758_2314561732476783371_n.jpeg\"><p><a href=\"https://images.squarespace-cdn.com/content/v1/56be4e4c356fb031229edcbb/1492807602143-20LNQVEG8RP5JQUK2539/17884345_794372250731274_4397043390722666501_n.jpg\">View fullsize</a></p><img alt=\"17884345_794372250731274_4397043390722666501_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee0f905e7e71b0750d7_624b0ed4afd117812ae72172_17884345_794372250731274_4397043390722666501_n.jpeg\"><p><a href=\"https://images.squarespace-cdn.com/content/v1/56be4e4c356fb031229edcbb/1492807604053-JC8DZ37VZN72LW1IE2HE/18011001_794372324064600_3620060580783904554_n.jpg\">View fullsize</a></p><img alt=\"18011001_794372324064600_3620060580783904554_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee0f905e745280750d4_624b0ed4f86f4d4708eb88d4_18011001_794372324064600_3620060580783904554_n.jpeg\"><p><a href=\"https://images.squarespace-cdn.com/content/v1/56be4e4c356fb031229edcbb/1492807626011-915OEKQU1Q6Z9ZFVW9LL/18010668_794370480731451_2962499415365701171_n.jpg\">View fullsize</a></p><img alt=\"18010668_794370480731451_2962499415365701171_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee0f905e74cb10750d5_624b0ed4a2094e56be09cb53_18010668_794370480731451_2962499415365701171_n.jpeg\">"
  },
  {
    "title": "Women's Financial Responsibility Lesson Prep",
    "date": "Oct 24, 2017",
    "year": 2017,
    "location": "Lomé, Togo",
    "excerpt": "This week, our partners at Fly For Life will be teaching a FinMango program to the women of Havu, Togo.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee2f905e716890750e8_624b204354ce0fd771f6d10e_Untitled%2520design%2520(71).jpeg",
    "body": "<p>This week, our partners at Fly For Life will be teaching a FinMango program to the women of Havu, Togo. This lesson will specifically be about financial responsibility and will be explaining the importance of saving and spending wisely. Ryou Nagai (Founder of GMP International) from Japan lead the conversation.&nbsp;</p><iframe allowfullscreen=\"true\" frameborder=\"0\" scrolling=\"no\" src=\"https://www.youtube.com/embed/I8qPxDU0Cbg\"></iframe><p><br></p><img alt=\"IMG_2165.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee2f905e766e30750eb_624b2014edab44b7a265b8f8_IMG_2165.jpeg\"><img alt=\"IMG_2164.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee2f905e70cdd0750ea_624b201427c30c48e04d4f32_IMG_2164.jpeg\"><img alt=\"IMG_2166.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee2f905e744b30750e9_624b2014dccb6220908daf08_IMG_2166.jpeg\">"
  },
  {
    "title": "Women's Responsibility Lesson in Havu, Togo",
    "date": "Oct 28, 2017",
    "year": 2017,
    "location": "Lomé, Togo",
    "excerpt": "Thank you to Estelle and our partner Fly for Life who just traveled to Havu, Togo to teach a women’s financial responsibility and budgeting program! This will help them improve...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee2c5306eab3fe848c5_624b225c6b21e6444be75b7b_Untitled%2520design%2520(72).jpeg",
    "body": "<p>Thank you to <a href=\"https://www.facebook.com/estelle.manou?fref=mentions\">Estelle</a> and our partner <a href=\"https://www.facebook.com/flyforlifeworld/?fref=mentions\">Fly for Life</a> who just traveled to Havu, Togo to teach a women’s financial responsibility and budgeting program! This will help them improve and stabilize the women’s cooperative!</p><p><a href=\"https://images.squarespace-cdn.com/content/v1/56be4e4c356fb031229edcbb/1509167771691-1QJEEBHDP96TNAD6141U/IMG_2387.JPG\"><br></a></p><img alt=\"IMG_2387.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee2c5306e50d3e848c8_624b2247da4b0d4b64481ae5_IMG_2387.jpeg\"><img alt=\"IMG_2388.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee2c5306e0741e848ca_624b2248aaf11a5f24b70414_IMG_2388.jpeg\"><img alt=\"IMG_2389.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee2c5306e0158e848cb_624b2247df2471e43d0d6a7c_IMG_2389.jpeg\"><img alt=\"IMG_2391.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee2c5306e0431e848c9_624b224754ce0fbb63f6dede_IMG_2391.jpeg\">"
  },
  {
    "title": "We're Teaching Financial Literacy in Notse, Togo!",
    "date": "Jun 13, 2017",
    "year": 2017,
    "location": "Lomé, Togo",
    "excerpt": "Wow! Look at the progress in Togo. Our partners at Fly for Life have done an extraordinary job . The team recently visited San Francesco College of Notse and sucessfully partnered...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee27465c848c6ee0ad6_624b11e0aaf11a0a92b68b0a_Untitled%2520design%2520(58).jpeg",
    "body": "<p>Wow! Look at the progress in Togo. Our partners at <a href=\"http://flyforlife.info/\">Fly for Life</a> have done an extraordinary job . The team recently visited San Francesco College of Notse and sucessfully partnered with the school and taught students about financial literacy. Vamos!</p><img alt=\"18740001_815723418596157_8947789689381227435_n (1).jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee27465c805a6ee0ade_624b11a9b069c00b16d2d106_18740001_815723418596157_8947789689381227435_n%252B%2525281%252529.jpeg\"><img alt=\"18739626_815723421929490_6091206858446225029_n (1).jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee27465c8d372ee0adc_624b11a9691db85c5d039050_18739626_815723421929490_6091206858446225029_n%252B%2525281%252529.jpeg\"><p><a href=\"https://images.squarespace-cdn.com/content/v1/56be4e4c356fb031229edcbb/1496610436317-6DGSYIPVC70ZJT0YUW6V/18835856_815723458596153_2573063334078115088_n+%281%29.jpg\">View fullsize</a></p><img alt=\"18835856_815723458596153_2573063334078115088_n (1).jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee27465c882ffee0ada_624b11a90e9883104d257991_18835856_815723458596153_2573063334078115088_n%252B%2525281%252529.jpeg\"><p><a href=\"https://images.squarespace-cdn.com/content/v1/56be4e4c356fb031229edcbb/1496610791481-G2MPSJA5KZLCHN4XVFPJ/IMG_8444.JPG\">View fullsize</a></p><img alt=\"IMG_8444.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee27465c8c4eaee0adb_624b11a9b8d8d997b65e999f_IMG_8444.jpeg\"><p><a href=\"https://images.squarespace-cdn.com/content/v1/56be4e4c356fb031229edcbb/1496610793957-RVKSR16NPI9NRLPENJMI/IMG_8443.JPG\">View fullsize</a></p><img alt=\"IMG_8443.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee27465c86d46ee0add_624b11a90e98836e6b257992_IMG_8443.jpeg\">"
  },
  {
    "title": "We Taught at a COOL School! BMHS!",
    "date": "Sep 21, 2017",
    "year": 2017,
    "location": "Field",
    "excerpt": "Check out Mango Bob and Mr. Mango (Scott) in their recent cameo on Fox 8 News featuring Berea-Midpark High School as a Cool School!",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1a39a194e74364fa7_624b1afa50add8235bf7e7b8_SMH%2520%2520_079%2520.jpeg",
    "body": "<p>Check out <a href=\"https://finmango.org/bob\">Mango Bob</a> and <a href=\"https://finmango.org/scott\" target=\"_blank\">Mr. Mango</a> (Scott) in their recent cameo on <a href=\"http://fox8.com/2017/10/06/berea-midpark-high-school-is-a-cool-school/\" target=\"_blank\">Fox 8 News</a> featuring Berea-Midpark High School as a Cool School!&nbsp;</p><iframe allowfullscreen=\"true\" frameborder=\"0\" scrolling=\"no\" src=\"https://www.youtube.com/embed/agm8O9-uCw4\"></iframe>"
  },
  {
    "title": "Setting Money Goals in Togo",
    "date": "Dec 18, 2017",
    "year": 2017,
    "location": "Lomé, Togo",
    "excerpt": "FinMango was proud to serve as a technical partner in Togo over the weekend.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee0789b5e872b653c7b_624b267746e08c18a4db5b96_Untitled%2520design%2520(77).jpeg",
    "body": "<p>FinMango was proud to serve as a technical partner in Togo over the weekend. The Fly for Life team taught over 50 kids about the importance of saving and setting money goals. Each student was given a culturally relevant piggy bank at the conclusion of each lesson. Thanks Essodong Atana and Estelle Manou for leading the sustainable tourism trip and teaching the lesson!</p><p><a href=\"https://images.squarespace-cdn.com/content/v1/56be4e4c356fb031229edcbb/1513613206263-UUM6C1DVGE05BSVAYL5K/IMG_3505.JPG\"><br></a></p><img alt=\"IMG_3505.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee0789b5e2e4f653c7c_624b264a5d06af56380e7749_IMG_3505.jpeg\"><img alt=\"IMG_3501.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee0789b5e9610653c7e_624b264aef15eef56eb39688_IMG_3501.jpeg\"><img alt=\"IMG_3503.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee0789b5e2375653c7d_624b264adf2471a1530d99fb_IMG_3503.jpeg\"><img alt=\"IMG_3504.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee0789b5e0249653c83_624b264ab45fb4d0894544ab_IMG_3504.jpeg\"><img alt=\"IMG_3509.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee0789b5e205a653c7f_624b264d28153741fdbe5018_IMG_3509.jpeg\"><img alt=\"IMG_3511.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee0789b5eab31653c82_624b264b1dcbf258c65c88a4_IMG_3511.jpeg\"><img alt=\"IMG_3512.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee0789b5ebf19653c80_624b264bbd180585d0fbb5fe_IMG_3512.jpeg\"><img alt=\"IMG_3510.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee0789b5ea6dd653c81_624b264b1acc4aabd196d501_IMG_3510.jpeg\"><img alt=\"24740267_10213523338450805_384484765_o.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee0789b5e2917653c84_624b264a9234033bdcf083e3_24740267_10213523338450805_384484765_o.jpeg\">"
  },
  {
    "title": "Update from Togo! #FinMango",
    "date": "Jul 22, 2017",
    "year": 2017,
    "location": "Lomé, Togo",
    "excerpt": "Update from our partner in Togo! The surveying trip was great and officially launched the first step in our Women's & Farmer's Empowerment Programs in the rural village of Havu.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1ad85c60aaee8abb7_624b1650281537d9d8bdda64_Untitled%2520design%2520(64).jpeg",
    "body": "<p>Update from our partner in Togo! The surveying trip was great and officially launched the first step in our Women's &amp; Farmer's Empowerment Programs in the rural village of Havu.</p><p>An interesting story from Jeremies (Executive Director of Fly For Life):</p><p>\"We had to stop 2 hours at least when we were 50 km from Havu. Our car broke. Our transmission (not sure it's name in English) broke down. We were lucky because today is Sunday and it's difficult to get a repairer as they don't work. But 2 years ago with some volunteers Fly for Life project brought some used sport equipments to the school of the village in which we are actually called Amouspukpe. Many people recognized me. i was amazed by the great solidarity show by the people. They went away 20 km to bring the repairer. We got it fixed and we are on road again. That is why I love this volunteer job. It's always important not to give up no matter the situation that occur. I can't wait to see smiles on people's face in Havu as they are waiting for us. \"</p><img alt=\"20229354_845274015641097_2278046512350751359_n (1).jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1ad85c6e40be8abc4_624b1622695c132454817f60_20229354_845274015641097_2278046512350751359_n%252B%2525281%252529.jpeg\"><img alt=\"20155969_845274035641095_530234539738255825_n (1).jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1ad85c62cebe8abc7_624b1621f0b015dc87c0e0bf_20155969_845274035641095_530234539738255825_n%252B%2525281%252529.jpeg\"><img alt=\"20228580_845274045641094_2272820547575148196_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1ad85c64a70e8abc8_624b162246e08c1e5edacffe_20228580_845274045641094_2272820547575148196_n.jpeg\"><img alt=\"20155705_845274188974413_7802293349811915442_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1ad85c6f724e8abca_624b16222639614abdd94a1a_20155705_845274188974413_7802293349811915442_n.jpeg\"><img alt=\"20156081_845274285641070_1113615356570575849_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1ad85c66c6de8abc9_624b162139fd925b11e2f1dc_20156081_845274285641070_1113615356570575849_n.jpeg\"><img alt=\"20108265_845274315641067_4788785436270459102_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1ad85c62056e8abc5_624b162203d6a56641ea3d89_20108265_845274315641067_4788785436270459102_n.jpeg\"><img alt=\"20228786_845274438974388_46363886515058821_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1ad85c6012be8abc6_624b1622b9f9532ee674d2d9_20228786_845274438974388_46363886515058821_n.jpeg\"><img alt=\"20228679_845274515641047_2453919516833009227_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee1ad85c62625e8abc3_624b162345d45e6dbb09ab95_20228679_845274515641047_2453919516833009227_n.jpeg\">"
  },
  {
    "title": "We're Teaching Financial Literacy in Tohoun, Togo!",
    "date": "Jun 01, 2017",
    "year": 2017,
    "location": "Lomé, Togo",
    "excerpt": "A huge thank you to the Fly for Life team for making our work possible! Because of their organization, we were able to reach the community of Tohoun, a remote rural village in...",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee2c5306eee95e848bf_624b115f6c4e8b4f3c0c511d_Untitled%2520design%2520(57).jpeg",
    "body": "<p>A huge thank you to the <a href=\"http://flyforlife.info/\">Fly for Life</a> team for making our work possible! Because of their organization, we were able to reach the community of Tohoun, a remote rural village in Togo.</p><p>After a long 8 hour drive in a <a href=\"https://www.merriam-webster.com/dictionary/mammy%20wagon\">mammy wagon</a> from the capital city, Lomé, the team finally reached Tohoun. We taught the kids of Tohoun to recognize the value of self-control in relation to spending and to recognize the differences between purchases of need and purchases of want.</p><p>We look forward to continuing our work in Tohoun as we continue to grow to new communities. Thank You <a href=\"http://flyforlife.info/\">Fly For Life</a> for doing a fantastic job in implementing our program in such a fun, energetic and entertaining way… the #FinMangoWay 😎.</p><img alt=\"18557358_811849802316852_4639417324183244799_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee2c5306e7aa5e848c4_624b10d554ce0f87a5f64b63_18557358_811849802316852_4639417324183244799_n.jpeg\"><img alt=\"18556345_811849798983519_3237001751194480385_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee2c5306e61f8e848c2_624b10d53169143220de3e79_18556345_811849798983519_3237001751194480385_n.jpeg\"><img alt=\"18581815_811849828983516_682756273245587733_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee2c5306e28e6e848c1_624b10d5dc4e8f11913e7a71_18581815_811849828983516_682756273245587733_n.jpeg\"><img alt=\"18620096_811849848983514_607969221708638864_n.jpg\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee2c5306e2dfde848c0_624b10d5bbb46a57acd685d2_18620096_811849848983514_607969221708638864_n.jpeg\"><img alt=\"IMG_7554.JPG\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ee2c5306e30c2e848c3_624b10d5f0b0157eb9c0bdf1_IMG_7554.jpeg\">"
  }
]
