[
  {
    "title": "In a Complex World, Simple Wins",
    "date": "Apr 01, 2022",
    "year": 2022,
    "location": "Global",
    "excerpt": "The Feynman Technique teaches us that complexity often masks shallow understanding. At FinMango, we strip away fluff to make financial health accessible to everyone.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edcc5306e905fe847d9_623fc2776b70a71576ed507b_Screen%2520Shot%25202022-03-26%2520at%25209.47.16%2520PM.png",
    "body": "<p><strong>By Scott Glasgow</strong></p><p>The world is complex and connected in ways we don't fully understand. Everything from products to personalities has a brand, a logo, an experience. Most are instantly forgettable.</p><p>They look and feel the same as everything else. They're built on rational thinking and they follow trends instead of forging them. A great brand is the opposite.</p><p>At FinMango, simple wins in our brand and design philosophy. It is what guides what we do for the people we reach and how we act as an organization.</p><h3>The Feynman Technique</h3><p>The Feynman Technique is a learning framework that forces you to strip away needless complexity. It was developed by Richard Feynman, a Noble Prize winning theoretical physicist from the United States.</p><p>Interestingly, Feynman's true genius was in his ability to convey complex ideas into simple, digestible ways. He observed that complexity and fluff are often used to mask a lack of deep understanding.</p><p><strong>The Feynman Technique incorporates four steps:</strong></p><ol><li>Pick and study a topic</li><li>Be able to explain it to a kid</li><li>Identify any gaps in your understanding</li><li>Review and simplify</li></ol><h3>Mathematical Illustration</h3><p>Let's look at a mathematical problem that \"looks\" complex:</p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edcc5306e085de847e0_623fc2b1bfb79e48edfe8dc3_Screen%2520Shot%25202022-03-26%2520at%25209.45.20%2520PM.png\" alt=\"Complex math problem\"><p>Do you know the answer? Interestingly, most don't even attempt, few try, and everyone fails. It comes across as complex and intimidating.</p><h3>Breaking It Down</h3><p>Below is an example of how I teach kids...</p><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edcc5306eaef4e847df_623fc2c7f7abaa40dcfce5c7_Screen%2520Shot%25202022-03-26%2520at%25209.46.05%2520PM.png\" alt=\"Simplified math solution\"><p><strong>Steps:</strong></p><ol><li>Separate. Mentally draw a line between the first and second numbers.</li><li>On the left, take \"x\" and multiply it by \"(x+1).\"</li><li>On the right, simply square the number: y(y).</li><li>Merge. Combine both answers to get your final answer.</li></ol><img src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edcc5306e8317e847de_623fc2a4248561414d9c46dc_Screen%2520Shot%25202022-03-26%2520at%25209.46.34%2520PM.png\" alt=\"Final solution\"><p><em>*NOTE: this trick only works when the number ends in a \"5.\"</em></p><h3>Simple Wins</h3><p>It is easy to overcomplicate and intimidate. We all know the people and can admit to times we have done it as well. However, we cannot be fooled—complexity and fluff are often used to mask a lack of deep understanding.</p><ul><li><strong>Simple is generous.</strong> A simple idea is generous because it is understood by your customers, team, and community.</li><li><strong>Simple makes bold possible.</strong> Once we have our simple idea down, we give ourselves the rare opportunity to stand out.</li><li><strong>Simple provides direction.</strong> Thinking simple provides us not with a destination, but a direction.</li></ul><h3>Conclusion</h3><p>It is easy to feel intimidated in such a complex world—both personally and professionally. However, we don't have to accept this fate. Thinking \"simple\" can help us overcome challenges by breaking it down with focus and clarity.</p><p><strong>Think simple. It's how we operate at FinMango.</strong></p>"
  },
  {
    "title": "The Mango Framework: Strategic Planning Update",
    "date": "Jun 03, 2022",
    "year": 2022,
    "location": "HQ",
    "excerpt": "Like mangos come in hundreds of varieties, young adults face complex financial challenges. We're pivoting to meet them in times of transition—when they need us most.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/6390a730c0d0128e37589451_62bc8ddad82619c1e323311f_Untitled%2520design%2520(69).jpeg",
    "body": "<p>The mango is one of the most popular fruits in the world. Simplistically, most would say it is oval and orange, but the mango can actually be found in a multitude of sizes, colors, and tastes. Hundreds of varieties exist. At first glance, the mango seems like a typical fruit. But further assessment reveals much more complexity.</p><p>I couldn't resist reminiscing on this assessment during a discussion on the <strong>Cynefin Framework</strong> - a model used in adaptive leadership to assess complex concepts and address real-world problems. The model depicts five contexts for problem-solving: simple, complicated, complex, chaotic, and disorder.</p><h3>FinMango in Complex Systems</h3><p>At an organizational level, FinMango's work aligns with the \"complex,\" or systems, context. Our approach will be experimentation with an emphasis on probing, sensing, and then responding.</p><p>Though a complex system may appear predictable, hindsight does not lead to foresight because external systems constantly change. This means we cannot predict what will happen and that the system is dynamic. Solutions can't be imposed; rather, they emerge from the circumstances.</p><h3>Our New Focus</h3><p>Moving forward, it's evident—thanks to the community survey—that our work should focus on the complex context of young adults around the world and their financial stability. More specifically, we should focus on supporting that stability to young adults <strong>in times of transition</strong>.</p><p>FinMango has come far—and these changes may not be easy. It's going to require us to think and act much differently than we have in the past. Nevertheless, it is you, our \"mango\" family, that has energized us to reach this point.</p><p>I have never been so excited about our future and feel even more committed to help young adults, and even more passionate about the cause of helping people in transition.</p><h3>Questions?</h3><p>Reach out to us based on your interest:</p><ul><li><strong>Strategic planning process</strong> → Katherine Lordi</li><li><strong>Company Benefits Guide</strong> → Jack Enkema</li><li><strong>Communication & branding</strong> → Kaylei Ruffing or OJ Singh</li><li><strong>Design & strategy theory</strong> → Chris Shannon</li></ul><p><strong>Let's mango,</strong></p>"
  },
  {
    "title": "Strategic Pivot: Survey Results & Next Steps",
    "date": "May 25, 2022",
    "year": 2022,
    "location": "HQ",
    "excerpt": "We asked, you answered. 73% of you want us focused on financial stability for young adults. Here's what we learned and where we're heading.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/6390a72fcc27e9d38c049cef_62bc8d8ef3c953460de68ed0_1653485083086%2520(2).jpeg",
    "body": "<p><strong>Mango Family,</strong></p><p>As our strategic planning process continues to evolve, I'd like to share an update. First, a huge thank you to the 50+ people who took our survey. Your feedback is shaping our future.</p><h3>What We Learned</h3><p><strong>73% of you believe FinMango should focus on financial stability for young adults.</strong> This clear mandate guides our path forward.</p><p>We also learned that many of you want us to:</p><ul><li>Expand our reach and impact</li><li>Focus on systemic change, not just individual education</li><li>Build sustainable funding models</li><li>Stay true to our mission while evolving our approach</li></ul><h3>Where We're Heading</h3><p>Based on your input, we're pivoting to focus on young adults in times of transition. Whether it's:</p><ul><li>Graduating college</li><li>Starting a first job</li><li>Moving to a new city</li><li>Facing unexpected financial challenges</li></ul><p>These are the moments when financial stability matters most—and when we can have the greatest impact.</p><h3>What's Next</h3><p>Over the coming months, we'll be:</p><ol><li>Refining our programs to meet young adults at transition points</li><li>Building partnerships with organizations that serve this population</li><li>Developing new tools and resources for financial stability</li><li>Measuring impact differently—focusing on stability, not just literacy</li></ol><p>This is a bold pivot. It requires us to think differently, act differently, and measure success differently. But with your support and feedback, I'm confident we're making the right move.</p><p><strong>Thank you for being part of this journey.</strong></p>"
  },
  {
    "title": "The 5 Money Personalities",
    "date": "Mar 27, 2022",
    "year": 2022,
    "location": "Research Lab",
    "excerpt": "Spenders, savers, risk-takers, security-seekers, avoiders. We all have a money personality. Understanding yours is the first step to financial health.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/6390a72fc55b5a26a06c2edb_62bc8d6e2b3b2f10aca0f4e7_Untitled%2520design%2520(68).jpeg",
    "body": "<p>When it comes to money, we all have different approaches, habits, and emotional triggers. Understanding your money personality is crucial to building better financial habits and achieving your goals.</p><h3>The 5 Money Personalities</h3><h4>1. The Spender</h4><p>You love the thrill of a purchase. Money is meant to be enjoyed, and you believe you can't take it with you. The challenge? Balancing present enjoyment with future security.</p><h4>2. The Saver</h4><p>You find comfort in watching your balance grow. Every dollar saved is a dollar of security. The challenge? Knowing when it's okay to spend and enjoy your money.</p><h4>3. The Risk-Taker</h4><p>You see money as a tool for opportunity. Investments excite you, and you're comfortable with calculated risks. The challenge? Not letting confidence turn into recklessness.</p><h4>4. The Security-Seeker</h4><p>You prioritize stability above all else. Low-risk investments, emergency funds, insurance—these give you peace of mind. The challenge? Not missing growth opportunities due to fear.</p><h4>5. The Avoider</h4><p>You'd rather not think about money at all. Checking your balance causes anxiety, and financial planning feels overwhelming. The challenge? Facing your finances before small problems become big ones.</p><h3>What's Your Type?</h3><p>Most people are a combination of these personalities, with one or two dominant traits. The key is understanding your tendencies so you can:</p><ul><li>Build financial systems that work WITH your personality, not against it</li><li>Recognize when your personality is helping or hurting your goals</li><li>Communicate better about money with partners, family, and friends</li></ul><h3>No Personality is \"Wrong\"</h3><p>Each money personality has strengths and weaknesses. The spender knows how to enjoy life. The saver builds security. The risk-taker creates wealth. The security-seeker protects what matters. Even the avoider often has their priorities straight—just not their systems.</p><p><strong>The goal isn't to change who you are. It's to build financial habits that honor your personality while moving you toward your goals.</strong></p>"
  },
  {
    "title": "Partnership Launch: India Expansion",
    "date": "Feb 15, 2022",
    "year": 2022,
    "location": "Mumbai, India",
    "excerpt": "Partnering with local organizations in Mumbai to bring financial health education to 5,000 students. Our first major expansion into South Asia.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/6390a72d7a5bd0331d4a2ceb_62bc8d4ddd41f66a4f3c8a4c_Untitled%2520design%2520(67).jpeg",
    "body": "<p><strong>Big news from the field.</strong></p><p>We're officially launching our partnership with local education organizations in Mumbai, India. This marks our first major expansion into South Asia and represents months of relationship-building and cultural learning.</p><h3>Why India?</h3><p>India has one of the youngest populations in the world, with over 600 million people under age 25. Yet financial education remains largely inaccessible, especially in urban areas where young people face complex financial decisions about careers, education, and family obligations.</p><p>The transition from education to workforce is particularly challenging in India, where:</p><ul><li>Traditional family structures are evolving rapidly</li><li>Digital finance is exploding but financial literacy lags behind</li><li>Student debt and education costs are rising</li><li>Gig economy jobs create income instability</li></ul><h3>Our Approach</h3><p>We're not bringing an American model to India. We're co-creating curriculum with local partners who understand the cultural, economic, and social context. Our role is to:</p><ul><li>Provide research-backed frameworks on financial health</li><li>Share what we've learned from 100+ countries</li><li>Support with funding and resources</li><li>Learn from our partners' expertise</li></ul><p>The curriculum we're developing together focuses on:</p><ol><li><strong>Financial identity</strong> – Understanding your money personality and values</li><li><strong>Income stability</strong> – Navigating gig work, multiple income streams, and career transitions</li><li><strong>Digital finance</strong> – Using apps, digital payments, and online banking safely</li><li><strong>Family dynamics</strong> – Managing money in multigenerational households</li></ol><h3>The Goal</h3><p>Year one: Reach 5,000 students across Mumbai with our partner organizations. Year three: Establish a regional hub that can support expansion across South Asia.</p><p>But more than numbers, we're focused on building relationships, learning from our partners, and creating sustainable impact.</p><p><strong>This is just the beginning.</strong></p>"
  },
  {
    "title": "Field Report: Winter Break Program Success",
    "date": "Jan 12, 2022",
    "year": 2022,
    "location": "Multiple Sites",
    "excerpt": "During winter break, we reached 2,847 students across 12 countries. Here's what we learned about engagement, impact, and scaling.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/6390a72ca01d69e6e7c9f9fa_62bc8d31bbd83c3c0bb70e3d_Untitled%2520design%2520(66).jpeg",
    "body": "<p><strong>The numbers are in from our winter break intensive program.</strong></p><p>Across 12 countries and 47 partner sites, we reached 2,847 students during the holiday break. But more important than the numbers is what we learned.</p><h3>What Worked</h3><p><strong>1. Shorter, focused sessions</strong><br>We shifted from 90-minute workshops to 45-minute focused sessions. Engagement jumped from 62% to 89%.</p><p><strong>2. Interactive exercises over lectures</strong><br>Students retained 3x more information when they worked through real scenarios versus listening to presentations.</p><p><strong>3. Peer-to-peer learning</strong><br>Small group discussions led by trained student facilitators had higher satisfaction scores than instructor-led sessions.</p><p><strong>4. Local context matters</strong><br>Our partners who adapted content for local currency, banking systems, and cultural norms saw 40% higher completion rates.</p><h3>What Didn't Work</h3><p><strong>1. One-size-fits-all curriculum</strong><br>Students in different countries needed vastly different content. We're now creating modular frameworks instead of rigid programs.</p><p><strong>2. Pre-break scheduling</strong><br>Students right before break were mentally checked out. Post-break sessions had better attendance and engagement.</p><p><strong>3. Parent involvement requirements</strong><br>Requiring parent attendance reduced signup rates by 53%. We're rethinking family engagement strategies.</p><h3>Student Feedback</h3><p>We surveyed 1,200+ participants. Top quotes:</p><ul><li>\"This should have been taught in school years ago\"</li><li>\"I wish my parents had learned this stuff\"</li><li>\"The budgeting exercise made it finally click for me\"</li><li>\"I actually want to learn more about money now\"</li></ul><h3>What's Next</h3><p>Based on these learnings, we're:</p><ol><li>Developing a modular curriculum framework</li><li>Training more student facilitators</li><li>Building a partner playbook for local adaptation</li><li>Testing new family engagement models</li></ol><p><strong>The mission continues. Thank you to every partner, facilitator, and student who made this program possible.</strong></p>"
  },
  {
    "title": "Research Release: The Stability Gap",
    "date": "Nov 18, 2021",
    "year": 2021,
    "location": "Research Lab",
    "excerpt": "New data reveals the problem isn't financial literacy—it's financial stability. 78% of young adults understand basic concepts but can't apply them without stability first.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/6390a72b704a8f67e1f9e231_62bc8d0c3ff79b5fd02a5b68_Untitled%2520design%2520(65).jpeg",
    "body": "<p><strong>We've been asking the wrong question.</strong></p><p>For years, the nonprofit sector has focused on financial literacy: teaching people about budgeting, saving, investing, and credit. The assumption? If people just knew better, they'd do better.</p><p>Our new research suggests something different. The problem isn't knowledge—it's stability.</p><h3>The Data</h3><p>We surveyed 5,000 young adults across 15 countries and found:</p><ul><li><strong>78%</strong> can explain basic financial concepts (budgeting, compound interest, credit scores)</li><li><strong>64%</strong> know what they \"should\" be doing with their money</li><li><strong>But only 23%</strong> are actually able to implement what they know</li></ul><p>The gap between knowledge and action isn't about education. It's about stability.</p><h3>What Creates Instability?</h3><p>Our research identified six key factors that prevent young adults from applying financial knowledge:</p><ol><li><strong>Income volatility</strong> – Irregular paychecks make budgeting impossible</li><li><strong>Housing insecurity</strong> – When rent takes 50%+ of income, saving isn't an option</li><li><strong>Health costs</strong> – One medical bill wipes out months of \"good\" behavior</li><li><strong>Debt burden</strong> – Student loans, credit cards, and family obligations leave no margin</li><li><strong>Life transitions</strong> – Moving, job changes, and relationship shifts disrupt financial systems</li><li><strong>Systemic barriers</strong> – Banking access, credit history requirements, and wage stagnation</li></ul><h3>The Paradigm Shift</h3><p>This changes everything about how we approach our mission. Instead of asking \"How do we teach people to manage money better?\" we should ask:</p><p><strong>\"How do we help people build the stability they need to apply what they already know?\"</strong></p><p>This means:</p><ul><li>Focusing on income stability before budgeting skills</li><li>Addressing housing costs before teaching saving strategies</li><li>Building emergency funds before investment education</li><li>Removing systemic barriers before individual behavior change</li></ul><h3>What We're Changing</h3><p>Based on this research, we're fundamentally rethinking our programs:</p><ol><li><strong>Stability-first curriculum</strong> – Starting with emergency funds, income smoothing, and cost reduction</li><li><strong>Systems advocacy</strong> – Pushing for policy changes that create stability</li><li><strong>Partner criteria</strong> – Working with organizations that address root causes, not just symptoms</li><li><strong>Impact measurement</strong> – Tracking stability metrics, not just literacy scores</li></ol><p><strong>Financial health must come before financial education. Period.</strong></p><p>Read the full research report: <a href=\"#\">The Stability Gap: Why Financial Literacy Isn't Enough</a></p>"
  },
  {
    "title": "Launch: The Global Ambassador Network",
    "date": "Sep 23, 2021",
    "year": 2021,
    "location": "Global",
    "excerpt": "Introducing our grassroots approach to scaling impact: 127 ambassadors in 43 countries, empowered to adapt our mission to their communities.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/6390a72a6e24a1f69b9e7ab2_62bc8cec29fe7f6c3eb8f6fa_Untitled%2520design%2520(64).jpeg",
    "body": "<p><strong>Today marks a major milestone in the FinMango story.</strong></p><p>After 18 months of development, we're officially launching the Global Ambassador Network—a grassroots model for scaling financial health education worldwide.</p><h3>The Problem We're Solving</h3><p>Traditional nonprofit scaling follows a hub-and-spoke model: headquarters creates programs, regional offices implement them, and local partners execute. This approach has two fatal flaws:</p><ol><li>It's slow and expensive</li><li>It ignores local context and expertise</li></ol><p>We needed a different model. One that's fast, affordable, and culturally adaptive.</p><h3>The Ambassador Model</h3><p>Global Ambassadors are local leaders who:</p><ul><li><strong>Bring their own expertise</strong> – They're teachers, social workers, community organizers, and entrepreneurs</li><li><strong>Adapt our framework</strong> – They translate not just language, but cultural context</li><li><strong>Build local partnerships</strong> – They have relationships we could never establish from afar</li><li><strong>Own the mission</strong> – They're not implementing our programs, they're building their own</li></ul><h3>Our Role</h3><p>We provide:</p><ul><li><strong>Framework & research</strong> – Evidence-based approaches to financial health</li><li><strong>Training & support</strong> – Monthly calls, online community, and peer learning</li><li><strong>Small grants</strong> – Seed funding for local initiatives</li><li><strong>Global network</strong> – Connections to ambassadors in other countries</li></ul><p>But we don't mandate specific programs or prescribe exact implementations. That's where local expertise comes in.</p><h3>Early Results</h3><p>In our pilot phase, 12 ambassadors reached 8,400 people across 5 countries. What they created:</p><ul><li>A WhatsApp-based financial coaching program in Kenya</li><li>A peer mentorship model for university students in Brazil</li><li>A family finance workshop series in rural India</li><li>A TikTok financial education campaign in the Philippines</li><li>A community savings circle in South Africa</li></ul><p>None of these programs came from our headquarters. They emerged from local leaders who understood their communities' needs.</p><h3>The Launch</h3><p>Today, we're opening applications for 100+ new ambassadors. We're looking for passionate local leaders who:</p><ul><li>Believe financial health should come before financial education</li><li>Have connections in their community</li><li>Want to adapt our mission, not just copy-paste our programs</li><li>Are ready to build something from scratch</li></ul><p><strong>This is how we scale. Not through offices and staff, but through people and partnerships.</strong></p><p>Learn more and apply: <a href=\"#\">Global Ambassador Network</a></p>"
  },
  {
    "title": "Partnership Milestone: 100 Countries Reached",
    "date": "Jul 07, 2021",
    "year": 2021,
    "location": "Global",
    "excerpt": "From a college dorm room to 100+ countries in four years. Here's what we learned about building a global movement on a shoestring budget.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/6390a7297c67af7a26e0134a_62bc8cc72f10f6b45e4d9e23_Untitled%2520design%2520(63).jpeg",
    "body": "<p><strong>We just hit 100 countries.</strong></p><p>It's a milestone that seemed impossible when we started in a college dorm room in 2017. Now we have active partnerships and programs in over 100 countries across six continents.</p><p>But here's what's more important than the number: <strong>how</strong> we got here.</p><h3>The Traditional Approach (Expensive & Slow)</h3><p>Most nonprofits expand through:</p><ul><li>Opening regional offices ($200K+ per location)</li><li>Hiring country directors ($80K+ per person)</li><li>Building local infrastructure (offices, vehicles, equipment)</li><li>Creating localized programs (months of development time)</li></ul><p>Total cost to reach 100 countries this way: $20M+ over 10+ years</p><h3>The FinMango Approach (Affordable & Fast)</h3><p>We took a different path:</p><ol><li><strong>Partner with locals</strong> – Find organizations already doing the work</li><li><strong>Provide value, not mandates</strong> – Share our research, curriculum frameworks, and training</li><li><strong>Let them adapt</strong> – Trust local expertise over headquarters control</li><li><strong>Build network effects</strong> – Connect partners across countries for peer learning</li></ol><p>Total cost to reach 100 countries: $380K over 4 years</p><h3>What Made This Possible</h3><p><strong>1. A clear, adaptable mission</strong><br>\"Financial health before financial education\" translates across cultures. The specifics change, but the principle holds.</p><p><strong>2. Digital-first operations</strong><br>No offices, no vehicles, no physical infrastructure. Everything runs on cloud tools and mobile communication.</p><p><strong>3. Trust in local leaders</strong><br>We don't micromanage. We don't require detailed reports. We trust our partners to know their communities.</p><p><strong>4. Rejection of the overhead myth</strong><br>We invest in relationships, not real estate. In people, not processes. Our \"overhead\" is 89% because we spend on the mission, not the infrastructure.</p><h3>The Numbers</h3><p>Across 100+ countries, we've:</p><ul><li>Reached 750,000+ young adults</li><li>Trained 3,200+ educators and facilitators</li><li>Built partnerships with 400+ local organizations</li><li>Created content in 27 languages</li><li>Spent an average of $3,800 per country for first-year operations</li></ul><h3>What We Learned</h3><p><strong>Lesson 1: Geography doesn't matter as much as you think</strong><br>Our strongest partnerships aren't determined by wealth, language, or proximity. They're determined by shared values and committed leaders.</p><p><strong>Lesson 2: Local adaptation beats standardization</strong><br>Our most effective programs don't look like \"FinMango programs.\" They look like programs built by people who understand their communities.</p><p><strong>Lesson 3: You can't scale culture from headquarters</strong><br>We tried to create a \"FinMango way\" early on. It failed. What works is creating a \"FinMango philosophy\" and letting partners build their own way.</p><p><strong>Lesson 4: Trust is cheaper than control</strong><br>Micromanagement is expensive. Reporting requirements are expensive. Compliance structures are expensive. Trust is free—and it scales infinitely.</p><h3>What's Next</h3><p>Our goal isn't to reach every country. It's to reach every young adult who needs us. The question isn't \"how many countries?\" but \"how deep can we go?\"</p><p>So we're shifting focus from geographic expansion to deepening impact in the communities we serve.</p><p><strong>100 countries isn't a finish line. It's a foundation.</strong></p>"
  },
  {
    "title": "Crisis Response: COVID-19 Financial Health Initiative",
    "date": "Apr 15, 2020",
    "year": 2020,
    "location": "Emergency Response",
    "excerpt": "When the pandemic hit, young adults faced unprecedented financial instability. Our emergency response reached 50,000 people in 60 days.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/6390a7281eeee12e3ee5c9bc_62bc8ca46e24a1ac4e9e7953_Untitled%2520design%2520(62).jpeg",
    "body": "<p><strong>March 2020 changed everything.</strong></p><p>Within weeks, young adults worldwide faced job losses, reduced hours, business closures, and economic uncertainty unlike anything in recent history. The financial instability we'd been studying became a global crisis overnight.</p><p>We had to respond. Fast.</p><h3>The Challenge</h3><p>Our usual programs—in-person workshops, school partnerships, community events—became impossible. Meanwhile, the need skyrocketed:</p><ul><li>Youth unemployment jumped 40% in some regions</li><li>Gig workers lost 60-80% of income overnight</li><li>Students faced housing and food insecurity</li><li>Emergency savings were depleted in weeks</li></ul><p>We needed a completely different approach.</p><h3>The Emergency Response</h3><p>We launched a rapid-deployment digital program in partnership with our Global Ambassador Network:</p><p><strong>Week 1: Assessment</strong><br>Surveyed 2,000+ young adults across 30 countries to understand immediate needs</p><p><strong>Week 2: Development</strong><br>Created emergency financial health curriculum focused on crisis management</p><p><strong>Week 3: Training</strong><br>Trained 150 ambassadors on virtual delivery and crisis support</p><p><strong>Week 4: Launch</strong><br>Began delivering programs via WhatsApp, Zoom, SMS, and social media</p><h3>What We Covered</h3><p>The curriculum focused on immediate survival strategies:</p><ol><li><strong>Income protection</strong> – Unemployment benefits, emergency relief programs, gig work safety</li><li><strong>Expense reduction</strong> – Negotiating with landlords, bill deferrals, free resources</li><li><strong>Crisis budgeting</strong> – Prioritizing expenses when income drops</li><li><strong>Debt management</strong> – Forbearance, payment plans, avoiding predatory lending</li><li><strong>Mental health</strong> – Managing financial anxiety and stress</li></ol><h3>The Impact</h3><p>In 60 days, we:</p><ul><li>Reached 50,000+ young adults</li><li>Delivered programs in 43 countries</li><li>Created content in 19 languages</li><li>Connected 8,000+ people with emergency resources</li><li>Trained 300+ ambassadors in crisis response</li></ul><h3>What We Learned</h3><p><strong>1. Digital works—if you design for accessibility</strong><br>Voice notes worked better than video in low-bandwidth areas. SMS reached people without smartphones. WhatsApp groups created community when isolation was crushing.</p><p><strong>2. Community matters more than curriculum</strong><br>People needed connection as much as information. Our most successful programs created peer support groups, not just classes.</p><p><strong>3. Financial health is health</strong><br>The mental health crisis and financial crisis were inseparable. We couldn't address one without the other.</p><p><strong>4. Speed beats perfection in a crisis</strong><br>We launched imperfect programs in week 4 instead of perfect programs in month 3. Lives were better for it.</p><h3>The Pivot</h3><p>This crisis accelerated our evolution from financial education to financial health. The pandemic proved that teaching people to budget doesn't help when they have no income. Teaching them to save doesn't help when they're choosing between rent and food.</p><p><strong>Financial stability must come first. Always.</strong></p><p>The pandemic is our proof of concept. It's why we're permanently shifting our model.</p>"
  },
  {
    "title": "Field Report: The Challenge of Scale",
    "date": "Nov 20, 2019",
    "year": 2019,
    "location": "Nairobi, Kenya",
    "excerpt": "Three months in Nairobi taught us that scaling isn't about reaching more people—it's about building systems that can grow without us.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/6390a726b3be641f5a9f11ab_62bc8c7ff5cc9c58e2efa4b9_Untitled%2520design%2520(61).jpeg",
    "body": "<p><strong>I spent three months in Nairobi this year.</strong></p><p>The goal: Build our East Africa regional program from the ground up. The reality: I learned more about what NOT to do than what to do.</p><h3>The Plan</h3><p>We arrived with ambitious goals:</p><ul><li>Partner with 20 schools</li><li>Train 100 teachers</li><li>Reach 5,000 students</li><li>Establish a regional office</li><li>Hire local staff</li></ul><p>Classic nonprofit expansion playbook. And it failed spectacularly.</p><h3>What Went Wrong</h3><p><strong>1. We assumed we knew what people needed</strong><br>Our curriculum was built on American financial systems. Kenyan students didn't have credit scores, 401(k)s, or traditional bank accounts. Half our content was irrelevant.</p><p><strong>2. We tried to control everything</strong><br>We wanted standardized programs, consistent branding, detailed reporting. Local partners wanted flexibility. We said no. They politely disengaged.</p><p><strong>3. We hired too fast</strong><br>We brought on three local staff in month one. By month two, we realized we didn't know what roles we actually needed. By month three, we'd reorganized twice.</p><p><strong>4. We measured the wrong things</strong><br>We obsessed over student attendance numbers while ignoring whether anyone actually changed their financial behavior.</p><h3>The Turning Point</h3><p>Two months in, I had a conversation with Amani, a teacher at one of our partner schools. She said:</p><p><em>\"You keep asking us to follow your program. But we've been teaching financial education here for 5 years. Why don't you ask us what we've learned?\"</em></p><p>That conversation changed everything.</p><h3>What We Changed</h3><p>We flipped our model:</p><ul><li><strong>Instead of teaching</strong> → We started learning</li><li><strong>Instead of standardizing</strong> → We started adapting</li><li><strong>Instead of hiring staff</strong> → We started building partnerships</li><li><strong>Instead of measuring outputs</strong> → We started tracking outcomes</li></ul><p>We spent the next month interviewing local educators, asking what worked in their context, and documenting their approaches.</p><h3>What We Learned</h3><p><strong>Lesson 1: Local expertise > Headquarters knowledge</strong><br>The best financial education programs in Nairobi weren't created by us or any international org. They were created by Kenyan teachers who understood their students' lives.</p><p><strong>Lesson 2: Adaptation > Standardization</strong><br>Our job isn't to export American financial education. It's to provide frameworks that locals can adapt to their context.</p><p><strong>Lesson 3: Partnership > Presence</strong><br>We don't need an office in every region. We need strong partnerships with local organizations who do.</p><p><strong>Lesson 4: Behavior > Attendance</strong><br>A program that reaches 100 students and changes 20 lives beats a program that reaches 1,000 students and changes none.</p><h3>The New Model</h3><p>By month three, we'd completely redesigned our approach:</p><ol><li><strong>Partner-first</strong> – Work with local orgs who have existing relationships</li><li><strong>Framework, not curriculum</strong> – Provide adaptable principles, not rigid programs</li><li><strong>Train-the-trainer</strong> – Build local capacity instead of flying in experts</li><li><strong>Outcomes over outputs</strong> – Track behavior change, not attendance sheets</li></ol><p>This became the blueprint for our global expansion.</p><h3>Final Results</h3><p>By the end of three months:</p><ul><li>8 strong partnerships (not 20 weak ones)</li><li>42 trained teachers (who trained 200 more)</li><li>3,200 students reached (with 68% reporting behavior change)</li><li>Zero office space (and zero regrets)</li><li>Partnerships that outlasted my departure</li></ul><p><strong>The best thing we did in Nairobi wasn't what we built. It was realizing we didn't need to build it in the first place.</strong></p>"
  },
  {
    "title": "Launch Report: Philippines Pilot Program",
    "date": "Aug 12, 2019",
    "year": 2019,
    "location": "Manila, Philippines",
    "excerpt": "Our first international pilot. 847 students, 12 partner schools, and lessons that shaped our entire global strategy.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/6390a7256f75bf28eca5e831_62bc8c58d6bcc76fa7f14e23_Untitled%2520design%2520(60).jpeg",
    "body": "<p><strong>The Philippines was our first real test.</strong></p><p>Could our model work outside the United States? Could we build partnerships in a country where we had no existing relationships? Could we create culturally relevant financial education without deep local expertise?</p><p>We were about to find out.</p><h3>Why Philippines?</h3><p>We chose the Philippines for our first international pilot because:</p><ul><li>Large young adult population (median age: 25)</li><li>Growing middle class with increasing financial complexity</li><li>High English proficiency (lower language barrier for our first attempt)</li><li>Strong education system with receptive school administrators</li><li>Active expat community who could provide connections</li></ul><p>We had one contact—a university professor who believed in our mission. Everything else we had to build from scratch.</p><h3>The Approach</h3><p><strong>Month 1: Relationships</strong><br>Flew to Manila, met with 30+ schools and youth organizations. Most said no. Some said maybe. 12 said yes.</p><p><strong>Month 2: Adaptation</strong><br>Worked with local educators to adapt our curriculum for Filipino context. Learned about remittances, overseas workers, family financial obligations, and informal savings systems.</p><p><strong>Month 3: Training</strong><br>Trained 25 teachers and youth workers on our adapted curriculum. They provided feedback, we revised, repeated.</p><p><strong>Month 4: Launch</strong><br>Began programs across 12 partner sites. Watched. Learned. Adapted in real-time.</p><h3>What We Learned</h3><p><strong>1. Family context is everything</strong><br>In the Philippines, young adults' financial decisions are deeply connected to family obligations. Our individualistic American curriculum missed this completely. We had to rebuild around family dynamics.</p><p><strong>2. Informal financial systems matter</strong><br>Many students used paluwagan (rotating savings groups) and 5-6 lending systems that don't exist in the US. Our curriculum had to incorporate these, not replace them.</p><p><strong>3. Remittances change everything</strong><br>With millions of Filipinos working overseas, remittances are a central part of financial life. We needed content on managing money sent from abroad and planning for family members' financial needs.</p><p><strong>4. Cultural adaptation ≠ Translation</strong><br>Just translating our content to Filipino context didn't work. We needed to rebuild the frameworks around Filipino financial realities.</p><h3>The Results</h3><p>After 4 months:</p><ul><li>847 students completed the program</li><li>12 partner schools</li><li>25 trained facilitators</li><li>72% of students reported changing at least one financial behavior</li><li>89% said the program was relevant to their lives</li></ul><p>But the most important result was what we learned about our model.</p><h3>What Changed</h3><p>The Philippines pilot fundamentally changed how we approach international expansion:</p><ol><li><strong>Start with local partners</strong> – Don't parachute in with your own program</li><li><strong>Adapt, don't translate</strong> – Cultural context requires rebuilding, not just editing</li><li><strong>Family-centered approach</strong> – In most cultures, financial decisions are collective, not individual</li><li><strong>Incorporate informal systems</strong> – Don't assume American financial infrastructure is universal</li><li><strong>Build for sustainability</strong> – Train local facilitators, don't create dependency on international experts</li></ol><h3>The Ripple Effect</h3><p>What started as a pilot became a blueprint. The approach we developed in Manila—local partnerships, cultural adaptation, train-the-trainer model—became the foundation for our expansion to 100+ countries.</p><p>Five years later, our Philippines partners have reached 25,000+ students and trained 300+ facilitators. They've expanded to regions we never visited and adapted the program in ways we never imagined.</p><p><strong>That's not a pilot. That's a movement.</strong></p>"
  },
  {
    "title": "From Dorm Room to 25 States",
    "date": "May 05, 2019",
    "year": 2019,
    "location": "Columbus, Ohio",
    "excerpt": "Two years ago, we were teaching financial literacy in a college dorm room. Today, we're in 25 states. Here's how we grew without losing our mission.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/6390a723d2e867cf8a5e1234_62bc8c2fd90ac4fa22b4c9e2_Untitled%2520design%2520(59).jpeg",
    "body": "<p><strong>Two years ago, FinMango existed in a college dorm room.</strong></p><p>Three friends with a shared frustration: why wasn't anyone teaching us about money before we needed to know about money?</p><p>Today, we're in 25 states with 150+ partner organizations. But getting here wasn't about having a great idea. It was about obsessive focus on one question:</p><p><em>How do we grow without losing what makes us different?</em></p><h3>The Origin Story</h3><p>Started in fall 2017. Three college students (Scott, Jack, and Katherine) who noticed their peers were drowning in financial decisions:</p><ul><li>Student loans</li><li>Credit cards</li><li>Rent and budgeting</li><li>Part-time job income management</li><li>Post-graduation planning</li></ul><p>No one was teaching this stuff. Or if they were, it was boring, condescending, or totally disconnected from real student life.</p><p>So we started teaching our peers. In dorm rooms, at student org meetings, wherever people would listen.</p><h3>Year 1: The College Circuit</h3><p>We focused exclusively on Ohio State and nearby campuses. Our \"curriculum\" was a Google Doc. Our \"classroom\" was wherever we could find 10+ students. Our \"certification\" was... nothing. We were just students teaching students.</p><p>But something clicked. Students actually showed up. They told their friends. Other campuses invited us. By end of year one:</p><ul><li>12 college campuses</li><li>2,400 students reached</li><li>35 trained peer educators</li><li>Still operating out of dorm rooms</li></ul><h3>Year 2: The Expansion Question</h3><p>Other schools started reaching out. Could we come teach in Michigan? Pennsylvania? Florida? We had a decision to make:</p><p><strong>Option 1: Stay small and deep</strong><br>Focus on Ohio campuses, build the best program possible, grow slowly and sustainably.</p><p><strong>Option 2: Go wide and fast</strong><br>Expand to every campus that invites us, reach as many students as possible, figure out quality later.</p><p>We chose neither. Instead:</p><p><strong>Option 3: Build a model that could scale without us</strong></p><h3>The Train-the-Trainer Model</h3><p>We realized we couldn't personally teach in 25 states. But we could train others to teach using our approach. So we created:</p><ol><li><strong>Core framework</strong> – Not a rigid curriculum, but adaptable principles</li><li><strong>Facilitator training</strong> – Two-day intensive for anyone who wanted to teach our approach</li><li><strong>Online community</strong> – Forum for facilitators to share what worked and get support</li><li><strong>Minimal requirements</strong> – Must teach the core concepts, but free to adapt delivery</li></ol><p>The key: <strong>we gave it away for free.</strong></p><p>No licensing fees. No franchise agreements. No legal contracts. Just: \"Here's what works. Make it yours. Tell us how it goes.\"</p><h3>What We Lost</h3><p>This model meant giving up control:</p><ul><li>Some facilitators taught it differently than we would</li><li>We couldn't ensure consistent quality</li><li>People used our name without our direct oversight</li><li>We couldn't scale revenue (no fees = no income)</li></ul><p>But it also meant:</p><ul><li>Rapid expansion without overhead</li><li>Local adaptation we could never create</li><li>A movement bigger than our organization</li><li>Trust-based relationships with partners</li></ul><h3>The Results</h3><p>By year two:</p><ul><li>25 states</li><li>150+ partner organizations</li><li>12,000+ students reached</li><li>200+ trained facilitators</li><li>Still a volunteer-run organization</li></ul><h3>What We Kept</h3><p>Through all the growth, we protected three things:</p><ol><li><strong>Student-to-student teaching</strong> – Peer education remained core</li><li><strong>Free and open</strong> – No student ever pays for our programs</li><li><strong>Practical over theoretical</strong> – Real situations, not textbook concepts</li></ol><p>These were our non-negotiables. Everything else was adaptable.</p><h3>The Lesson</h3><p>Scaling doesn't require perfection. It requires clarity about what matters and flexibility about everything else.</p><p>We stayed true to our mission (financial health for young adults) while being wildly flexible about our methods (how we delivered that mission).</p><p><strong>That's how you grow without losing yourself.</strong></p>"
  },
  {
    "title": "Officially Launching in Angola",
    "date": "Feb 20, 2018",
    "year": 2018,
    "location": "Luanda, Angola",
    "excerpt": "Our partners are local experts with years of exceptional work and proven progress. Excited to officially launch in Angola with Chamuanga International School.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda48bbc3681d997a15_624b2b07181eaa588800e9a3_Untitled%2520design%2520(85).jpeg",
    "body": "<p>Our partners are local experts and professionals with years of exceptional work and proven progress. We're excited to officially launch in Angola.</p><p><strong>Partner: Chamuanga International School</strong></p><h3>About Our Partnership</h3><p>Chamuanga International School has been providing quality education in Luanda for over a decade. They approached us with a vision: integrate financial health education into their secondary curriculum, making it as fundamental as math and science.</p><p>This wasn't about adding a one-off workshop. This was about building financial health into the DNA of their school.</p><h3>The Program</h3><p>We're launching a year-long pilot with:</p><ul><li>150 students across grades 9-12</li><li>12 trained teacher-facilitators</li><li>Curriculum adapted for Angolan context</li><li>Focus on youth entrepreneurship and informal economy</li><li>Integration with existing economics and business courses</li></ul><h3>Why Angola?</h3><p>Angola has one of the youngest populations in Africa, with 60%+ under age 25. These young people are navigating:</p><ul><li>Rapid economic change</li><li>Shift from oil-dependent economy to diversification</li><li>Growing entrepreneurship ecosystem</li><li>Limited formal financial education</li></ul><p>The opportunity to impact young Angolans during this transition is enormous.</p><h3>What's Different Here</h3><p>Angola's financial landscape is unique:</p><ul><li>Dual currency system (Kwanza and USD)</li><li>Limited banking infrastructure in rural areas</li><li>High inflation volatility</li><li>Strong informal economy and family business culture</li></ul><p>Our curriculum couldn't just be translated—it had to be rebuilt around these realities.</p><h3>The Team</h3><p>We're incredibly fortunate to work with:</p><ul><li>Dedicated teachers at Chamuanga who co-created this curriculum</li><li>Local financial professionals who volunteer as mentors</li><li>Young Angolan entrepreneurs who share their journeys</li><li>Community leaders who provide cultural context</li></ul><p>This is their program. We're just supporting their vision.</p><h3>What's Next</h3><p>This pilot will run through the 2018-2019 school year. We'll document what works, adapt what doesn't, and share our learnings with other schools across Angola and the region.</p><p>The goal isn't to export FinMango to Angola. It's to help Angolan educators build something sustainable, culturally relevant, and owned by the community.</p><p><strong>This is just the beginning of our work in Angola. We can't wait to share the journey.</strong></p><img alt=\"Angola launch 1\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda48bbc38e4b997a18_624b2afdb45fb4ffcb456c01_28276439_954806534687844_3597775531319614139_n.jpeg\"><img alt=\"Angola launch 2\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda48bbc380f1997a19_624b2afde06e6126cb04b754_28167178_954806508021180_438873454000683694_n.jpeg\"><img alt=\"Angola launch 3\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda48bbc35358997a17_624b2afdd81f9bae527f6129_28058635_954806514687846_2816193520700284257_n.jpeg\"><img alt=\"Angola launch 4\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751eda48bbc33bec997a16_624b2afd6231cd1296331086_28058453_954806538021177_2421190973368012799_n.jpeg\">"
  },
  {
    "title": "JOG Presentation: Teaching 150 Students",
    "date": "Mar 15, 2018",
    "year": 2018,
    "location": "Columbus, Ohio",
    "excerpt": "Mango Scott had the opportunity to speak at a Career Development Conference held by JOG where he taught 150 students about financial health and career transitions.",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edda7d679c2b6aab3d9_624b2cd7b8d8d91b645f9e87_Untitled%2520design%2520(88).jpeg",
    "body": "<p>Mango Scott had the opportunity to speak at a Career Development Conference held by Jobs for Ohio's Graduates (JOG), where he taught 150 students!</p><h3>About JOG</h3><p>Jobs for Ohio's Graduates works with high school students who face significant barriers to graduation and employment. They provide:</p><ul><li>Career development training</li><li>Job placement support</li><li>Mentorship programs</li><li>Life skills education</li></ul><p>These students are often the first in their families to graduate high school or pursue higher education. They face unique financial challenges as they transition from school to workforce.</p><h3>The Workshop</h3><p>The session focused on financial health for career transitions:</p><ul><li><strong>Before the job</strong> – How to financially prepare for entering the workforce</li><li><strong>First paycheck</strong> – Common mistakes and smart strategies</li><li><strong>Building stability</strong> – Emergency funds before anything else</li><li><strong>Avoiding traps</strong> – Predatory lending, credit card debt, lifestyle inflation</li></ul><p>We made it interactive, practical, and relevant to their specific situations.</p><h3>What Resonated</h3><p>Students were most engaged by:</p><ul><li>Real talk about first job financial mistakes (including my own)</li><li>The \"invisible bills\" exercise – all the costs that come with working (transportation, work clothes, food, etc.)</li><li>Budgeting with irregular hours and seasonal work</li><li>How to negotiate your first job offer</li></ul><h3>The Questions</h3><p>Some questions from students:</p><ul><li>\"How much should I save before I move out?\"</li><li>\"Is it better to have a credit card or just use debit?\"</li><li>\"What if I need a car to get to work but don't have money for a car?\"</li><li>\"How do I say no when family asks for money I don't have?\"</li></ul><p>These aren't theoretical questions. These are immediate, real-life dilemmas these students face.</p><h3>Why This Matters</h3><p>JOG students are exactly who we're trying to reach. They're at a critical financial transition point where the right support can change their trajectory.</p><p>They don't need investment advice or retirement planning. They need help with:</p><ul><li>Getting their first bank account</li><li>Managing their first paycheck</li><li>Building basic financial stability</li><li>Avoiding common traps</li></ul><p>That's the work that matters.</p><p><strong>Thank you to JOG for the opportunity to serve these incredible students.</strong></p><img alt=\"JOG presentation 1\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edda7d67986e7aab3e8_624b2ca8d181e6092d252618_29472924_969470773221420_7640719092054885543_n.jpeg\"><img alt=\"JOG presentation 2\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751edda7d6798f9caab3e9_624b2ca81cfe0f55e4ed52e4_29473005_969470783221419_6534637047751860382_n.jpeg\">"
  },
  {
    "title": "Financial Literacy Class to 50 Realtors",
    "date": "Mar 20, 2018",
    "year": 2018,
    "location": "Medina, Ohio",
    "excerpt": "We taught a financial literacy class to 50 realtors and their families at Weymouth Country Club. Thanks to First Security Mortgage Corporation for sponsoring!",
    "image": "https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c3539fc26294160_624b2dcc8010998b63cc5c74_2.jpeg",
    "body": "<p>We taught a financial literacy class to 50 realtors and their families at Weymouth Country Club in Medina, Ohio! Thanks for sponsoring this event, First Security Mortgage Corporation!</p><h3>Why Realtors?</h3><p>This was an interesting departure from our usual student-focused work. But it made sense:</p><ul><li>Realtors often work with first-time homebuyers who need financial education</li><li>They experience income volatility (commission-based work)</li><li>They're small business owners managing their own finances</li><li>They can be advocates for financial health in their communities</li></ul><p>Plus, many brought their teenage and young adult children—exactly who we want to reach.</p><h3>The Content</h3><p>We adapted our curriculum for a mixed-age, mixed-experience audience:</p><ul><li><strong>For professionals</strong> – Managing irregular income, tax planning, business expenses</li><li><strong>For families</strong> – Teaching kids about money, family financial communication</li><li><strong>For young adults</strong> – Preparing for financial independence, first job planning</li></ul><h3>What Worked</h3><p>The cross-generational discussions were unexpectedly powerful. Parents and kids talking openly about money. Realtors sharing their own financial struggles and successes. Young adults asking questions they'd never asked their parents.</p><p>Breaking down the taboo around money conversations might have been more valuable than any specific financial tip we shared.</p><h3>Key Takeaways</h3><p>From realtors:</p><ul><li>\"I needed to hear this as much as my clients\"</li><li>\"I'm going to start having these conversations with first-time buyers\"</li><li>\"Wish someone had taught me this when I started in real estate\"</li></ul><p>From young adults:</p><ul><li>\"This is the first time my parents and I have talked about money without fighting\"</li><li>\"I didn't know my parents made these same mistakes\"</li><li>\"I feel less stressed about figuring this out on my own\"</li></ul><h3>The Lesson</h3><p>Financial education works best when it brings people together across generations and experiences. Everyone has something to learn. Everyone has something to teach.</p><p><strong>Thank you to First Security Mortgage Corporation for sponsoring and to all the families who participated!</strong></p><img alt=\"Realtor class 1\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c35390634294162_624b2da8b169a964ae2da8cc_1.jpeg\"><img alt=\"Realtor class 2\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c3539fc26294160_624b2dcc8010998b63cc5c74_2.jpeg\"><img alt=\"Realtor class 3\" src=\"https://uploads-ssl.webflow.com/62a95a7e3f26b616be8fde9f/63751ed91c3539b6dc294161_624b2da86b21e66d89e7c72e_3.jpeg\">"
  }
]
